Repository: sebp/PyGObject-Tutorial
Catalog: translations/*/button_widgets.po
Languages: it

source: Button Widgets
it: I widget dei pulsanti

source: Button
it: Pulsante

source: The Button widget is another commonly used widget. It is generally used to attach a function that is called when the button is pressed.
it: ``Gtk.Button`` è un altro widget comune. E' generalmente utilizzato per associare una funzione da chiamare quando un pulsante viene premuto.

source: The :class:`Gtk.Button` widget can hold any valid child widget. That is it can hold most any other standard :class:`Gtk.Widget`. The most commonly used child is the :class:`Gtk.Label`.
it: Il widget :class:`Gtk.Button` può contenere qualsiasi widget figlio valido. E così può contenere molti altri standard :class:`Gtk.Widget`. Il widget figlio più comunemente utilizzato è :class:`Gtk.Label`.

source: Usually, you want to connect to the button's "clicked" signal which is emitted when the button has been pressed and released.
it: Di solito, si desidera collegare al pulsante il segnale "clicked" il quale viene emesso quando il pulsante è stato premuto e rilasciato.

source: Button Objects
it: Oggetti Button

source: If label is not ``None``, creates a new :class:`Gtk.Button` with a :class:`Gtk.Label` child containing the given text.
it: Se l'etichetta non è ``None``, si crea un oggetto :class:`Gtk.Button` con un widget figlio :class:`Gtk.Label` contenente il testo indicato.

source: If *stock* is not ``None``, creates a new button containing the image and text from a :ref:`stock item <stock-items>`.
it: Se *stock* non è ``None``, crea un nuovo pulsante contenente l'immagine e il testo da un :ref:`elemento stock <stock-items>`.

source: If *use_underline* is set to ``True``, an underline in the text indicates the next character should be used for the mnemonic accelerator key.
it: Se *use_underline* è impostato su ``True``, una sottolineatura nel testo indica che il carattere successivo deve essere utilizzato per il tasto di scelta rapida mnemonics.

source: Sets the text of the label of the button to *label*.
it: Imposta il testo dell'etichetta del pulsante a *label*.

source: If *True*, an underline in the text of the button label indicates the next character should be used for the mnemonic accelerator key.
it: Se *True*, una sottolineatura nel testo dell'etichetta del pulsante indica che il carattere successivo viene utilizzato per il tasto di scelta rapida mnemonics.

source: Example
it: Esempio

source: A :class:`Gtk.ToggleButton` is very similar to a normal :class:`Gtk.Button`, but when clicked they remain activated, or pressed, until clicked again. When the state of the button is changed, the "toggled" signal is emitted.
it: Un :class:`Gtk.ToggleButton` è molto simile ad un normale :class:`Gtk.Button`, ma quando si fa clic rimangono attivati, o premuti, finché non si fa clic di nuovo. Quando lo stato del pulsante viene modificato, il segnale "toggled" viene emesso.

source: To retrieve the state of the :class:`Gtk.ToggleButton`, you can use the :meth:`Gtk.ToggleButton.get_active` method. This returns ``True`` if the button is "down". You can also set the toggle button's state, with :meth:`Gtk.ToggleButton.set_active`. Note that, if you do this, and the state actually changes, it causes the "toggled" signal to be emitted.
it: Per recuperare lo stato di un :class:`Gtk.ToggleButton`, è possibile utilizzare il metodo :meth:`Gtk.ToggleButton.get_active`. Ciò restituisce ``True`` se il pulsante è premuto. È inoltre possibile impostare lo stato del pulsante di commutazione con :meth:`Gtk.ToggleButton.set_active`. Si noti che facendo ciò, e lo stato cambia, causerà l'emissione del segnale "toggled".

source: ToggleButton Objects
it: Oggetti ToggleButton

source: The arguments are the same as for the :class:`Gtk.Button` constructor.
it: Gli argomenti sono gli stessi che per il costruttore di :class:`Gtk.Button`.

source: Returns the buttons current state. Returns ``True`` if the toggle button is pressed in and ``False`` if it is raised.
it: Restituisce lo stato attuale dei pulsanti. `` True`` se il pulsante di commutazione è premuto e ``False`` in caso contrario.

source: Sets the status of the toggle button. Set to ``True`` if you want the button to be pressed in, and ``False`` to raise it. This action causes the "toggled" signal to be emitted.
it: Imposta lo stato del pulsante di commutazione. Impostato a ``True`` se si desidera che il pulsante sia premuto, e `` False`` in caso contrario. Questa azione fa sì che venga emesso il segnale "toggled".

source: :class:`Gtk.CheckButton` inherits from :class:`Gtk.ToggleButton`. The only real difference between the two is :class:`Gtk.CheckButton`'s appearance. A :class:`Gtk.CheckButton` places a discrete :class:`Gtk.ToggleButton` next to a widget, (usually a :class:`Gtk.Label`). The "toggled" signal, :meth:`Gtk.ToggleButton.set_active` and :meth:`Gtk.ToggleButton.get_active` are inherited.
it: :class:`Gtk.CheckButton` eredita da :class:`Gtk.ToggleButton`. L'unica vera differenza tra i due è l'aspetto di :class:`Gtk.CheckButton`. Quest'ultima posiziona un discreto :class:`Gtk.ToggleButton` accanto a un widget (di solito un :class:`Gtk.Label`). Il segnale "toggled", :meth:`Gtk.ToggleButton.set_active` e :meth:`Gtk.ToggleButton.get_active` vengono ereditate.

source: CheckButton Objects
it: Oggetti CheckButton

source: Arguments are the same as for :class:`Gtk.Button`.
it: Gli argomenti sono gli stessi di :class:`Gtk.Button`.

source: Like checkboxes, radio buttons also inherit from :class:`Gtk.ToggleButton`, but these work in groups, and only one :class:`Gtk.RadioButton` in a group can be selected at any one time. Therefore, a :class:`Gtk.RadioButton` is one way of giving the user a choice from many options.
it: Come le caselle di controllo, i pulsanti di scelta ereditano anche da :class:`Gtk.ToggleButton`, ma questi ultimi due lavorano in gruppo, e solo un :class:`Gtk.RadioButton` in un gruppo può essere selezionato in qualsiasi momento. Pertanto, un :class:`Gtk.RadioButton` è un modo di dare all'utente una scelta tra molte opzioni.

source: Radio buttons can be created with one of the static methods :meth:`Gtk.RadioButton.new_from_widget`, :meth:`Gtk.RadioButton.new_with_label_from_widget` or :meth:`Gtk.RadioButton.new_with_mnemonic_from_widget`. The first radio button in a group will be created passing ``None`` as the *group* argument. In subsequent calls, the group you wish to add this button to should be passed as an argument.
it: I pulsanti di scelta (radio button) possono essere creati con uno dei metodi statici :meth:`Gtk.RadioButton.new_from_widget`, :meth:`Gtk.RadioButton.new_with_label_from_widget` o :meth:`Gtk.RadioButton.new_with_mnemonic_from_widget`. Il primo pulsante di scelta in un gruppo verrà creato passando ``None`` come argomento *group*. Nelle chiamate successive, il gruppo al quale si desidera aggiungere questo pulsante dovrebbe essere passato come argomento.

source: When first run, the first radio button in the group will be active. This can be changed by calling :meth:`Gtk.ToggleButton.set_active` with ``True`` as first argument.
it: Alla prima esecuzione, il primo pulsante di scelta nel gruppo sarà attivo. Questo può essere cambiato chiamando :meth:`Gtk.ToggleButton.set_active` con ``True`` come primo argomento.

source: Changing a :class:`Gtk.RadioButton`'s widget group after its creation can be achieved by calling :meth:`Gtk.RadioButton.join_group`.
it: Per cambiare il gruppo di widget di un :class:`Gtk.RadioButton`dopo la sua creazione, fate riferimento a :meth:`Gtk.RadioButton.join_group`.

source: RadioButton Objects
it: Oggetti RadioButton

source: Creates a new :class:`Gtk.RadioButton`, adding it to the same group as the *group* widget. If *group* is ``None``, a new group is created.
it: Crea un nuovo :class:`Gtk.RadioButton`, aggiungendolo allo stesso gruppo del widget *group*. Se *group* è ``None``, viene creato un nuovo gruppo.

source: Creates a new :class:`Gtk.RadioButton`. The text of the label widget inside the button will be set to *label*. *group* is the same as for :meth:`new_from_widget`.
it: Crea una nuova :class:`Gtk.RadioButton`. Il testo del widget dentro il pulsante sarà impostato a *label*. *group* sarà lo stesso per :meth:`new_from_widget`.

source: Same as :meth:`new_with_label_from_widget`, but underscores in *label* indicate the mnemonic for the button.
it: Come :meth:`new_with_label_from_widget`, ma la sottolineatura in *label* indica il tasto di scelta rapida mnemonics per il pulsante.

source: Joins this radio button to the group of another :class:`Gtk.RadioButton` object.
it: Unisce questo pulsante di scelta al gruppo o ad un'altro oggetto :class:`Gtk.RadioButton`.

source: A :class:`Gtk.LinkButton` is a :class:`Gtk.Button` with a hyperlink, similar to the one used by web browsers, which triggers an action when clicked. It is useful to show quick links to resources.
it: Il :class:`Gtk.LinkButton` è un :class:`Gtk.Button` con un collegamento ipertestuale, simile a quello utilizzato dai browser web, che innesca un'azione quando si fa clic. E' utile per mostrare collegamenti rapidi alle risorse.

source: The URI bound to a :class:`Gtk.LinkButton` can be set specifically using :meth:`Gtk.LinkButton.set_uri`, and retrieved using :meth:`Gtk.LinkButton.get_uri`.
it: L'URI associato a una :class:`Gtk.LinkButton` può essere impostato specificamente utilizzando :meth:`Gtk.LinkButton.set_uri` e recuperato utilizzando :meth:`Gtk.LinkButton.get_uri`.

source: LinkButton Objects
it: Oggetti LinkButton

source: *uri* is the address of the website which should be loaded. The label is set as the text which should be displayed. If it is set to ``None`` or omitted, the web address will be displayed instead.
it: *uri* è l'indirizzo del sito web che deve essere caricato. L'etichetta è impostata con il testo che deve essere visualizzato. Se è impostato a ``None`` o omesso, l'indirizzo web sarà visualizzato al suo posto.

source: Retrieves the URI set using :meth:`set_uri`.
it: Recupera l'indirizzo URI impostato utilizzando :meth:`set_uri`.

source: Sets *uri* as the URI where this button points to. As a side-effect this unsets the 'visited' state of the button.
it: Imposta *uri* come indirizzo URI di riferimento per questo pulsante. Come effetto collaterale questo disinserisce lo stato 'visitato' del pulsante.

source: A :class:`Gtk.SpinButton` is an ideal way to allow the user to set the value of some attribute. Rather than having to directly type a number into a :class:`Gtk.Entry`, :class:`Gtk.SpinButton` allows the user to click on one of two arrows to increment or decrement the displayed value. A value can still be typed in, with the bonus that it can be checked to ensure it is in a given range. The main properties of a :class:`Gtk.SpinButton` are set through :class:`Gtk.Adjustment`.
it: Un :class:`Gtk.SpinButton` è un modo ideale per consentire all'utente di impostare il valore di qualche attributo. Invece di dover digitare direttamente un numero in un :class:`Gtk.Entry`, :class:`Gtk.SpinButton` permette all'utente di fare clic su una delle due frecce per incrementare o decrementare il valore visualizzato. Un valore può ancora essere digitato, con il vantaggio che di essere controllato per assicurarsi che sia in un dato intervallo. Le principali proprietà di un :class:`Gtk.SpinButton` vengono impostate tramite :class:`Gtk.Adjustment`.

source: To change the value that :class:`Gtk.SpinButton` is showing, use :meth:`Gtk.SpinButton.set_value`. The value entered can either be an integer or float, depending on your requirements, use :meth:`Gtk.SpinButton.get_value` or :meth:`Gtk.SpinButton.get_value_as_int`, respectively.
it: Per modificare il valore mostrato da :class:`Gtk.SpinButton`, utilizzate :meth:`Gtk.SpinButton.set_value`. Il valore immesso può essere sia un numero intero o a virgola mobile, a seconda delle esigenze, utilizzando rispettivamente :meth:`Gtk.SpinButton.get_value` o :meth:`Gtk.SpinButton.get_value_as_int`.

source: When you allow the displaying of float values in the spin button, you may wish to adjust the number of decimal spaces displayed by calling :meth:`Gtk.SpinButton.set_digits`.
it: Quando si consente la visualizzazione dei valori decimali nel pulsante di selezione, si potrebbe desiderare di regolare il numero di spazi decimali visualizzate chiamando :meth:`Gtk.SpinButton.set_digits`.

source: By default, :class:`Gtk.SpinButton` accepts textual data. If you wish to limit this to numerical values only, call :meth:`Gtk.SpinButton.set_numeric` with ``True`` as argument.
it: In maniera predefinita, :class:`Gtk.SpinButton` accetta dati testuali. Se si desidera limitare questo ai soli valori numerici, chiamate :meth:`Gtk.SpinButton.set_numeric` con ``True`` come argomento.

source: We can also adjust the update policy of :class:`Gtk.SpinButton`. There are two options here; by default the spin button updates the value even if the data entered is invalid. Alternatively, we can set the policy to only update when the value entered is valid by calling :meth:`Gtk.SpinButton.set_update_policy`.
it: Possiamo anche modificare la politica di aggiornamento di :class:`Gtk.SpinButton`. Ci sono due opzioni; in maniera predefinita il pulsante di selezione aggiorna il valore anche se il dato inserito non è valido. In alternativa, si può impostare la politica di aggiornamento solo quando il valore immesso è valido chiamando :meth:`Gtk.SpinButton.set_update_policy`.

source: SpinButton Objects
it: Oggetti SpinButton

source: Replaces the :class:`Gtk.Adjustment` associated with this spin button.
it: Sostituisce il :class:`Gtk.Adjustment` associato a questo pulsante di selezione.

source: Set the precision to be displayed by this spin button. Up to 20 digit precision is allowed.
it: Imposta la precisione della visualizzare per questo pulsante di selezione. Sono permesse fino a 20 cifre di precisione.

source: Sets the step and page increments for this spin button. This affects how quickly the value changes when the spin button's arrows are activated.
it: Imposta gli incrementi del passo della pagina per questo pulsante di selezione. Questo influenza la rapidità del cambio di valore quando le frecce del pulsante sono attivate.

source: Sets the value of this spin button.
it: Imposta il valore di questo pulsante di selezione.

source: Get the value of this spin button represented as an float.
it: Ottiene il valore di questo tasto di selezione rappresentato da un numero a virgola mobile.

source: Get the value of this spin button represented as an integer.
it: Ottiene il valore di questo pulsante di selezione rappresentato da un intero.

source: If *numeric* is ``False``, non-numeric text can be typed into the spin button, else only numbers can be typed.
it: Se *numeric* è ``False``, il valore non numerico può essere digitato nel pulsante di selezione, altrimenti solo i numeri possono essere digitati.

source: Sets the update behavior of a spin button. This determines whether the spin button is always updated or only when a valid value is set. The *policy* argument can either be :attr:`Gtk.SpinButtonUpdatePolicy.ALWAYS` or :attr:`Gtk.SpinButtonUpdatePolicy.IF_VALID`.
it: Imposta il comportamento di aggiornamento di un pulsante di selezione. Questo determina se il pulsante di selezione sia sempre aggiornato o solo quando un valore valido è impostato. L'argomento *policy* può essere :attr:`Gtk.SpinButtonUpdatePolicy.ALWAYS` o :attr:`Gtk.SpinButtonUpdatePolicy.IF_VALID`.

source: Adjustment Objects
it: Oggetti Adjustment

source: The :class:`Gtk.Adjustment` object represents a value which has an associated lower and upper bound, together with step and page increments, and a page size. It is used within several GTK+ widgets, including :class:`Gtk.SpinButton`, :class:`Gtk.Viewport`, and :class:`Gtk.Range`.
it: L'oggetto :class:`Gtk.Adjustment` rappresenta un valore che ha un associato un limite inferiore e superiore, insieme ad un passo, un incremento e una dimensione di pagina. E 'utilizzato all'interno di diversi widget GTK+, incluso :class:`Gtk.SpinButton`, :class:`Gtk.Viewport` e :class:`Gtk.Range`.

source: *value* is the initial value, *lower* the minimum value, *upper* the maximum value, *step_increment* the step increment, *page_increment* the page increment, and *page_size* the page size.
it: *value* è il valore iniziale, *lower* è il valore minimo, *upper* è il valore massimo, *step_increment* l'incremento di passo, *page_increment* l'incremento di pagina e *page_size* la dimensione della pagina.
