Repository: sebp/PyGObject-Tutorial
Catalog: translations/*/cellrenderers.po
Languages: it

source: :class:`Gtk.CellRenderer` widgets are used to display information within widgets such as the :class:`Gtk.TreeView` or :class:`Gtk.ComboBox`. They work closely with the associated widgets and are very powerful, with lots of configuration options for displaying a large amount of data in different ways. There are seven :class:`Gtk.CellRenderer` widgets which can be used for different purposes:
it: I widget :class:`widget Gtk.CellRenderer` sono utilizzati per visualizzare informazioni all'interno di widget come :class:`Gtk.TreeView` o :class:`Gtk.ComboBox`. Essi lavorano a stretto contatto con i widget associati e sono molto potenti, con molte configurabili opzioni per la visualizzazione di una grande quantità di dati in differenti modalità. Ci sono sette :class:`widget Gtk.CellRenderer` utilizzabili per diversi scopi:

source: A :class:`Gtk.CellRendererText` renders a given text in its cell, using the font, color and style information provided by its properties. The text will be ellipsized if it is too long and the "ellipsize" property allows it.
it: Un :class:`Gtk.CellRendererText` mostra un determinato testo nella sua cella, utilizzando il carattere, il colore e lo stile indicato dalle sue proprietà. Il testo sarà abbreviato se è troppo lungo e se la proprietà "ellipsize" lo permette.

source: By default, text in :class:`Gtk.CellRendererText` widgets is not editable. This can be changed by setting the value of the "editable" property to ``True``:
it: In maniera predefinita, il testo nel widget :class:`Gtk.CellRendererText` non è modificabile. Questo può essere cambiato impostando il valore della proprietà "editable" a ``True``:

source: You can then connect to the "edited" signal and update your :class:`Gtk.TreeModel` accordingly.
it: È quindi possibile collegarsi al segnale "edited" e aggiornare di conseguenza il :class:`Gtk.TreeModel`.

source: CellRendererText Objects
it: Oggetti CellRendererText

source: Creates a new :class:`Gtk.CellRendererText` instance. Adjust how text is drawn using object properties. Also, with :class:`Gtk.TreeViewColumn`, you can bind a property to a value in a :class:`GtkTreeModel`. For example, you can bind the "text" property on the cell renderer to a string value in the model, thus rendering a different string in each row of the :class:`Gtk.TreeView`.
it: Crea una nuova istanza di :class:`Gtk.CellRendererText`. Regola come il testo sarà mostrato utilizzando le proprietà dell'oggetto. Inoltre, con :class:`Gtk.TreeViewColumn`, è possibile associare una proprietà ad un valore in :class:`GtkTreeModel`. Per esempio, associare la proprietà "text" nel renderer di cella ad una valore stringa nel modello, mostrando una stringa differente in ogni riga di :class:`Gtk.TreeView`.

source: Example
it: Esempio

source: :class:`Gtk.CellRendererToggle` renders a toggle button in a cell. The button is drawn as a radio- or checkbutton, depending on the "radio" property. When activated, it emits the "toggled" signal.
it: :class:`Gtk.CellRendererToggle` mostra un interruttore in una cella. Potrà essere un pulsante di scelta (radiobutton) o una casella di controllo (checkbutton), a seconda della proprietà "radio". Quando attivata, emetterà il segnale "toggled".

source: As a :class:`Gtk.CellRendererToggle` can have two states, active and not active, you most likely want to bind the "active" property on the cell renderer to a boolean value in the model, thus causing the check button to reflect the state of the model.
it: Come un :class:`Gtk.CellRendererToggle`, può avere due stati, attivo e non attivo, e se ne apprezzerà l'associabilità della proprietà "active" del renderer di cella a un valore booleano nel modello, facendo sì che il pulsante di controllo rifletta lo stato del modello.

source: CellRendererToggle Objects
it: Oggetti CellRendererToggle

source: Creates a new :class:`Gtk.CellRendererToggle` instance.
it: Crea una nuova istanza :class:`Gtk.CellRendererToggle`.

source: Activates or deactivates a cell renderer.
it: Attiva o disattiva un renderer di cella.

source: Returns whether the cell renderer is active.
it: Restituisce se il renderer di cella è attivo.

source: If *radio* is ``True``, the cell renderer renders a radio toggle (i.e. a toggle in a group of mutually-exclusive toggles). If ``False``, it renders a check toggle (a standalone boolean option).
it: Se la proprietà *radio* è ``True``, il renderer di cella mostra un interruttore di scelta (radio toggle, un gruppo di interruttori mutualmente esclusivi). Se la proprietà è ``False``, mostra un interruttore di controllo (check toggle, un interruttore autonomo per un'opzione booleana).

source: Returns whether we're rendering radio toggles rather than checkboxes.
it: Restituisce se stiamo mostrando degli interruttori di scelta anziché delle caselle di controllo (checkbox).

source: A :class:`Gtk.CellRendererPixbuf` can be used to render an image in a cell. It allows to render either a given :class:`Gdk.Pixbuf` (set via the "pixbuf" property) or a :ref:`stock item <stock-items>` (set via the "stock-id" property).
it: Un :class:`Gtk.CellRendererPixbuf` può essere utilizzato per mostrare un'immagine in una cella. Esso consente di mostrare sia un dato :class:`Gdk.Pixbuf` (configurabile tramite la proprietà "pixbuf") o un :ref:`elemento stock <stock-items>` (configurabile tramite la proprietà "stock-id").

source: CellRendererPixbuf Objects
it: Oggetti CellRendererPixbuf

source: Creates a new :class:`Gtk.CellRendererPixbuf`. Adjust rendering parameters using object properties. For example, you can bind the "pixbuf" or "stock-id" property on the cell renderer to a pixbuf value in the model, thus rendering a different image in each row of the :class:`Gtk.TreeView`.
it: Crea un nuovo :class:`Gtk.CellRendererPixbuf`. Configura i parametri di visualizzazione usando le proprietà dell'oggetto. Per esempio, è possibile associare la proprietà "pixbuf" o "stock-id" sul renderer di celle per un valore pixbuf nel modello, mostrando in tal modo un'immagine diversa in ogni riga del :class:`Gtk.TreeView`.

source: :class:`Gtk.CellRendererCombo` renders text in a cell like :class:`Gtk.CellRendererText` from which it is derived. But while the latter offers a simple entry to edit the text, :class:`Gtk.CellRendererCombo` offers a :class:`Gtk.ComboBox` widget to edit the text. The values to display in the combo box are taken from the :class:`Gtk.TreeModel` specified in the "model" property.
it: Un :class:`Gtk.CellRendererCombo` mostra un testo in una cella come :class:`Gtk.CellRendererText`, dal quale è derivato. Ma se il secondo offre una voce semplice per modificare il testo, il :class:`Gtk.CellRendererCombo` offre un widget :class:`Gtk.ComboBox` per modificare il testo. I valori da visualizzare nella casella combinata sono presi da :class:`Gtk.TreeModel` indicati nella proprietà "model".

source: The combo cell renderer takes care of adding a text cell renderer to the combo box and sets it to display the column specified by its "text-column" property.
it: Il renderer di cella delle caselle combinate si assicura di aggiungere un renderer di cella testo alla casella combinata, configurandolo per visualizzare la colonna specificata dalla proprietà "text-column".

source: A :class:`Gtk.CellRendererCombo` can operate in two modes. It can be used with and without an associated :class:`Gtk.Entry` widget, depending on the value of the "has-entry" property.
it: Un :class:`Gtk.CellRendererCombo` può funzionare in due modalità. Può essere utilizzato associandolo o meno ad un widget :class:`Gtk.Entry`, a seconda del valore della proprietà "has-entry".

source: CellRendererCombo Objects
it: Oggetti CellRendererCombo

source: Creates a new :class:`Gtk.CellRendererCombo`. Adjust how text is drawn using object properties. For example, you can bind the "text" property on the cell renderer to a string value in the model, thus rendering a different string in each row of the :class:`Gtk.TreeView`.
it: Crea un nuovo :class:`Gtk.CellRendererCombo`. Regola la visualizzazione del testo utilizzando le proprietà dell'oggetto. Per esempio, è possibile associare la proprietà "text" del renderer di cella a un valore stringa nel modello, per mostrare una stringa differente in ogni riga di :class:`Gtk.TreeView`.

source: :class:`Gtk.CellRendererProgress` renders a numeric value as a progress bar in a cell. Additionally, it can display a text on top of the progress bar.
it: Un :class:`Gtk.CellRendererProgress` mostra un valore numerico come barra di avanzamento in una cella. In aggiunta, può visualizzare un testo nella parte superiore alla barra.

source: The percentage value of the progress bar can be modified by changing the "value" property. Similar to :class:`Gtk.ProgressBar`, you can enable the *activity mode* by incrementing the "pulse" property instead of the "value" property.
it: Il valore percentuale della barra di avanzamento è configurabile tramite la proprietà "value". Analogamente a :class:`Gtk.ProgressBar`, si può usare la modalità di attività incrementando la proprietà "pulse" anziché quella di "value ".

source: CellRendererProgress Objects
it: Oggetti CellRendererProgress

source: Creates a new :class:`Gtk.CellRendererProgress`.
it: Crea un nuovo :class:`Gtk.CellRendererProgress`.

source: :class:`Gtk.CellRendererSpin` renders text in a cell like :class:`Gtk.CellRendererText` from which it is derived. But while the latter offers a simple entry to edit the text, :class:`Gtk.CellRendererSpin` offers a :class:`Gtk.SpinButton` widget. Of course, that means that the text has to be parseable as a floating point number.
it: Un :class:`Gtk.CellRendererSpin` mostra il testo in una cella come :class:` Gtk.CellRendererText`, dal quale è derivato. Ma mentre il secondo offre una voce semplice per modificare il testo, :class:`Gtk.CellRendererSpin` offre un widget :class:`Gtk.SpinButton`. Naturalmente, questo significa che il testo deve essere gestibile come un numero in virgola mobile.

source: The range of the spinbutton is taken from the adjustment property of the cell renderer, which can be set explicitly or mapped to a column in the tree model, like all properties of cell renders. :class:`Gtk.CellRendererSpin` also has properties for the climb rate and the number of digits to display.
it: L'intervallo di spinbutton è preso dalla proprietà di regolazione del renderer di cella, il quale può essere esplicitamente configurato o associato a una colonna nel modello ad albero, come tutte le proprietà del renderer di cella. Il :class:`Gtk.CellRendererSpin` ha anche un proprietà per il passo di incremento e il numero di cifre da visualizzare.

source: CellRendererSpin Objects
it: Oggetti CellRendererSpin

source: Creates a new :class:`Gtk.CellRendererSpin`.
it: Crea un nuovo :class:`Gtk.CellRendererSpin`.
