Repository: sebp/PyGObject-Tutorial
Catalog: translations/*/clipboard.po
Languages: it

source: :class:`Gtk.Clipboard` provides a storage area for a variety of data, including text and images. Using a clipboard allows this data to be shared between applications through actions such as copying, cutting, and pasting. These actions are usually done in three ways: using keyboard shortcuts, using a :class:`Gtk.MenuItem`, and connecting the functions to :class:`Gtk.Button` widgets.
it: :class:`Gtk.Clipboard` fornisce un'area di archiviazione per una varietà di dati, tra cui testo e immagini. Con un clipboard si possono condividere dati con altre applicazioni attraverso azioni come copia, taglia e incolla. Queste azioni si realizzano in tre modi: utilizzando le scorciatoie da tastiera, utilizzando un :class:`Gtk.MenuItem` e collegando le funzioni del widget :class:`Gtk.Button`.

source: There are multiple clipboard selections for different purposes. In most circumstances, the selection named ``CLIPBOARD`` is used for everyday copying and pasting. ``PRIMARY`` is another common selection which stores text selected by the user with the cursor.
it: Ci sono vari tipi di selezione negli appunti per scopi differenti. Nella maggior parte dei casi, la selezione col nome ``CLIPBOARD`` viene utilizzata per il copia e incolla quotidiano. ``PRIMARY`` è un altro comune modo di selezione che memorizza il testo selezionato dall'utente con il cursore.

source: Clipboard Objects
it: Oggetti Clipboard

source: Obtains the :class:`Gtk.Clipboard` for the given selection.
it: Ottiene il :class:`Gtk.Clipboard` per una data selezione.

source: *selection* is a :class:`Gdk.Atom` describing which clipboard to use. Predefined values include:
it: *selection* è un :classe:`Gdk.Atom` che descrive quale appunti utilizzare. I valori predefiniti sono:

source: Sets the contents of the clipboard to the given text.
it: Imposta i contenuti degli appunti ad un testo definito.

source: *text* is the string to put in the clipboard.
it: *text* è la stringa da mettere negli appunti.

source: *length* is the number of characters to store. It may be omitted to store the entire string.
it: *length* è il numero di caratteri da memorizzare. Può essere omesso per memorizzare l'intera stringa.

source: Sets the contents of the clipboard to the given image.
it: Imposta il contenuto degli appunti con l'immagine indicata.

source: *image* must be a :class:`Gdk.Pixbuf`. To retrieve one from a :class:`Gdk.Image`, use ``image.get_pixbuf()``.
it: *image* deve essere un :class:`Gdk.Pixbuf`. Per recuperarne uno da un :class:`Gdk.Image` utilizzate ``image.get_pixbuf ()``.

source: Returns the clipboard's content as a string, or returns ``None`` if the clipboard is empty or not currently holding text.
it: Restituisce il contenuto degli appunti sotto forma di stringa, oppure ``None`` se gli appunti sono vuoti o non detiene al momento alcun testo.

source: Returns the clipboard's content as a :class:`Gtk.Pixbuf`, or returns ``None`` if the clipboard is empty or not currently holding an image.
it: Restituisce il contenuto degli appunti come un :class:`Gtk.Pixbuf` o restituisce ``None`` se gli appunti sono vuoti o non sono attualmente in possesso di un immagine.

source: Stores the clipboard's data outside the application. Otherwise, data copied to the clipboard may be lost when the application exits.
it: Memorizza i dati della clipboard al di fuori dell'applicazione. Altrimenti, i dati copiati nella clipboard potrebbero essere persi quando l'applicazione termina.

source: Clears the contents of the clipboard. Use with caution; this may clear data from another application.
it: Pulisce il contenuto della clipboard. Utilizza con cauzione; questo potrebbe cancellare dati di altre applicazioni.

source: Example
it: Esempio
