Repository: sebp/PyGObject-Tutorial
Catalog: translations/*/combobox.po
Languages: it

source: A :class:`Gtk.ComboBox` allows for the selection of an item from a dropdown menu. They are preferable to having many radio buttons on screen as they take up less room. If appropriate, it can show extra information about each item, such as text, a picture, a checkbox, or a progress bar.
it: Un :class:`Gtk.ComboBox` permette la selezione di una voce da un menu. Sono preferiti anziché avere molti pulsanti opzione su schermo perché occupano meno spazio. Se del caso, può mostrare informazioni aggiuntive su ciascun elemento, ad esempio testo, un'immagine, una casella di controllo, o di una barra di avanzamento.

source: :class:`Gtk.ComboBox` is very similar to :class:`Gtk.TreeView`, as both use the model-view pattern; the list of valid choices is specified in the form of a tree model, and the display of the choices can be adapted to the data in the model by using :ref:`cell renderers <cellrenderers>`. If the combo box contains a large number of items, it may be better to display them in a grid rather than a list. This can be done by calling :meth:`Gtk.ComboBox.set_wrap_width`.
it: :class:`Gtk.ComboBox` è molto simile a :class:`Gtk.TreeView`, in quanto entrambi utilizzano il pattern model-view; l'elenco delle scelte valide è specificata nella forma di un modello di albero, e la visualizzazione delle scelte può essere adattata ai dati nel modello utilizzando il :ref:`renderer delle celle <cellRenderer>`. Se la casella combinata contiene un gran numero di elementi, è meglio visualizzarli in una griglia piuttosto che una lista. Questo può essere fatto chiamando il metodo :meth:`Gtk.ComboBox.set_wrap_width`.

source: The :class:`Gtk.ComboBox` widget usually restricts the user to the available choices, but it can optionally have an :class:`Gtk.Entry`, allowing the user to enter arbitrary text if none of the available choices are suitable. To do this, use one of the static methods :meth:`Gtk.ComboBox.new_with_entry` or :meth:`Gtk.ComboBox.new_with_model_and_entry` to create an :class:`Gtk.ComboBox` instance.
it: Il widget :class:`Gtk.ComboBox` di solito limita l'utente alle scelte disponibili, ma può opzionalmente avere un :class:`Gtk.Entry`, permettendo all'utente di inserire testo arbitrario se nessuna delle scelte disponibili risulta adeguata. Per fare questo, utilizzate uno dei metodi statici :meth:`Gtk.ComboBox.new_with_entry` o :meth:`Gtk.ComboBox.new_with_model_and_entry` per creare un'istanza di :class:`Gtk.ComboBox`.

source: For a simple list of textual choices, the model-view API of :class:`Gtk.ComboBox` can be a bit overwhelming. In this case, :class:`Gtk.ComboBoxText` offers a simple alternative. Both :class:`Gtk.ComboBox` and :class:`Gtk.ComboBoxText` can contain an entry.
it: Per un semplice elenco di scelte testuali, l'API model-view di :class:`Gtk.ComboBox` può essere un po' opprimente. In questo caso, :class:`Gtk.ComboBoxText` offre una semplice alternativa. Entrambi le classi :class:`Gtk.ComboBox` e :class:`Gtk.ComboBoxText` possono contenere una voce.

source: ComboBox objects
it: Oggetti ComboBox

source: Creates a new empty :class:`Gtk.ComboBox` with an entry.
it: Crea un nuovo :class:`Gtk.ComboBox` vuto con una voce.

source: Creates a new :class:`Gtk.ComboBox` with the model initialized to *model*.
it: Crea un nuovo :class:`Gtk.ComboBox` con il modello inizializzato da *model*.

source: Creates a new :class:`Gtk.ComboBox` with an entry and the model initialized to *model*.
it: Crea un nuovo :class:`Gtk.ComboBox` con una voce e il modello inizializzato da*model*.

source: Returns a :class:`Gtk.TreeIter` pointing to the current active item. If no active item exists, ``None`` is returned.
it: Restituisce un :class:`Gtk.TreeIter` con riferimento all'elemento correntemente attivo. Se non esiste alcune elemento attivo, viene restituito "None".

source: Sets the model used by this combo box to be *model*. Will unset a previously set model (if applicable). If model is ``None``, then it will unset the model. Note that this function does not clear the cell renderers.
it: Imposta il modello utilizzato da questa casella combinata al valore *model*. Sarà ripristinato il modello precedentemente impostato (se applicabile). Se il modello è ``None``, allora sarà cancellato il modello. Si noti che questa funzione non pulisce i renderer delle celle.

source: Returns the :class:`Gtk.TreeModel` which is acting as data source for this combo box.
it: Restituisce :class:`Gtk.TreeModel` il quale funge da sorgente dati per questa casella combinata.

source: Sets the model column which this combo box should use to get strings from to be *text_column*. The column *text_column* in the model of this combo box must be of type ``str``.
it: Imposta la colonna modello che questa casella combinata dovrebbe usare per essere * text_column *. La colonna *text_column* nel modello di questa casella combinata deve essere di tipo ``str``.

source: This is only relevant if this combo box has been created with the "has-entry" property set to ``True``.
it: Questo è rilevante se questa casella combinata è stata creata con la proprietà "has-entry" impostata a ``True``.

source: Sets the wrap width of this combo box to be *width*. The wrap width is basically the preferred number of columns when you want the popup to be layed out in a grid.
it: Imposta la larghezza dell'area di questa casella combinata a *width*. La larghezza dell'area è sostanzialmente il numero preferito di colonne quando si desidera che il popup sia mostrato in una griglia.

source: ComboBoxText objects
it: Oggetti ComboBoxText

source: Creates a new empty :class:`Gtk.ComboBoxText` with an entry.
it: Crea un nuovo :class:`Gtk.ComboBoxText` vuoto per una voce.

source: Appends *text* to the list of strings stored in this combo box.
it: Aggiunge *text* alla lista di stringhe memorizate in questa casella combinata.

source: Returns the currently active string in this combo box, or ``None`` if none is selected. If this combo box contains an entry, this function will return its contents (which will not necessarily be an item from the list).
it: Restituisce la stringa attualmente attiva in questa casella combinata, o ``None`` se non esiste selezione. Se questa casella combinata contiene una voce, questa funzione restituirà il suo contenuto (che non sarà necessariamente un elemento dalla lista).

source: Example
it: Esempio
