Repository: sebp/PyGObject-Tutorial
Catalog: translations/*/dialogs.po
Languages: it

source: Adds the :class:`Gtk.FileFilter` instance *filter* to the list of filters that the user can choose from. When a filter is selected, only files that are passed by that filter are displayed.
it: Aggiunge il *filter* dell'istanza :class:`Gtk.FileFilter` all'elenco di quelli disponibili all'utente per la scelta. Quando si seleziona un filtro, vengono visualizzati solo i file che sono conformi a quel filtro.

source: Sets the human-readable name of the filter; this is the string that will be displayed in the file selector user interface if there is a selectable list of filters.
it: Imposta il nome leggibile del filtro; questa è la stringa che verrà visualizzata nel selettore file se vi è un elenco di filtri selezionabili.

source: Adds a rule allowing a given mime type to filter.
it: Aggiunge una regola che consenta un determinato tipo MIME da filtrare.

source: Adds a rule allowing a shell style glob to a filter.
it: Aggiunge una regola che consenta un glob in stile shell per un filtro.
