Repository: sebp/PyGObject-Tutorial
Catalog: translations/*/dialogs.po
Languages: it

source: Dialogs
it: Finestra di dialogo

source: Dialog windows are very similar to standard windows, and are used to provide or retrieve information from the user. They are often used to provide a preferences window, for example. The major difference a dialog has is some prepacked widgets which layout the dialog automatically. From there, we can simply add labels, buttons, check buttons, etc. Another big difference is the handling of responses to control how the application should behave after the dialog has been interacted with.
it: Le finestre di dialogo sono molto simili a finestre standard, e sono utilizzate per fornire o recuperare informazioni dall'utente. Sono spesso utilizzate per fornire una finestra per le preferenze, per esempio. La differenza principale che una finestra di dialogo ha è essere fondata su alcuni widget per la propria visualizzazione automatica. Da lì, possiamo semplicemente aggiungere etichette, pulsanti, caselle di controllo, ecc.. Un'altra grande differenza è la gestione delle risposte per controllare come l'applicazione deve comportarsi dopo che si è interagito con la finestra di dialogo.

source: There are several derived Dialog classes which you might find useful. :class:`Gtk.MessageDialog` is used for most simple notifications. But at other times you might need to derive your own dialog class to provide more complex functionality.
it: Ci sono diverse classi derivate per le finestra di dialogo che potreste trovare utili. :class:`Gtk.MessageDialog` viene utilizzata per le notifiche più semplici. Ma altre volte potrebbe essere necessario derivare la propria classe per le finestra di dialogo per fornire funzionalità più complesse.

source: Custom Dialogs
it: Finestrd di dialogo personalizzate

source: To pack widgets into a custom dialog, you should pack them into the :class:`Gtk.Box`, available via :meth:`Gtk.Dialog.get_content_area`. To just add a :class:`Gtk.Button` to the bottom of the dialog, you could use the :meth:`Gtk.Dialog.add_button` method.
it: Per raccogliere widget in una finestra di dialogo personalizzata, li si dovrebbe mettere in :class:`Gtk.Box`, tramite :meth:`Gtk.Dialog.get_content_area`. Per aggiungere solo un :class:`Gtk.Button` alla parte inferiore della finestra di dialogo, è possibile utilizzare il metodo :meth:`Gtk.Dialog.add_button`.

source: A 'modal' dialog (that is, one which freezes the rest of the application from user input), can be created by calling :class:`Gtk.Dialog.set_modal` on the dialog or set the ``flags`` argument of the :class:`Gtk.Dialog` constructor to include the :attr:`Gtk.DialogFlags.MODAL` flag.
it: Una finestra di dialogo 'modale' (vale a dire, quello che blocca il resto dell'applicazione da input dell'utente), può essere creata chiamando :class:`Gtk.Dialog.set_modal` nella finestra di dialogo o impostando l'argomento ``flags`` del costruttore :class:`Gtk.Dialog` per includere il flag :attr:`Gtk.DialogFlags.MODAL`.

source: Clicking a button will emit a signal called "response". If you want to block waiting for a dialog to return before returning control flow to your code, you can call :meth:`Gtk.Dialog.run`. This method returns an int which may be a value from the :class:`Gtk.ResponseType` or it could be the custom response value that you specified in the :class:`Gtk.Dialog` constructor or :meth:`Gtk.Dialog.add_button`.
it: Facendo clic su un pulsante si emetterà un segnale chiamato "response" (risposta). Se si desidera mettere un blocco d'attesa su una finestra di dialogo, prima di restituire il flusso di controllo al proprio codice, è possibile chiamare :meth:`Gtk.Dialog.run`. Questo metodo restituisce un int che può essere un valore di :class:`Gtk.ResponseType` o potrebbe essere il valore di risposta personalizzata specificata nel costruttore :class:`Gtk.Dialog` o :meth:`Gtk.Dialog .add_button`.

source: Finally, there are two ways to remove a dialog. The :meth:`Gtk.Widget.hide` method removes the dialog from view, however keeps it stored in memory. This is useful to prevent having to construct the dialog again if it needs to be accessed at a later time. Alternatively, the :meth:`Gtk.Widget.destroy` method can be used to delete the dialog from memory once it is no longer needed. It should be noted that if the dialog needs to be accessed after it has been destroyed, it will need to be constructed again otherwise the dialog window will be empty.
it: Infine, ci sono due modi per rimuovere una finestra. Il metodo :meth:`Gtk.Widget.hide` rimuove la finestra di dialogo dalla vista, tuttavia la mantiene memorizzata. Ciò è utile per evitare di dover costruire nuovamente la finestra se deve essere letta in un secondo momento. In alternativa, il metodo :meth:`Gtk.Widget.destroy` può essere utilizzato per eliminare la finestra di dialogo dalla memoria una volta che non è più necessaria. Si noti che se la finestra deve essere accessibile dopo che è stata distrutta, dovrà essere costruita di nuovo altrimenti la finestra di dialogo sarà vuota.

source: Dialog Objects
it: Oggetti Dialog

source: Creates a new :class:`Gtk.Dialog` with title *title* and transient parent *parent*. The *flags* argument can be used to make the dialog model (:attr:`Gtk.DialogFlags.MODAL`) and/or to have it destroyed along with its transient parent (:attr:`Gtk.DialogFlags.DESTROY_WITH_PARENT`).
it: Crea una nuova :class:`Gtk.Dialog` con titolo *title* e genitore transitorio *parent*. L'argomento *flags* può essere utilizzato per il modello della finestra di dialogo (:attr:`Gtk.DialogFlags.MODAL`) e/o per distruggerla insieme al suo genitore transitorio (:attr:`Gtk.DialogFlags.DESTROY_WITH_PARENT`).

source: *buttons* is a tuple of buttons which can be set to provide a range of different buttons and responses. See the :meth:`add_button` method for details.
it: *buttons* è una tupla di tasti che può essere impostata per fornire una gamma di diversi pulsanti e risposte. Vedere il metodo :meth:`add_button` per i dettagli.

source: All arguments are optional and can be referred to as key-word arguments as well.
it: Tutti gli argomenti sono opzionali e possono essere indicati come argomenti chiave-parola.

source: Return the content area of of this dialog.
it: Restituisce il contenuto di questa finestra di dialogo.

source: Adds a button with the given text (or a stock button, if *button_text* is a :ref:`stock item <stock-items>`) and sets things up so that clicking the button will emit the "response" signal with the given *response_id*. The button is appended to the end of the dialog's action area.
it: Aggiunge un pulsante con il testo indicato (o un pulsante stock, se *button_text* è un :ref:`elemento stock <stock-items>`) e imposta le cose in modo che facendo clic sul pulsante si emetta il segnale "response" con il rispettivo *response_id*. Il pulsante è aggiunto alla fine della zona di azione della finestra di dialogo.

source: *response_id* can be any positive integer or one of the predefined :class:`Gtk.ResponseType` values:
it: *response_id* può essere un qualsiasi numero intero positivo o uno dei valori predefiniti in :class:`Gtk.ResponseType`:

source: The button widget is returned, but usually you don't need it.
it: Il pulsante widget viene restituito, ma di solito non è necessario.

source: Adds several buttons to this dialog using the button data passed as arguments to the method. This method is the same as calling :meth:`add_button` repeatedly. The button data pairs - button text (or :ref:`stock item <stock-items>`) and a response ID integer are passed individually. For example::
it: Aggiunge diversi pulsanti a questa finestra di dialogo utilizzando i dati dei pulsanti passati come argomenti al metodo. Questo metodo agisce come chiamare :meth:`add_button` ripetutamente. Le coppie dei dati pulsante - testo del pulsante (o :ref:`elementi stock <stock-items>`) e un intero ID di risposta - sono passati singolarmente. Per esempio::

source: Sets a dialog modal or non-modal. Modal dialogs prevent interaction with other windows in the same application.
it: Imposta una finestra di dialogo come modale o non modale. Le finestre di dialogo modali evitano l'interazione con altre finestre della stessa applicazione.

source: Blocks in a recursive main loop until the dialog either emits the "response" signal, or is destroyed. If the dialog is destroyed during the call to :meth:`run`, :meth:`run` returns :attr:`Gtk.ResponseType.NONE`. Otherwise, it returns the response ID from the "response" signal emission.
it: I blocchi in un ciclo principale ricorsivo durano fino a quando la finestra di dialogo emette il segnale di "response" o viene distrutta. Se la finestra di dialogo viene distrutta durante la chiamata a :meth:`run`, :meth:`run` restituisce :attr:`Gtk.ResponseType.NONE`. In caso contrario, restituisce l'ID risposta dal emissione di segnale "response".

source: Example
it: Esempio

source: :class:`Gtk.MessageDialog` is a convenience class, used to create simple, standard message dialogs, with a message, an icon, and buttons for user response You can specify the type of message and the text in the :class:`Gtk.MessageDialog` constructor, as well as specifying standard buttons.
it: :class:`Gtk.MessageDialog` è una classe di convenienza, utilizzata per creare semplici finestre di dialogo, messaggi standard, con un messaggio, una icona e pulsanti per la risposta degli utenti. È possibile specificare il tipo di messaggio e il testo nel costruttore :class:`Gtk.MessageDialog`, così come specificare pulsanti standard.

source: In some dialogs which require some further explanation of what has happened, a secondary text can be added. In this case, the primary message entered when creating the message dialog is made bigger and set to bold text. The secondary message can be set by calling :meth:`Gtk.MessageDialog.format_secondary_text`.
it: In alcune finestre di dialogo che richiedono ulteriori spiegazioni di quanto è successo, si può aggiungere un testo secondario. In questo caso, il messaggio principale inserito durante la creazione della finestra del messaggio è reso più grande e impostato in grassetto. Il messaggio secondario può essere impostato chiamando :meth:`Gtk.MessageDialog.format_secondary_text`.

source: MessageDialog Objects
it: Oggetti MessageDialog

source: Creates a new :class:`Gtk.MessageDialog` with transient parent *parent*. The *flags* argument can be used to make the dialog model (:attr:`Gtk.DialogFlags.MODAL`) and/or to have it destroyed along with its transient parent (:attr:`Gtk.DialogFlags.DESTROY_WITH_PARENT`).
it: Crea una nuova :class:`Gtk.MessageDialog` con genitore transitorio *parent*. Gli argomenti *flags* possono essere utilizzati per creare il modello della finestra di dialogo (:attr:`Gtk.DialogFlags.MODAL`) e/o distruggerlo insieme al suo genitore transitorio (:attr:`Gtk.DialogFlags.DESTROY_WITH_PARENT`).

source: *message_type* can be set to one of the following values:
it: *message_type* può essere impostato con uno dei seguenti valori:

source: :attr:`Gtk.MessageType.INFO`: Informational message
it: :attr:`Gtk.MessageType.INFO`: Messaggio informativo

source: :attr:`Gtk.MessageType.WARNING`: Non-fatal warning message
it: :attr:`Gtk.MessageType.WARNING`: Messaggio di avviso non fatale

source: :attr:`Gtk.MessageType.QUESTION`: Question requiring a choice
it: :attr:`Gtk.MessageType.QUESTION`: Domanda che richiede una scelta

source: :attr:`Gtk.MessageType.ERROR`: Fatal error message
it: :attr:`Gtk.MessageType.ERROR`: Messaggio di avviso fatale

source: :attr:`Gtk.MessageType.OTHER`: None of the above, doesn't get an icon
it: :attr:`Gtk.MessageType.OTHER`: Nessuna delle precedenti, senza un'icona

source: It is also possible to set a variety of buttons on the message dialog, to retrieve different responses from the user. One of the following values can be used:
it: È anche possibile impostare una serie di pulsanti sulla finestra del messaggio, per recuperare risposte diverse da parte dell'utente. Uno dei seguenti valori può essere utilizzato:

source: :attr:`Gtk.ButtonsType.NONE`: no buttons at all
it: :attr:`Gtk.ButtonsType.NONE`: nessun pulsante

source: :attr:`Gtk.ButtonsType.OK`: an OK button
it: :attr:`Gtk.ButtonsType.OK`: un pulsante Ok

source: :attr:`Gtk.ButtonsType.CLOSE`: a Close button
it: :attr:`Gtk.ButtonsType.CLOSE`: un pulsante Chiudi

source: :attr:`Gtk.ButtonsType.CANCEL`: a Cancel button
it: :attr:`Gtk.ButtonsType.CANCEL`: un pulsante Cancella

source: :attr:`Gtk.ButtonsType.YES_NO`: Yes and No buttons
it: :attr:`Gtk.ButtonsType.YES_NO`: i pulsanti Sì e No

source: :attr:`Gtk.ButtonsType.OK_CANCEL`: OK and Cancel buttons
it: :attr:`Gtk.ButtonsType.OK_CANCEL`: i pulsanti Ok e Cancella

source: Finally, *message_format* is some text that the user may want to see.
it: Infine, *message_format* è un testo che l'utente potrebbe voler vedere.

source: Sets the secondary text of the message dialog to be *message_format*.
it: Imposta il testo secondario della finestra di dialogo per essere *message_format*.

source: Note that setting a secondary text makes the primary text (*message_format* argument of :class:`Gtk.MessageDialog` constructor) become bold, unless you have provided explicit markup.
it: Si noti che l'impostazione di un testo secondario rende il testo primario (argomento *message_format* del costruttore :class:`Gtk.MessageDialog`) in grassetto, a meno che non si passi un markup esplicito.

source: The :class:`Gtk.FileChooserDialog` is suitable for use with "File/Open" or "File/Save" menu items. You can use all of the :class:`Gtk.FileChooser` methods on the file chooser dialog as well as those for :class:`Gtk.Dialog`.
it: Il :class:`Gtk.FileChooserDialog` è adatto per l'uso con "File/Apri" o le voci di menu "File/Salva". È possibile utilizzare tutti i metodi di :class:`Gtk.FileChooser` nella finestra di selezione del file così come quelli per :class:`Gtk.Dialog`.

source: When creating a :class:`Gtk.FileChooserDialog` you have to define the dialog's purpose:
it: Quando si crea un :class:`Gtk.FileChooserDialog` è necessario definire lo scopo della finestra di dialogo:

source: To select a file for opening, as for a File/Open command, use :attr:`Gtk.FileChooserAction.OPEN`
it: Per selezionare un file da aprire, come per un comando File/Apri, usate :attr:`Gtk.FileChooserAction.OPEN`

source: To save a file for the first time, as for a File/Save command, use :attr:`Gtk.FileChooserAction.SAVE`, and suggest a name such as "Untitled" with :meth:`Gtk.FileChooser.set_current_name`.
it: Per salvare un file la prima volta, come per un comando File/Salva, utilizzate :attr:`Gtk.FileChooserAction.SAVE` ed indicate un nome come "Senza nome" con :meth:`Gtk.FileChooser.set_current_name`.

source: To save a file under a different name, as for a File/Save As command, use :attr:`Gtk.FileChooserAction.SAVE`, and set the existing filename with :meth:`Gtk.FileChooser.set_filename`.
it: Per salvare un file con un nome diverso, come per un comando File/Salva, usate :attr:`Gtk.FileChooserAction.SAVE` e impostate il nome del file esistente con :meth:`Gtk.FileChooser.set_filename`.

source: To choose a folder instead of a file, use :attr:`Gtk.FileChooserAction.SELECT_FOLDER`.
it: Per scegliere una cartella invece di un file, utilizzate :attr:`Gtk.FileChooserAction.SELECT_FOLDER`.

source: :class:`Gtk.FileChooserDialog` inherits from :class:`Gtk.Dialog`, so buttons have response IDs such as :attr:`Gtk.ResponseType.ACCEPT` and :attr:`Gtk.ResponseType.CANCEL` which can be specified in the :class:`Gtk.FileChooserDialog` constructor. In contrast to :class:`Gtk.Dialog`, you can not use custom response codes with :class:`Gtk.FileChooserDialog`. It expects that at least one button will have of the following response IDs:
it: :class:`Gtk.FileChooserDialog` eredita da :class:`Gtk.Dialog`, così i pulsanti hanno risposte ID come, per esempio, :attr:`Gtk.ResponseType.ACCEPT` e :attr:`Gtk.ResponseType.CANCEL` i quali possono essere specificati nel costruttore :class:`Gtk.FileChooserDialog`. In contrasto a :class:`Gtk.Dialog`, non è possibile utilizzare codici di risposta personalizzati con :class:`Gtk.FileChooserDialog`. Si aspetta che almeno un pulsante abbia degli ID di risposta tra i seguenti:

source: When the user is finished selecting files, your program can get the selected names either as filenames (:meth:`Gtk.FileChooser.get_filename`) or as URIs (:meth:`Gtk.FileChooser.get_uri`).
it: Quando l'utente ha terminato la selezione dei file, il programma può ottenere i nomi selezionati sia come nomi file (:meth:`Gtk.FileChooser.get_filename`) o come URI (:meth:`Gtk.FileChooser.get_uri`).

source: By default, :class:`Gtk.FileChooser` only allows a single file to be selected at a time. To enable multiple files to be selected, use :meth:`Gtk.FileChooser.set_select_multiple`. Retrieving a list of selected files is possible with either :meth:`Gtk.FileChooser.get_filenames` or :meth:`Gtk.FileChooser.get_uris`.
it: In maniera predefinita, :class:`Gtk.FileChooser` consente la selezione di un solo file per volta. Per consentire la selezione di più file utilizzate :meth:`Gtk.FileChooser.set_select_multiple`. Estrarre un elenco di file selezionati è possibile con :meth:`Gtk.FileChooser.get_filenames` o: meth:`Gtk.FileChooser.get_uris`.

source: :class:`Gtk.FileChooser` also supports a variety of options which make the files and folders more configurable and accessible.
it: :class:`Gtk.FileChooser` supporta anche una varietà di opzioni che rendono i file e le cartelle maggiormente configurabili e accessibili.

source: :meth:`Gtk.FileChooser.set_local_only`: Only local files can be selected.
it: :meth:`Gtk.FileChooser.set_local_only`: Solo i file locali possono essere visualizzati.

source: :meth:`Gtk.FileChooser.show_hidden`: Hidden files and folders are displayed.
it: :meth:`Gtk.FileChooser.show_hidden`: Sono mostrati i file e le cartelle nascoste.

source: :meth:`Gtk.FileChooser.set_do_overwrite_confirmation`: If the file chooser was configured in :attr:`Gtk.FileChooserAction.SAVE` mode, it will present a confirmation dialog if the user types a file name that already exists.
it: :meth:`Gtk.FileChooser.set_do_overwrite_confirmation`: Se il selettore di file è stato configurato in modalità :attr:`Gtk.FileChooserAction.SAVE`, si presenterà una finestra di conferma se il nome file digitato esiste già.

source: Furthermore, you can specify which kind of files are displayed by creating :class:`Gtk.FileFilter` objects and calling :meth:`Gtk.FileChooser.add_filter`. The user can then select one of the added filters from a combo box at the bottom of the file chooser.
it: Inoltre, è possibile specificare quali tipi di file vengono visualizzati mediante la creazione degli oggetti :class:`Gtk.FileFilter` e chiamando :meth:`Gtk.FileChooser.add_filter`. L'utente può selezionare uno dei filtri aggiunti da un menu nella parte inferiore del selettore file.

source: FileChooser Objects
it: Oggetti FileChooser

source: Creates a new :class:`Gtk.FileChooserDialog` with title *title and transient parent *parent*.
it: Crea una nuovo :class:`Gtk.FileChooserDialog` con il titolo *title* e un genitore transitorio *parent*.

source: *action* can be one of the following:
it: *action* può essere una delle seguenti:

source: :attr:`Gtk.FileChooserAction.OPEN`: The file chooser will only let the user pick an existing file.
it: :attr:`Gtk.FileChooserAction.OPEN`: La finestra di selezione consente all'utente di indicare un file esistente.

source: :attr:`Gtk.FileChooserAction.SAVE`: The file chooser will let the user pick an existing file, or type in a new filename.
it: :attr:`Gtk.FileChooserAction.SAVE`: La finestra di selezione consente all'utente di indicare un file esistente o digitare un nuovo nome file.

source: :attr:`Gtk.FileChooserAction.SELECT_FOLDER`: The file chooser will let the user pick an existing folder.
it: :attr:`Gtk.FileChooserAction.SELECT_FOLDER`: La finestra di selezione consente all'utente di indicare una cartella esistente.

source: :attr:`Gtk.FileChooserAction.CREATE_FOLDER`: The file chooser will let the user name an existing or new folder.
it: :attr:`Gtk.FileChooserAction.CREATE_FOLDER`: La finestar di selezione consente all'utente di rinominare o creare una cartella.

source: The *buttons* argument has the same format as for the :class:`Gtk.Dialog` constructor.
it: L'argomento *buttons* ha lo stesso formato del costruttore :class:`Gtk.Dialog`.

source: Sets the current name in the file selector, as if entered by the user.
it: Imposta il nome attuale nel selettore di file, come se inserito dall'utente.

source: Sets *filename* as the current filename for the file chooser, by changing to the file's parent folder and actually selecting the file in list; all other files will be unselected. If the chooser is in :attr:`Gtk.FileChooserAction.SAVE` mode, the file's base name will also appear in the dialog's file name entry.
it: Imposta il *filename* come il nome file corrente per il selettore, passando alla cartella superiore e selezionando il file nella lista; tutti gli altri file saranno deselezionati. Se il selettore si trova in modalità :attr:`Gtk.FileChooserAction.SAVE`, il nome base del file apparirà anche come nome file nella finestra di dialogo.

source: Note that the file must exist, or nothing will be done except for the directory change.
it: Si noti che il file deve esistere, o nulla sarà fatto ad eccezione del cambio di directory.

source: Sets whether multiple files can be selected. This is only relevant if the mode is :attr:`Gtk.FileChooserAction.OPEN` or :attr:`Gtk.FileChooserAction.SELECT_FOLDER`.
it: Imposta se più file possono essere selezionati. Questo è rilevante solo se la modalità è :attr:`Gtk.FileChooserAction.OPEN` o :attr:`Gtk.FileChooserAction.SELECT_FOLDER`.

source: Sets whether only local files can be selected.
it: Imposta se solo i file locali possono essere selezionati.

source: Sets whether to display hidden files and folders.
it: Imposta se mostrare i file e le cartelle nascoste.

source: Sets whether to confirm overwriting in save mode.
it: Imposta se confermare la sovrascrittura in modalità provvisoria.

source: Returns the filename for the currently selected file in the file selector. If multiple files are selected, use :meth:`get_filenames` instead.
it: Restituisce il nome del file attualmente selezionato nel selettore. Se sono selezionati più file, utilizzate in alternativa :meth:`get_filenames`.

source: Returns a list of all the selected files and subfolders in the current folder. The returned names are full absolute paths. If files in the current folder cannot be represented as local filenames they will be ignored. Use :meth:`get_uris` instead.
it: Restituisce un elenco di tutti i file selezionati e sottocartelle nella cartella corrente. I nomi restituiti sono percorsi assoluti completi. Se i file nella cartella corrente non possono essere rappresentati con nomi di file locali saranno ignorati. Utilizzate in alternativa :meth:`get_uris`.

source: Returns the URI for the currently selected file in the file selector. If multiple files are selected, use :meth:`get_uris` instead.
it: Restituisce un URI per il file selezionato nel selettore. Se sono selezionati più file, utilizzate in alternativa :meth:`get_uris`.

source: Returns a list of all the selected files and subfolders in the current folder. The returned names are full absolute URIs.
it: Restituisce un elenco di tutti i file selezionati e le sottocartelle nella cartella corrente. I nomi restituiti sono URI assoluti.
