Repository: sebp/PyGObject-Tutorial
Catalog: translations/*/drag_and_drop.po
Languages: it

source: Versions of PyGObject < 3.0.3 contain a bug which does not allow drag and drop to function correctly. Therefore a version of PyGObject >= 3.0.3 is required for the following examples to work.
it: Le versioni di PyGObject <3.0.3 contengono un bug che non permette il funzionamento corretto del drag and drop. Pertanto è necessaria una versione di PyGObject >= 3.0.3 affinché si possa lavorare con i seguenti esempi.

source: Setting up drag and drop between widgets consists of selecting a drag source (the widget which the user starts the drag from) with the :meth:`Gtk.Widget.drag_source_set` method, selecting a drag destination (the widget which the user drops onto) with the :meth:`Gtk.Widget.drag_dest_set` method and then handling the relevant signals on both widgets.
it: La configurazione del drag and drop tra widget consiste nel selezionare una sorgente di trascinamento (il widget dal quale l'utente inizia il trascinamento) con il metodo :meth:`Gtk.Widget.drag_source_set`, selezionando una destinazione di trascinamento (il widget sul quale l'utente arriverà a destinazione) con il metodo :meth:`Gtk.Widget.drag_dest_set` e poi gestire i segnali rilevanti in entrambi i widget.

source: Instead of using :meth:`Gtk.Widget.drag_source_set` and :meth:`Gtk.Widget.drag_dest_set` some specialised widgets require the use of specific functions (such as :class:`Gtk.TreeView` and :class:`Gtk.IconView`).
it: Anziché usare :meth:`Gtk.Widget.drag_source_set` e :meth:`Gtk.Widget.drag_dest_set` alcuni widget specializzati richiedono l'uso di specifiche funzioni (come :class:`Gtk.TreeView` e :class:`Gtk.IconView`).

source: A basic drag and drop only requires the source to connect to the "drag-data-get" signal and the destination to connect to the "drag-data-received" signal. More complex things such as specific drop areas and custom drag icons will require you to connect to :ref:`additional signals <drag-signals>` and interact with the :class:`Gdk.DragContext` object it supplies.
it: A drag and drop base richiede solo la sorgente da collegare al segnale "drag-data-get" e la destinazione da collegare al segnale "drag-data-received". Le cose più complesse, come una specifica area di rilascio e le icone di trascinamento personalizzate, richiedono di collegarsi a :ref:`segnali aggiuntivi <drag-segnali>` e interagire con l'oggetto :class:`Gdk.DragContext`.

source: In order to transfer data between the source and destination, you must interact with the :class:`Gtk.SelectionData` variable supplied in the :ref:`"drag-data-get" <drag-signals>` and :ref:`"drag-data-received" <drag-signals>` signals using the :class:`Gtk.SelectionData` get and set methods.
it: Per trasferire i dati tra la sorgente e la destinazione, è necessario interagire con la :class:`Gtk.SelectionData` forniti nei segnali :ref:`drag-data-get <drag-signals>` e :ref:`drag-data-received <drag-signals>` utilizzando i metodi get e set di :class:`Gtk.SelectionData`.

source: Target Entries
it: Voci destinazione

source: To allow the drag source and destination to know what data they are receiving and sending, a common list of :class:`Gtk.TargetEntry's <Gtk.TargetEntry>` are required. A :class:`Gtk.TargetEntry` describes a piece of data that will be sent by the drag source and received by the drag destination.
it: Per informare l'origine di trascinamento e la destinazione di sapere quali dati che stanno inviando e ricevendo, è richiesto un comune elenco di <Gtk.TargetEntry> del widget :class:`Gtk.TargetEntry`. Quest'ultimo offre una descrizione dei dati che saranno inviati dalla sorgente di trascinamento e ricevuti dalla destinazione di trascinamento.

source: There are two ways of adding :class:`Gtk.TargetEntry's <Gtk.TargetEntry>` to a source and destination. If the drag and drop is simple and each target entry is of a different type, you can use the group of methods :meth:`mentioned here <Gtk.Widget.drag_source_add_text_targets>`.
it: Ci sono due modi di aggiungere <Gtk.TargetEntry> della classe :class:`Gtk.TargetEntry` ad una sorgente e destinazione. Se il drag and drop è semplice e ogni voce di destinazione è di tipo diverso, è possibile utilizzare il gruppo di metodi :meth:`menzionati qui <Gtk.Widget.drag_source_add_text_targets>`.

source: Drag and Drop Methods and Objects
it: Oggetti e metodi per il Drag and Drop

source: Sets the widget to be a drag source.
it: Imposta il widget per essere una sorgente di trascinamento.

source: *start_button_mask* are a combination of :attr:`Gdk.ModifierType` masks which sets which buttons must be pressed for a drag to occur. *targets* is a list of :class:`Gtk.TargetEntry's <Gtk.TargetEntry>` which describe the data to be passed between source and destination. *actions* are a combination :attr:`Gdk.DragAction` masks to show possible drag actions.
it: *start_button_mask* sono una combinazione di maschere :attr:`Gdk.ModifierType` le quali indicano quali tasti devono essere premuti affinché avvenga un trascinamento. *targets* è una lista di <Gtk.TargetEntry> della classe :class:`Gtk.TargetEntry che descrivono i dati da passare tra sorgente e destinazione. *actions* sono una combinazione di maschere :attr:`Gdk.DragAction` per mostrare possibili azioni di trascinamento.

source: Sets the widget to be a drag destination.
it: Imposta il widget per essere una destinazione di trascinamento.

source: *flags* are a combination of :attr:`Gtk.DestDefaults` masks which configures the processes which occur on a drag site. *targets* is a list of :class:`Gtk.TargetEntry's <Gtk.TargetEntry>` which describe the data to be passed between source and destination. *actions* are a combination :attr:`Gdk.DragAction` masks to show possible drag actions.
it: *flags* sono una combinazione di maschere :attr:`Gtk.DestDefaults` che configurano i processi che si verificano in una destinazione di trascinamento. *targets* è un elenco di <Gtk.TargetEntry> della classe :class:`Gtk.TargetEntry` che descrivono i dati da passare tra sorgente e destinazione. *actions* sono una combinazione di maschere :attr:`Gdk.DragAction` per mostrare possibili azioni di trascinamento.

source: Add a :class:`Gtk.TargetEntry` to the drag source/destination which contains a piece of text.
it: Aggiunge un :class:`Gtk.TargetEntry` alla sorgente di trascinamento e destinazione contenente una porzione di testo.

source: Add a :class:`Gtk.TargetEntry` to the drag source/destination which contains a :class:`GdkPixbuf.Pixbuf`.
it: Aggiunge un :class:`Gtk.TargetEntry` alla sorgente di trascinamento e destinazione contentente un :class:`GdkPixbuf.Pixbuf`.

source: Add a :class:`Gtk.TargetEntry` to the drag source/destination which contains a list of URIs.
it: Aggiunge un :class:`Gtk.TargetEntry` alla sorgente di trascinamento e destinazione contenente un elenco di URI.

source: Creates a new target entry.
it: Crea una nuova destinazione.

source: *target* is a string describing the type of data the target entry describes.
it: *target* è una stringa che descrive il tipo di dati che la voce di destinazione descrive.

source: *flags* controls under which conditions will the data be transferred in a drag and drop and is a combination of the :attr:`Gtk.TargetFlags` values:
it: *flags* controlla in quali condizioni i dati saranno trasferiti in un drag and drop ed è una combinazione di valori :attr:`Gtk.TargetFlags`:

source: :attr:`Gtk.TargetFlags.SAME_APP` - Only transferred in the same application
it: :attr:`Gtk.TargetFlags.SAME_APP` - Trasferito unicamente nella medesima applicazione

source: :attr:`Gtk.TargetFlags.SAME_WIDGET` - Only transferred within the same widget
it: :attr:`Gtk.TargetFlags.SAME_WIDGET` - Trasferito unicamente all'interno dello stesso widget

source: :attr:`Gtk.TargetFlags.OTHER_APP` - Only transferred in a different application
it: :attr:`Gtk.TargetFlags.OTHER_APP` - Trasferito unicamente in un'altra applicazione

source: :attr:`Gtk.TargetFlags.OTHER_WIDGET` - Only transferred within a different widget
it: :attr:`Gtk.TargetFlags.OTHER_WIDGET` - Trasferito unicamente all'interno di un widget diverso

source: *info* is an ID which the application can use to determine between different pieces of data contained in a drag and drop operation.
it: *info* è un ID che l'applicazione può utilizzare per determinare tra diversi parti di dati contenuti in una operazione di drag and drop.

source: Returns the contents of the text contained in selection data
it: Restituisce i contenuti del testo nei dati selezionati

source: Sets the contents of the text contained in selection data to *text*
it: Imposta i contenuti del testo contenuti nei dati selezionati a *text*

source: Returns the pixbuf contained in selection data
it: Restituisce il pixbuf contenuto nei dati selezionati

source: Sets the pixbuf contained in selection data to *pixbuf*
it: Imposta il pixbuf contenuto dai dati selezionati a *pixbuf*

source: Drag Source Signals
it: Segnali della sorgente di trascinamento

source: Name
it: Nome

source: When it is emitted
it: Quando è emesso

source: Common Purpose
it: Scopo comune

source: User starts a drag
it: L'utente inizia a trascinare

source: Set-up drag icon
it: Imposta l'icona di trascinamento

source: When drag data is requested by the destination
it: Quando i dati trascinati sono richiesti dalla destinazione

source: Transfer drag data from source to destination
it: Trasferisce i dati trascinati dalla sorgente alla destinazione

source: When a drag with the action Gdk.DragAction.MOVE is completed
it: Quando un trascinamento con l'azione Gdk.DragAction.MOVE è completata

source: Delete data from the source to complete the 'move'
it: Elimina i dati dalla sorgente per completare il 'movimento'

source: When the drag is complete
it: Quando il trascinamento è completato

source: Undo anything done in drag-begin
it: Annulla qualsiasi cosa fatta in drag-begin

source: Drag Destination Signals
it: Segnali per la destinazione del trascinamento

source: Drag icon moves over a drop area
it: Trascina un'icona muovendola in un'area di ricezione

source: Allow only certain areas to be dropped onto
it: Si consente solo ad alcune aree di ricevere

source: Icon is dropped onto a drag area
it: L'icona viene fatto cadere in una zona di trascinamento

source: When drag data is received by the destination
it: Quando i dati trascinati sono giunti a destinazione

source: Example
it: Esempio
