Repository: sebp/PyGObject-Tutorial
Catalog: translations/*/entry.po
Languages: it

source: Entry widgets allow the user to enter text. You can change the contents with the :meth:`Gtk.Entry.set_text` method, and read the current contents with the :meth:`Gtk.Entry.get_text` method. You can also limit the number of characters the Entry can take by calling :meth:`Gtk.Entry.set_max_length`.
it: I widgets delle voci consentono all'utente di inserire testo. È possibile modificare i contenuti con il metodo :meth:`Gtk.Entry.set_text`, e leggere il contenuto attuale con :meth:`Gtk.Entry.get_text`. È inoltre possibile limitare il numero di caratteri massimo della voce chiamando :meth:`Gtk.Entry.set_max_length`.

source: Occasionally you might want to make an Entry widget read-only. This can be done by passing ``False`` to the :meth:`Gtk.Entry.set_editable` method.
it: Occasionalmente si può desiderare di mettere un widget di questo tipo in sola lettura. Questo può essere fatto passando ``False`` al metodo :meth:`Gtk.Entry.set_editable`.

source: Entry widgets can also be used to retrieve passwords from the user. It is common practice to hide the characters typed into the entry to prevent revealing the password to a third party. Calling :meth:`Gtk.Entry.set_visibility` with ``False`` will cause the text to be hidden.
it: I widget delle voci possono anche essere utilizzati per recuperare password dall'utente. E' pratica comune nascondere i caratteri digitati nella voce per non rivelare la password a terzi. Chiamando :meth:`Gtk.Entry.set_visibility` con ` `False`` si nasconderà il testo.

source: :class:`Gtk.Entry` has the ability to display progress or activity information behind the text. This is similar to :class:`Gtk.ProgressBar` widget and is commonly found in web browsers to indicate how much of a page download has been completed. To make an entry display such information, use :meth:`Gtk.Entry.set_progress_fraction`, :meth:`Gtk.Entry.set_progress_pulse_step`, or :meth:`Gtk.Entry.progress_pulse`.
it: :class:`Gtk.Entry` ha la possibilità di visualizzare informazioni sull'avanzamento o l'attività dietro il testo. Questo è simile al widget :class:`Gtk.ProgressBar` ed è comunemente trovato nei browser web per indicare la parte completata di un download. Per far sì che una voce visualizzi questa informazione, utilizzate :meth:`Gtk.Entry.set_progress_fraction`, :meth:`Gtk.Entry.set_progress_pulse_step` o :meth:`Gtk.Entry.progress_pulse`.

source: Additionally, an Entry can show icons at either side of the entry. These icons can be activatable by clicking, can be set up as drag source and can have tooltips. To add an icon, use :meth:`Gtk.Entry.set_icon_from_stock` or one of the various other functions that set an icon from an icon name, a pixbuf, or icon theme. To set a tooltip on an icon, use :meth:`Gtk.Entry.set_icon_tooltip_text` or the corresponding function for markup.
it: In aggiunta, una voce può mostrare icone ai margini della propria casella. Queste icone possono essere attivabili con un clic, configurabili per il trascinamento e avere i suggerimenti. Per aggiungere un'icona, utilizzate :meth:`Gtk.Entry.set_icon_from_stock` o una delle varie altre funzioni che impostano un'icona da un nome icona, un pixbuf o un tema icone. Per impostare un suggerimento su un'icona, utilizzate :meth:`Gtk.Entry.set_icon_tooltip_text` o la funzione corrispondente per il markup.

source: Entry Objects
it: Oggetti Entry

source: Retrieves the contents of the entry widget.
it: Estrae il contenuto di un widget voce.

source: Sets the text in the widget to the given value, replacing the current contents.
it: Imposta il testo in un widget ad un dato valore, sostituendo i contenuti correnti.

source: Sets whether the contents of the entry are visible or not. When *visible* is set to ``False``, characters are displayed as the invisible char, and will also appear that way when the text in the entry widget is copied elsewhere.
it: Indica se il contenuto della voce è visibile o meno. Quando *visible* è impostato a ``False``, i caratteri vengono mascherati, e appariranno così anche quando il testo nel widget viene copiato altrove.

source: Sets the maximum allowed length of the contents of the widget. If the current contents are longer than the given length, then they will be truncated to fit.
it: Imposta la lunghezza massima consentita dei contenuti nel widget. Se i contenuti attuali sono più lunghi della lunghezza indicata, allora saranno troncati per adattarsi.

source: Determines if the user can edit the text in the editable widget or not. If *is_editable* is ``True``, the user is allowed to edit the text in the widget.
it: Determina se l'utente può modificare il testo nel widget o meno. Se *is_editable* è `` True``, l'utente è autorizzato a modificare il testo nel widget.

source: Causes the entry's progress indicator to "fill in" the given fraction of the bar. The fraction should be between 0.0 and 1.0, inclusive.
it: Fa in modo che l'indicatore di avanzamento della voce riempia la frazione indicata della barra. La frazione dovrebbe essere compresa tra 0,0 e 1,0, estremi inclusi.

source: Sets the fraction of total entry width to move the progress bouncing block for each call to :meth:`progress_pulse`.
it: Imposta la frazione della larghezza totale della voce per spostare il blocco di attività per ogni chiamata a :meth:`progress_pulse`.

source: Indicates that some progress is made, but you don't know how much. Causes the entry's progress indicator to enter "activity mode," where a block bounces back and forth. Each call to :meth:`progress_pulse` causes the block to move by a little bit (the amount of movement per pulse is determined by :meth:`set_progress_pulse_step`).
it: Indica l'avanzamento compiuto, senza un valore preciso. L'indicatore di avanzamento della voce entra in modalità "attività", dove un blocco rimbalza avanti e indietro. Ogni chiamata a :meth:`progress_pulse` provoca il movimento del blocco (la quantità di movimento per impulso è determinato da :meth:`set_progress_pulse_step`).

source: Sets the icon shown in the entry at the specified position from a :ref:`stock item <stock-items>`. If *stock_id* is ``None``, no icon will be shown in the specified position.
it: Imposta l'icona mostrata nella voce nella posizione specificata da :ref:`<stock-items>`. Se *stock_id* è ``None``, nessuna icona sarà visualizzata nella posizione specificata.

source: *icon_pos* specifies the side of the entry at which an icon is placed and can be one of
it: *icon_pos* specifica il lato della casella voce dove collocare un'icona e può assumere un valore tra

source: :attr:`Gtk.EntryIconPosition.PRIMARY`: At the beginning of the entry (depending on the text direction).
it: :attr:`Gtk.EntryIconPosition.PRIMARY`: Nella parte iniziale della casella voce (a seconda della direzione del testo).

source: :attr:`Gtk.EntryIconPosition.SECONDARY`: At the end of the entry (depending on the text direction).
it: :attr:`Gtk.EntryIconPosition.SECONDARY`: Nella parte finale della casella voce (a seconda della direzione del testo).

source: Sets *tooltip* as the contents of the tooltip for the icon at the specified position. If *tooltip* is ``None``, an existing tooltip is removed.
it: Imposta *tooltip* come il contenuto del suggerimento per l'icona nella posizione indicata. Se *tooltip* è `` None``, un suggerimento esistente viene rimosso.

source: For allowed values for *icon_pos* see :meth:`set_icon_from_stock`.
it: Per i valori consentiti da *icon_pos* fare riferimento a :meth:`set_icon_from_stock`.

source: Example
it: Esempio
