Repository: sebp/PyGObject-Tutorial
Catalog: translations/*/install.po
Languages: it, ja

source: Installation
it: Installazione
ja: インストール

source: The fist step before we start with actual coding consists of setting up `PyGObject`_ and its dependencies. PyGObject is a Python module that enables developers to access GObject-based libraries such as GTK+ within Python. It exclusively supports GTK+ version 3 or later. If you want to use GTK+ 2 in your application, use `PyGTK`_, instead.
it: Il primo passo prima di programmare consiste nel configurare `PyGObject`_ e le sue dipendenze. PyGObject è un modulo Python che consente agli sviluppatori di accedere alle librerie di tipo GObject come GTK+ in Python. Esso supporta esclusivamente GTK+ nella versione 3 o successiva. Se si desidera utilizzare GTK+ 2 nella propria applicazione, utilizzare in alternativa `PyGTK`_.
ja: 実際のコーディングを始める前の第一ステップは `PyGObject <https://live.gnome.org/PyGObject>`_ とそれに依存するパッケージの設定です。PyGObject は Python のモジュールの一つで、開発者が Python の中から GTK+ といった GObject ベースのいろいろなライブラリにアクセスできるようにするものです。GTK+ のバージョン 3 以降のみサポートしています。もし Python から GTK+ のバージョン 2 を使いたいのであれば、PyGObject の代わりに `PyGTK <http://www.pygtk.org/>`_ の方を設定して下さい。

source: Dependencies
it: Dipendenze
ja: いろいろな依存関係

source: GTK+3
ja: GTK+ バージョン 3

source: Python 2 (2.6 or later) or Python 3 (3.1 or later)
it: Python 2 (2.6 o successivo) o Python 3 (3.1 o successivo)
ja: Python 2 (バージョン 2.6 以上) または Python 3 (3.1 以上)

source: Prebuilt Packages
it: Pacchetti precompilati
ja: バイナリ・パッケージ

source: Recent versions of PyGObject and its dependencies are packaged by nearly all major Linux distributions. So, if you use Linux, you can probably get started by installing the package from the official repository for your distribution.
it: Le versioni recenti di PyGObject e le sue dipendenze sono distribuite da quasi tutte le principali distribuzioni di Linux. Quindi, se si utilizza Linux, probabilmente si può iniziare installando il pacchetto dal repository ufficiale della vostra distribuzione.
ja: 現在のバージョンの PyGObject とそれに依存するパッケージのほとんど全てが、主要な Linux ディストリビューションから提供されています。そのため Linux をお使いならば、対応するディストリビューションの公式リポジトリからパッケージをインストールするところから始めることができるでしょう。

source: Installing From Source
it: Istallare dal codice sorgente
ja: ソースからインストールする

source: The easiest way to install PyGObject from source is using `JHBuild`_. It is designed to easily build source packages and discover what dependencies need to be build and in what order. To setup JHBuild, please follow the `JHBuild manual`_.
it: Il modo più semplice per installare PyGObject dal codice sorgente è utilizzando `JHBuild`_. È stato progettato per compilare facilmente i pacchetti con il codice sorgente e scoprire quali dipendenze devono essere compilate e in che ordine. Per impostare JHBuild, seguire il `manuale JHBuild`_.
ja: PyGObject をソースからインストールする一番簡単な方法は `JHBuild <https://live.gnome.org/Jhbuild>`_ を利用することです。これはソース・パッケージのビルドと、それに必要な依存関係の解決を簡単にしてくれる設計がされています。この JHBuild の設定については、 `JHBuild のマニュアル <http://library.gnome.org/devel/jhbuild/unstable/>`_ に従ってみて下さい。

source: Once you have installed JHBuild successfully, download the latest configuration from [#]_. Copy files with the suffix `.modules` to JHBuild's module directory and the file `sample-tarball.jhbuildrc` to `~/.jhbuildrc`.
it: Dopo aver installato con successo JHBuild, scaricare l'ultima configurazione da [#]_. Copiare i file con il suffisso `.modules` nella directory del modulo di JHBuild e il file`sample-tarball.jhbuildrc` in `~ / .jhbuildrc`.
ja: JHBuild のインストールが完了したら 、 `[1] <#id1>`_ から最新版の設定をダウンロードして下さい。拡張子として .modules が付与されているいくつかのファイルを JHBuild のモジュール・フォルダにコピーして sample-tarball.jhbuildrc というファイルを ~/.jhbuildrc にリネームします。

source: If you have not done it before, verify that your build environment is setup correctly by running::
it: Se non è stato fatto prima, verificare che l'ambiente di compilazione sia configurato correttamente eseguendo::
ja: ここまでを完了できなかった場合、次のコマンドを使ってお使いの環境が正しく設定されているかどうかをチェックしてみて下さい::

source: It will print any applications and libraries that are currently missing on your system but required for building. You should install those using your distribution's package repository. A list of `package names <http://live.gnome.org/JhbuildDependencies>`_ for different distributions is maintained on the GNOME wiki. Run the command above again to ensure the required tools are present.
it: Elencherà tutte le applicazioni e le librerie attualmente assenti nel sistema, ma necessarie per la compilazione. E' necessario installarle dal repository di pacchetti della vostra distribuzione. Un elenco dei `pacchetti <http://live.gnome.org/JhbuildDependencies>`_ per le diverse distribuzioni è mantenuto sul wiki di GNOME. Eseguite nuovamente il comando indicato sopra per garantire che gli strumenti necessari siano presenti.
ja: お使いのシステムでビルドするのに必要であるものの、現在は不足しているアプリケーションやライブラリの名前が表示される場合があります。そのような場合はディストリビューションのパッケージ・リポジトリからインストールして下さい。GNOME の Wiki ページにはディストリビューション別に `パッケージ名 <http://live.gnome.org/JhbuildDependencies>`_ が一覧としてまとめられています。それから、もう一度、上のコマンドを実行して必要なツールが揃っているかどうかをしっかりと確認して下さい。

source: Executing the following command will build PyGObject and all its dependencies::
it: Eseguendo il seguente comando si compilerà PyGObject e tutte le sue dipendenze::
ja: 次のコマンドを実行して PyGObject とその他の必要なものをビルドして下さい::

source: Finally, you might want to install GTK+ from source as well::
it: Finalmente, si può installare GTK+ dal codice sorgente::
ja: 最後に、GTK+ も同じようにしてビルド・インストールして下さい::

source: To start a shell with the same environment as used by JHBuild, run::
it: Per avviare una shell con lo stesso ambiente utilizzato da JHBuild, eseguite::
ja: JHBuild が使用している環境と同じシェルを起動するには、次のようにします::
