Repository: sebp/PyGObject-Tutorial
Catalog: translations/*/layout.po
Languages: it

source: Layout Containers
it: Contenitori di layout

source: While many GUI toolkits require you to precisely place widgets in a window, using absolute positioning, GTK+ uses a different approach. Rather than specifying the position and size of each widget in the window, you can arrange your widgets in rows, columns, and/or tables. The size of your window can be determined automatically, based on the sizes of the widgets it contains. And the sizes of the widgets are, in turn, determined by the amount of text they contain, or the minimum and maximum sizes that you specify, and/or how you have requested that the available space should be shared between sets of widgets. You can perfect your layout by specifying padding distance and centering values for each of your widgets. GTK+ then uses all this information to resize and reposition everything sensibly and smoothly when the user manipulates the window.
it: Mentre molti toolkit GUI richiedono di posizionare con precisione i widget in una finestra, utilizzando il posizionamento assoluto, GTK + utilizza un approccio diverso. Invece di specificare la posizione e le dimensioni di ogni oggetto nella finestra, è possibile organizzare i widget in righe, colonne e/o tabelle. La dimensione della finestra può essere determinata automaticamente, in base alle dimensioni dei widget in esso contenuti. E le dimensioni dei widget sono, a loro volta, determinate dalla quantità di testo che contengono, o le dimensioni minime e massime specificate, e/o come si è chiesto che venga utilizzato lo spazio disponibile condiviso tra widget. È possibile perfezionare il layout specificando il padding e la centratura per ognuno dei vostri widget. GTK+ utilizza quindi tutte queste informazioni per ridimensionare e riposizionare tutto flessibilmente quando l'utente manipola la finestra.

source: GTK+ arranges widgets hierarchically, using *containers*. They are invisible to the end user and are inserted into a window, or placed within each other to layout components. There are two flavours of containers: single-child containers, which are all descendants of :class:`Gtk.Bin`, and multiple-child containers, which are descendants of :class:`Gtk.Container`. The most commonly used are vertical or horizontal boxes (:class:`Gtk.Box`), tables (:class:`Gtk.Table`) and grids (:class:`Gtk.Grid`).
it: GTK+ organizza i widget gerarchicamente, usando i *container* (contenitori di layout). Essi sono invisibili all'utente finale e sono inseriti in una finestra, o collocate all'interno di altre per organizzare la visualizzazione. Ci sono due tipi di contenitori: contenitori single-child, che sono tutti discendenti di :class:`Gtk.Bin`, e contenitori multiple-child, discendenti di :class:`Gtk.Container`. Le scatole più comunemente usate sono verticali o orizzontali (:class:`Gtk.Box`), tabele (:class:`Gtk.Table`) e griglie (:class:`Gtk.Grid`).

source: Boxes are invisible containers into which we can pack our widgets. When packing widgets into a horizontal box, the objects are inserted horizontally from left to right or right to left depending on whether :meth:`Gtk.Box.pack_start` or :meth:`Gtk.Box.pack_end` is used. In a vertical box, widgets are packed from top to bottom or vice versa. You may use any combination of boxes inside or beside other boxes to create the desired effect.
it: Le scatole (boxes) sono contenitori invisibili in cui possiamo collocare i nostri widget. Quando si aggiungono widget in una scatola orizzontale, gli oggetti vengono inseriti in senso orizzontale da sinistra a destra o da destra a sinistra a seconda che :meth:`Gtk.Box.pack_start` o :meth:`Gtk.Box.pack_end` siano utilizzati. In una scatola verticale, gli oggetti vengono inseriti dall'alto verso il basso o viceversa. È possibile utilizzare qualsiasi combinazione di scatole all'interno o accanto ad altre caselle per creare l'effetto desiderato.

source: Box Objects
it: Oggetti Box

source: The rectangular area of a :class:`Gtk.Box` is organized into either a single row or a single column of child widgets depending upon whether the "orientation" property is set to :attr:`Gtk.Orientation.HORIZONTAL` or :attr:`Gtk.Orientation.VERTICAL`.
it: L'area rettangolare di un contenitore :class:`Gtk.Box` è organizzata in una singola riga o una sola colonna di widget figli a seconda che la proprietà "orientation" (orientamento) sia impostata su :attr:`Gtk.Orientation.HORIZONTAL` o :attr:`Gtk.Orientation.VERTICAL`.

source: If *homogeneous* is ``True``, all widgets in the box will be the same size, of which the size is determined by the largest child widget. If it is omitted, *homogeneous* defaults to ``False``.
it: Se *homogeneous* è ``True``, tutti i widget nella casella avranno la medesima dimensione, la quale sarà determinata dal widget figlio più grande. Se è omesso, *homogeneous* ha come valore predefinito ``False``.

source: *spacing* is the number of pixels to place by default between children. If omitted, no spacing is used, i.e. *spacing* is set to 0.
it: *spacing* è il numero di pixel da inserire in maniera predefinita tra i widget figli. Se omesso, nessuna spaziatura è utilizzata, ovvero *spacing* è impostato su 0.

source: By default, child widgets are organized into a single row, i.e. the "orientation" property is set to :attr:`Gtk.Orientation.HORIZONTAL`.
it: In maniera predefinita, i widget figli sono organizzati in una singola riga, ovvero la proprietà "orientation" è impostata su :attr:`Gtk.Orientation.HORIZONTAL`.

source: :class:`Gtk.Box` uses a notion of *packing*. Packing refers to adding widgets with reference to a particular position in a :class:`Gtk.Container`. For a :class:`Gtk.Box`, there are two reference positions: the start and the end of the box. If "orientation" is :attr:`Gtk.Orientation.VERTICAL`, the start is defined as the top of the box and the end is defined as the bottom. If "orientation" is :attr:`Gtk.Orientation.HORIZONTAL`, the start is defined as the left side and the end is defined as the right side.
it: :class:`Gtk.Box` utilizza il concetto di *packing*. Questo termine fa riferimento all'aggiunta di widget con riferimento ad una particolare posizione di un :class:`Gtk.Container`. Per un :class:`Gtk.Box`, ci sono due posizioni di riferimento: l'inizio e la fine della scatola. Se "orientation" è :attr:`Gtk.Orientation.VERTICAL`, l'inizio è definito dalla parte superiore della scatola e la fine dal fondo. Se "orientation" è :attr:`Gtk.Orientation.HORIZONTAL`, l'inizio è definito dal lato sinistro e la fine dal lato destro.

source: Adds *child* to box, packed with reference to the start of box. The *child* is packed after any other child packed with reference to the start of box.
it: Aggiunge un widget figlio alla scatola, tenendo come riferimento l'inizio della stessa. Il widget figlio è collocato dopo qualsiasi altro figlio collocato con riferimento al l'inizio della scatola.

source: *child* should be a :class:`Gtk.Widget` to be added to this box. The *expand* argument when set to ``True`` allows the *child* widget to take all available space it can. Alternately, if the value is set to ``False``, the box will be shrunken to the same size as the child widget.
it: Il widget *figlio* dovrebbe essere un :class:`Gtk.Widget` da aggiungere in questa sezione. L'argomento *expand* (espandi), quando impostato a ``True``, permette al widget figlio di prendere tutto lo spazio disponibile. In alternativa, se il valore è impostato a ``False``, la casella sarà rimpicciolita alla stessa dimensione del widget figlio.

source: If the *fill* argument is set to ``True``, the *child* widget takes all available space and is equal to the size of the box. This only has an effect when *expand* is set to ``True``. A child is always allocated the full height of a horizontally oriented and the full width of a vertically oriented box. This option affects the other dimension.
it: Se l'argomento *fill* (riempimento) è impostato a `` True``, il widget figlio prenderò tutto lo spazio disponibile, pari alla dimensione della casella. Questo ha unicamente effetto quando *expand* è impostato su ``True``. Un widget figlio viene sempre allocato con l'intera altezza di una casella orientata orizzontalmente o la larghezza di una orientata verticalmente. Questa opzione influenza l'altra dimensione.

source: *padding* defines extra space in pixels to put between this child and its neighbours, over and above the global amount specified by "spacing" property. If *child* is a widget at one of the reference ends of box, then padding pixels are also put between *child* and the reference edge of this box.
it: Il *padding* definisce lo spazio extra in pixel per mettere tra questo widget figlio e i suoi vicini, al di là del valore globale specificato con la proprietà "spacing*. Se il widget figlio è in una delle estremità di riferimento della scatola, i pixel di padding saranno aggiunti tra il widget figlio e il bordo di riferimento della scatola.

source: Adds *child* to box, packed with reference to the end of box. The *child* is packed after (away from end of) any other child packed with reference to the end of box.
it: Aggiunge widget figli alla casella, tenendo come riferimento la parte finale della stessa. Il widget figlio è collocato dopo (a partire da) qualsiasi altro widget figlio con il medesimo riferimento di finale.

source: Arguments are the same as for :meth:`pack_start`.
it: Gli argomenti sono gli stessi di :meth:`pack_start`.

source: If *homogeneous* is ``True``, all widgets in the box will be the same size, of which the size is determined by the largest child widget.
it: Se *homogeneous* è ``True``, tutti i widget nella casella avranno la medesima dimensione, la quale sarà determinata dal widget figlio più grande.

source: Example
it: Esempio

source: Let's take a look at a slightly modified version of the extended example with two buttons.
it: Diamo uno sguardo ad una versione leggermente modificata del esempio esteso con due pulsanti.

source: First, we create a horizontally orientated box container where 6 pixels are placed between children. This box becomes the child of the top-level window.
it: In primo luogo, creiamo un contenitore box orientato in senso orizzontale in cui indichiamo 6 pixel di distanza tra i widget figli. Questa casella sarà il widget figlio della finestra di primo livello.

source: Subsequently, we add two different buttons to the box container.
it: Successivamente, si aggiungono due pulsanti diversi al contenitore box.

source: While with :meth:`Gtk.Box.pack_start` widgets are positioned from left to right, :meth:`Gtk.Box.pack_end` positions them from right to left.
it: Mentre con :meth:`widget Gtk.Box.pack_start` sono posizionati da sinistra a destra, :meth:`Gtk.Box.pack_end` li posiziona da destra a sinistra.

source: Grid
it: Grid (Griglia)

source: :class:`Gtk.Grid` is a container which arranges its child widgets in rows and columns, but you do not need to specify the dimensions in the constructor. Children are added using :meth:`Gtk.Grid.attach`. They can span multiple rows or columns. It is also possible to add a child next to an existing child, using :meth:`Gtk.Grid.attach_next_to`.
it: :class:`Gtk.Grid` è un contenitore che organizza i suoi widget figli in righe e colonne, ma non richiede di specificare le dimensioni del costruttore. I widget figli vengono aggiunti utilizzando :meth:`Gtk.Grid.attach`. Possono estendersi su più righe o colonne. È anche possibile aggiungere un widget figlio accanto ad un altro esistente, utilizzando :meth:`Gtk.Grid.attach_next_to`.

source: :class:`Gtk.Grid` can be used like a :class:`Gtk.Box` by just using :meth:`Gtk.Grid.add`, which will place children next to each other in the direction determined by the "orientation" property (defaults to :attr:`Gtk.Orientation.HORIZONTAL`).
it: :class:`Gtk.Grid` può essere utilizzato come un :class:`Gtk.Box` se si utilizza :meth:`Gtk.Grid.add`, il quale porrà i widget figli uno accanto all'altro nella direzione determinata dalla proprietà "orientation" (valore predefinito a :attr:`Gtk.Orientation.HORIZONTAL`).

source: Grid Objects
it: Oggetti Grid

source: Creates a new grid widget.
it: Crea un nuovo widget di tipo grid.

source: Adds *child* to this grid.
it: Aggiunte *figli* a questa griglia.

source: The position of *child* is determined by the index of the cell left to it (*left*) and above of it (*top*). The number of 'cells' that *child* will occupy is determined by *width* and *height*.
it: La posizione di *child* è determinata dall'indice della cella alla sua sinistra (*left*) e sopra di esso (*top*). Il numero di 'celle' che il *child* occuperà è determinato da *width* e *height*.

source: Adds *child* to this grid, next to *sibling*. *side* is the side of *sibling* that *child* is positioned next to. It can be one of
it: Aggiunge *child* a questa griglia, accanto al fratello, *sibling*. *side* è il lato di *sibling* al quale *child* si trova accanto. Può essere uno di

source: *width* and *height* determine the number of 'cells' that *child* will occupy.
it: *width* e *height* determinano il numero di 'celle' che *child* occuperà.

source: Adds *widget* to this grid in the direction determined by the "orientation" property.
it: Aggiunge *widget* a questa griglia nella direzione determinata dalla proprietà "orientation".

source: Table
it: Tabella

source: Tables allows us to place widgets in a grid similar to :class:`Gtk.Grid`.
it: Le tabelle ci permettono di posizionare widget in una griglia simile a :class:`Gtk.Grid`.

source: The grid's dimensions need to be specified in the :class:`Gtk.Table` constructor. To place a widget into a box, use :meth:`Gtk.Table.attach`.
it: Le dimensioni della griglia devono essere specificate nel costruttore :class:`Gtk.Table`. Per inserire un widget in una scatola, usate :meth:`Gtk.Table.attach`.

source: :meth:`Gtk.Table.set_row_spacing` and :meth:`Gtk.Table.set_col_spacing` set the spacing between the rows at the specified row or column. Note that for columns, the space goes to the right of the column, and for rows, the space goes below the row.
it: :meth:`Gtk.Table.set_row_spacing` e :meth:`Gtk.Table.set_col_spacing` impostano la spaziatura tra le righe e le colonne. Si noti che per le colonne, lo spazio parte a destra della colonna, e per le righe lo spazio viene posto sotto la riga.

source: You can also set a consistent spacing for all rows and/or columns with :meth:`Gtk.Table.set_row_spacings` and :meth:`Gtk.Table.set_col_spacings`. Note that with these calls, the last row and last column do not get any spacing.
it: È anche possibile impostare una spaziatura uniforme per tutte le righe e/o colonne con :meth:`Gtk.Table.set_row_spacings` e :meth:`Gtk.Table.set_col_spacings`. Si noti che con queste chiamate, l'ultima riga e l'ultima colonna non si ottengono alcuna spaziatura.

source: Table Objects
it: Oggetti Table

source: The first argument is the number of rows to make in the table, while the second, obviously, is the number of columns. If *homogeneous* is ``True``, the table cells will all be the same size (the size of the largest widget in the table).
it: Il primo argomento è il numero di righe da mettere nella tabella, mentre il secondo, ovviamente, è il numero di colonne. Se il valore *homogeneous* è ``True``, le celle della tabella saranno tutti della stessa dimensione (la dimensione del più grande widget nella tabella).

source: Adds a widget to a table.
it: Aggiunge un widget ad una tabella.

source: *child* is the widget that should be added to the table. The number of 'cells' that a widget will occupy is specified by *left_attach*, *right_attach*, *top_attach* and *bottom_attach*. These each represent the leftmost, rightmost, uppermost and lowest column and row numbers of the table. (Columns and rows are indexed from zero).
it: *child* è il widget che deve essere aggiunto alla tabella. Il numero di 'celle' che un widget occuperà è specificato da *left_attach*, *right_attach*, *top_attach* e *bottom_attach*. Ognuno di questi rappresentano le colonne più a sinistra, più a destra, più in alto e più in basso e i numeri riga della tabella. (Colonne e righe sono indicizzati da zero).

source: For example, if you want a button in the lower-right cell of a 2 x 2 table, and want it to occupy that cell only, then the code looks like the following.
it: Ad esempio, se si desidera un pulsante nella cella in basso a destra di una tabella 2 x 2, e si vuole che occupi solamente quella cella, il codice sarà simile alla seguente.

source: If, on the other hand, you wanted a widget to take up the entire top row of our 2 x 2 table, you'd use
it: Se, d'altra parte, si voleva un widget in grado di occupare l'intera riga in alto della nostra tabella 2 x 2, si dovrebbe utilizzare

source: *xoptions* and *yoptions* are used to specify packing options and may be bitwise ORed together to allow multiple options. These options are:
it: *xoptions* e *yoptions* sono usate per specificare le opzioni di packing e possono essere bitwise ORed insieme per consentire più opzioni. Queste opzioni sono:

source: :attr:`Gtk.AttachOptions.EXPAND`: The widget should expand to take up any extra space in its container that has been allocated.
it: :attr:`Gtk.AttachOptions.EXPAND`: il widget dovrebbe espandersi per occupare qualsiasi spazio in più nel suo contenitore di quello allocato.

source: :attr:`Gtk.AttachOptions.FILL`: The widget will expand to use all the room available.
it: :attr:`Gtk.AttachOptions.FILL`: il widget si espanderà per utilizzare tutto lo spazio disponibile.

source: :attr:`Gtk.AttachOptions.SHRINK`: Reduce size allocated to the widget to prevent it from moving off screen.
it: :attr:`Gtk.AttachOptions.SHRINK`: ridurre le dimensioni assegnate al widget per evitare che si sposti fuori dallo schermo.

source: If omitted, *xoptions* and *yoptions* defaults to ``Gtk.AttachOptions.EXPAND | Gtk.AttachOptions.FILL``.
it: Se omesso, il valore predefinito di *xoptions* e *yoptions* è ``Gtk.AttachOptions.EXPAND | Gtk.AttachOptions.FILL``.

source: Finally, the padding arguments work just as they do for :meth:`Gtk.Box.pack_start`. If omitted, *xpadding* and *ypadding* defaults to ``0``.
it: Infine, gli argomenti di padding funzionano esattamente come quelli di :meth:`Gtk.Box.pack_start`. Se omesso, i valori di *xpadding* e *ypadding* è ``0``.

source: Changes the space between a given table row and the subsequent row.
it: Cambia lo spazio tra una riga di una data tabella e quella susseguente.

source: Alters the amount of space between a given table column and the following column.
it: Modifica lo spazio tra una colonna di una tabella e quella seguente.

source: Sets the space between every row in this table equal to *spacing*.
it: Imposta lo spazio tra ogni riga in questa tabella pari a *spacing*.

source: Sets the space between every column in this table equal to *spacing*.
it: Imposta lo spazio tra ogni colonna in questa tabella pari a *spacing*.
