Repository: sebp/PyGObject-Tutorial
Catalog: translations/*/menus.po
Languages: it

source: Menus
it: I menu

source: GTK+ comes with two different types of menus, :class:`Gtk.MenuBar` and :class:`Gtk.Toolbar`. :class:`Gtk.MenuBar` is a standard menu bar which contains one or more :class:`Gtk.MenuItem` instances or one of its subclasses. :class:`Gtk.Toolbar` widgets are used for quick accessibility to commonly used functions of an application. Examples include creating a new document, printing a page or undoing an operation. It contains one or more instances of :class:`Gtk.ToolItem` or one of its subclasses.
it: GTK + è dotato di due diversi tipi di menu, :class:`Gtk.MenuBar` e :class:`Gtk.Toolbar`. Il primo è una barra menu standard che contiene una o più istanze di :class:`Gtk.MenuItem` o una delle sue sottoclassi. I widget :class:`Gtk.Toolbar` sono utilizzati per accedere rapidamente alle funzioni d'uso comune di un'applicazione. Gli esempi includono la creazione di un nuovo documento, la stampa di una pagina o l'annullamento di un'operazione. Contiene una o più istanze di :class:`Gtk.ToolItem` o una delle sue sottoclassi.

source: Actions
it: Azioni

source: Although, there are specific APIs to create menus and toolbars, you should use :class:`Gtk.UIManager` and create :class:`Gtk.Action` instances. Actions are organised into groups. A :class:`Gtk.ActionGroup` is essentially a map from names to :class:`Gtk.Action` objects. All actions that would make sense to use in a particular context should be in a single group. Multiple action groups may be used for a particular user interface. In fact, it is expected that most non-trivial applications will make use of multiple groups. For example, in an application that can edit multiple documents, one group holding global actions (e.g. quit, about, new), and one group per document holding actions that act on that document (eg. save, cut/copy/paste, etc). Each window's menus would be constructed from a combination of two action groups.
it: Anche se ci sono specifiche API per creare menu e barre degli strumenti, è necessario utilizzate :class:`Gtk.UIManager` e creare istanze :class:`Gtk.Action`. Le azioni sono organizzate in gruppi. :class:`Gtk.ActionGroup` è essenzialmente una mappa da nomi a :class:`Gtk.Action`. Tutte le azioni che avrebbe senso utilizzare in un particolare contesto dovrebbe essere in un unico gruppo. Diversi gruppi di azione possono essere utilizzati per una particolare interfaccia utente. Infatti, si prevede che la maggior parte delle applicazioni non banali faranno uso di più gruppi. Per esempio, in un'applicazione che modifica più documenti, un gruppo che detiene azioni globali (es. Esci, Informazioni, Nuovo) e un gruppo per-documento con azioni specifiche allo stesso (es. Salva, Taglia / Copia / Incolla, ecc ). Ogni menu della finestra dovrebbe essere costruito da una combinazione di due gruppi di azioni.

source: Different classes representing different types of actions exist:
it: Esistono varie classi che rappresentano differenti tipi di azioni:

source: :class:`Gtk.Action`: An action which can be triggered by a menu or toolbar item
it: :class:`Gtk.Action`: Un'azione che può essere innescata da una voce di menu o della barra degli strumenti

source: :class:`Gtk.ToggleAction`: An action which can be toggled between two states
it: :class:`Gtk.ToggleAction`: Un'azione che può essere commutata tra due stati

source: :class:`Gtk.RadioAction`: An action of which only one in a group can be active
it: :class:`Gtk.RadioAction`: Un'azione unicamente attivabile tra quelle disponibili in un gruppo

source: :class:`Gtk.RecentAction`: An action of which represents a list of recently used files
it: :class:`Gtk.RecentAction`: Un'azione che rappresenta un elenco di file recentemente utilizzati

source: Actions represent operations that the user can be perform, along with some information how it should be presented in the interface, including its name (not for display), its label (for display), an accelerator, whether a label indicates a :ref:`stock item <stock-items>`, a tooltip, as well as the callback that is called when the action gets activated.
it: Le azioni rappresentano operazioni che l'utente può eseguire, insieme ad alcune informazioni sulle modalità di presentazione dell'interfaccia, compreso il suo nome (non per essere visto), l'etichetta (da visualizzare), un acceleratore, se una etichetta indica un :ref:`articolo stock <stock-items>`, un suggerimento, così come una callback che viene chiamata attivando l'azione.

source: You can create actions by either calling one of the constructors directly and adding them to a :class:`Gtk.ActionGroup` by calling :meth:`Gtk.ActionGroup.add_action` or :meth:`Gtk.ActionGroup.add_action_with_accel`, or by calling one of the convenience functions:
it: È possibile creare azioni sia chiamando direttamente uno dei costruttori e aggiungendoli a un :class:`Gtk.ActionGroup` con :meth:`Gtk.ActionGroup.add_action`, :meth:`Gtk.ActionGroup.add_action_with_accel` o una delle seguenti convenienti funzioni:

source: Note that you must specify actions for sub menus as well as menu items.
it: Si noti che è necessario specificare le azioni dei sotto menu e delle voci degli stessi.

source: Action Objects
it: Oggetti Action

source: *name* must be a unique name of the action.
it: *name* deve essere un nome univoco dell'azione

source: If *label* is not ``None``, it is displayed in menu items and on buttons.
it: Se *label* non è ``None``, viene mostrato negli elementi del menu e sui pulsanti.

source: If *tooltip* is not ``None``, it is used as tooltip for the action.
it: Se *tooltip* non è ``None``, viene usato come suggerimento per l'azione.

source: If *stock_id* is not ``None``, it is used to lookup the :ref:`stock item <stock-items>` to display in widgets representing the action.
it: Se *stock_id* non è ``None``, viene usata per cercare un :ref:`elemento stock <stock-items>` da mostrare nei widget per rappresentare l'azione.

source: The arguments are the same as for the :class:`Gtk.Action` constructor.
it: Gli argomenti sono gli stessi del costruttore :class:`Gtk.Action`.

source: The first four arguments are the same as for the :class:`Gtk.Action` constructor.
it: I primi quattro argomenti sono gli stessi del costruttore :class:`Gtk.Action`.

source: *value* indicates the value which :meth:`get_current_value` should return if this action is selected.
it: *value* indica il valore che :meth:`get_current_value` dodvrebbe restituire se questa azione è selezionata.

source: Obtains the "value" property of the currently active member of the group to which this action belongs.
it: Ottiene la proprietà "value" dell'attuale membro attivo del gruppo a cui appartiene questa azione.

source: Joins this radio action object to the group of the *group_source* radio action object.
it: Unisce questo oggetto azione (radio action) al gruppo indicato in *group_source*.

source: *group_source* must be a radio action object whose group we are joining, or ``None`` to remove the radio action from its group.
it: *group_source* deve essere un oggetto azione di scelta (radio action) che stiamo unendo in un gruppo, o ``None`` per rimuoverlo dal gruppo.

source: Creates a new :class:`Gtk.ActionGroup` instance. The name of the action group is used when associating keybindings with the actions.
it: Crea una nuova istanza :class:`Gtk.ActionGroup`. Il nome del gruppo di azione viene utilizzato associandolo a combinazioni di tasti con le azioni.

source: Adds an :class:`Gtk.Action` object to the action group.
it: Aggiunge un oggetto :class:`Gtk.Action` al gruppo di azione.

source: Note that this method does not set up the accelerator path of the action, use :meth:`add_action_with_accel` instead.
it: Si noti che questo metodo non imposta il percorso acceleratore dell'azione, piuttosto va usato :meth:`add_action_with_accel`.

source: Adds an :class:`Gtk.Action` object to the action group and sets up the accelerator.
it: Aggiunge un oggetto :class:`Gtk.Action` al gruppo di azione e imposta l'acceleratore.

source: *accelerator* must be in the format understood by :func:`Gtk.accelerator_parse`, or ``""`` for no accelerator, or ``None`` to use the stock accelerator.
it: *accelerator* deve essere in un formato comprensibile da :func:`Gtk.accelerator_parse`, o ``" "``per non avere alcun acceleratore, o ``None`` per usare un acceleratore di stock.

source: This is a convenience function to create a number of :class:`Gtk.Action` objects and add them to this action group.
it: Si tratta di una funzione di convenienza per creare un numero di oggetti :class:`oggetti Gtk.Action` da aggiungere a questo gruppo.

source: *entries* is a list of tuples which can vary in size from one to six items with the following information:
it: *entries* è una lista di tuple che può variare nella dimensione da uno a sei elementi con le seguenti informazioni:

source: The name of the action (mandatory)
it: Il nome dell'azione (obbligatorio)

source: The :ref:`stock item <stock-items>` of the action (default: ``None``)
it: L':ref:`elemento stock <stock-items>` dell'azione (predefinito: ``None``)

source: The label for the action (default: ``None``)
it: L'etichetta per l'azione (predefinito: ``None``)

source: The accelerator for the action, in the format understood by the :func:`Gtk.accelerator_parse` function (default: ``None``)
it: L'acceleratore per l'azione, in un formato comprensibile dalla funzione :func:`Gtk.accelerator_parse` (predefinito: ``None``)

source: The tooltip of the action (default: ``None``)
it: Il suggerimento per l'azione (predefinito: ``None``)

source: The callback function invoked when the action is activated (default: ``None``)
it: La funzione callback invocata quando l'azione è attivata (predefinito: ``None``)

source: The "activate" signals of the actions are connected to the callbacks.
it: Il segnale "activate" delle azioni sono collegate alle callbacks.

source: If *user_data* is not ``None``, it is passed to the callback function (if specified).
it: Se *user_data* non è ``None``, è passata alla funzione callback (se specificata).

source: This is a convenience function to create a number of :class:`Gtk.ToggleAction` objects and add them to this action group.
it: Questa è una funzione conveniente per creare un numero di oggetti :class:`Gtk.ToggleAction` e aggiungeri a questo gruppo.

source: *entries* is a list of tuples which can vary in size from one to seven items with the following information:
it: *entries* è una lista di tuple variabile nella dimensione da uno a sette elementi con le seguenti informazioni:

source: A Boolean indicating whether the toggle action is active (default: ``False``)
it: Un valore booleano che indica se l'interruttore dell'azione è attivo (predefinito: ``False``)

source: This is a convenience routine to create a group of :class:`Gtk.RadioAction` objects and add them to this action group.
it: Questo è una routine conveniente per creare un gruppo di oggetti :class:`Gtk.RadioAction` da aggiungere a questo gruppo.

source: The value to set on the radio action (default: 0)
it: Il valore da impostare in un'azione con scelta (predefinito: 0)

source: *value* specifies the radio action that should be set active.
it: *value* specifica l'azione a scelta che dovrebbe essere attiva.

source: The "changed" signal of the first radio action is connected to the *on_change* callback (if specified).
it: Il segnale "changed" della prima azione di scelta è collegato alla callback *on_change* (se indicato).

source: Parses a string representing an accelerator. The format looks like "<Control>a" or "<Shift><Alt>F1" or "<Release>z" (the last one is for key release). The parser is fairly liberal and allows lower or upper case, and also abbreviations such as "<Ctl>" and "<Ctrl>". For character keys the name is not the symbol, but the lowercase name, e.g. one would use "<Ctrl>minus" instead of "<Ctrl>-".
it: Analizza una stringa che rappresenta un acceleratore. Il formato si presenta come "<Control> a" o "<Shift><Alt>F1" o "<Release>z" (l'ultimo è per il rilascio del tasto). Il parser non è case sensitive, non tiene conto delle maiuscole o minuscole, e neppure delle abbreviazioni come "<Ctl>" e "<Ctrl>". Per tasti caratteri il nome non è il simbolo, ma il nome minuscolo, ad esempio si potrebbe usare "<Ctrl>minus" invece di "<Ctrl>-".

source: Returns a tuple ``(accelerator_key, accelerator_mods)``, where the latter represents the accelerator modifier mask and the first the accelerator keyval. Both values will be set to 0 (zero) if parsing failed.
it: Restituisce una tupla ``(accelerator_key, accelerator_mods) ``, dove quest'ultimo rappresenta l'acceleratore modificatore e il primo l'acceleratore della chiave. Entrambi i valori verranno impostati a 0 (zero) se l'analisi fallisce.

source: :class:`Gtk.UIManager` provides an easy way of creating menus and toolbars using an `XML-like description <http://developer.gnome.org/gtk3/stable/GtkUIManager.html#XML-UI>`_.
it: :class:`Gtk.UIManager` offre un modo semplice per creare menu e barre degli strumenti utilizzando una `descrizione XML-like <http://developer.gnome.org/gtk3/stable/GtkUIManager.html#XML-UI>`_.

source: First of all, you should add the :class:`Gtk.ActionGroup` to the UI Manager with :meth:`Gtk.UIManager.insert_action_group`. At this point is also a good idea to tell the parent window to respond to the specified keyboard shortcuts, by using :meth:`Gtk.UIManager.get_accel_group` and :meth:`Gtk.Window.add_accel_group`.
it: Prima di tutto, è necessario aggiungere :class:`Gtk.ActionGroup` al nostro UI Manager con :meth:`Gtk.UIManager.insert_action_group`. A questo punto è anche una buona idea indicare la finestra genitore che dovrà rispondere alle scorciatoie da tastiera, usando :meth:`Gtk.UIManager.get_accel_group` e :meth:`Gtk.Window.add_accel_group`.

source: Then, you can define the actual visible layout of the menus and toolbars, and add the UI layout. This "ui string" uses an XML format, in which you should mention the names of the actions that you have already created. Remember that these names are just the identifiers that we used when creating the actions. They are not the text that the user will see in the menus and toolbars. We provided those human-readable names when we created the actions.
it: Quindi, è possibile definire il layout visibile attuale dei menu e delle barre degli strumenti, e aggiungere il layout UI (dell'interfaccia utente). Questa stringa UI utilizza un formato XML, nel quale formato si dovrebbero citare i nomi delle azioni che avete già creato. Ricordate che questi nomi sono solo gli identificatori che abbiamo utilizzato durante la creazione di azioni. Essi non sono il testo che l'utente vedrà nei menu e nelle barre degli strumenti. Abbiamo fornito i nomi leggibili quando abbiamo creato le azioni.

source: Finally, you retrieve the root widget with :meth:`Gtk.UIManager.get_widget` and add the widget to a container such as :class:`Gtk.Box`.
it: Infine, si recupera il root widget con :meth:`Gtk.UIManager.get_widget` e lo si aggiunge ad un contenitore come :class:`Gtk.Box`.

source: UIManager Objects
it: Oggetti UIManager

source: Inserts an action group into the list of action groups associated with this manager. Actions in earlier groups hide actions with the same name in later groups.
it: Inserisce un gruppo di azione nella lista dei gruppi di azione associati a questo manager. Le azioni nei gruppi precedenti nascondono azioni con lo stesso nome per gruppi successivi.

source: *pos* is the position at which the group will be inserted. If omitted, it will be appended.
it: *pos* è la posizione in cui verrà inserito il gruppo. Se omesso, esso verrà accodato.

source: Returns the group of global keyboard accelerators associated with this manager.
it: Restituisce il gruppo di tasti di scelta rapida globali associati a questo manager.

source: Looks up a widget by following a path. The path consists of the names specified in the XML description of the UI. separated by '/'. Elements which don't have a name or action attribute in the XML (e.g. <popup>) can be addressed by their XML element name (e.g. "popup"). The root element ("/ui") can be omitted in the path.
it: Sembra un widget che segue un percorso. Il percorso è costituito dai nomi specificati nella descrizione XML dell'interfaccia utente, divisi da '/'. Gli elementi che non hanno un nome o un attributo azione nel XML (ad esempio <popup>) possono essere affrontati con il loro XML nome di un elemento (per esempio, "pop-up"). L'elemento root ("/ui") può essere omesso nel percorso.

source: Returns the widget found by following the *path*, or ``None`` if no widget was found.
it: Restituisce il widget trovato seguendo *path*, o ``None`` se nessun widget è stato trovato.

source: Parses *text* containing a `UI definition <http://developer.gnome.org/gtk3/stable/GtkUIManager.html#XML-UI>`_ and merges it with the current contents of manager. An enclosing <ui> element is added if it is missing.
it: Analizza *text* contenente una `definizione UI <http://developer.gnome.org/gtk3/stable/GtkUIManager.html#XML-UI>`_ e la unisce con il contenuto corrente del manager. Un elemento <ui> di chiusura è aggiunto se assente.

source: Returns the merge id for the merged UI.
it: Restituisce l'id unito per la risultante UI.

source: Throws an exception if an error occurred.
it: Genera un'eccezione se si è verificato un errore.

source: Example
it: Esempio
