Repository: sebp/PyGObject-Tutorial
Catalog: translations/*/progressbar.po
Languages: it

source: The :class:`Gtk.ProgressBar` is typically used to display the progress of a long running operation. It provides a visual clue that processing is underway. The :class:`Gtk.ProgressBar` can be used in two different modes: *percentage mode* and *activity mode*.
it: La classe :class:`Gtk.ProgressBar` viene in genere utilizzata per visualizzare l'avanzamento di un'operazione con lunga esecuzione. Fornisce un indicatore visivo sull'elaborazione in corso. :class:`Gtk.ProgressBar` può essere utilizzata in due modalità differenti: la *modalità percentuale* e la *modalità di attività*.

source: When an application can determine how much work needs to take place (e.g. read a fixed number of bytes from a file) and can monitor its progress, it can use the :class:`Gtk.ProgressBar` in *percentage mode* and the user sees a growing bar indicating the percentage of the work that has been completed. In this mode, the application is required to call :meth:`Gtk.ProgressBar.set_fraction` periodically to update the progress bar, passing a float between 0 and 1 to provide the new percentage value.
it: Quando un'applicazione può determinare la quantità di lavoro che dovrà deve avvenire (ad esempio, leggere un numero fisso di byte da un file) e può monitorare i progressi, si può utilizzare la :class:`Gtk.ProgressBar` in modalità *percentuale* e l'utente vedrà una barra che indica la percentuale di lavoro completato. In questo modo, l'applicazione è tenuta a chiamare :meth:`Gtk.ProgressBar.set_fraction` periodicamente per aggiornare la barra di avanzamento e passare un numero float compreso tra 0 e 1 per fornire il nuovo valore percentuale.

source: When an application has no accurate way of knowing the amount of work to do, it can use *activity mode*, which shows activity by a block moving back and forth within the progress area. In this mode, the application is required to call :meth:`Gtk.ProgressBar.pulse` periodically to update the progress bar. You can also choose the step size, with the :meth:`Gtk.ProgressBar.set_pulse_step` method.
it: Quando un'applicazione non ha modo preciso per sapere la quantità di lavoro da svolgere, è possibile utilizzare la modalità *attività*, la quale mostra un blocco che si muove avanti e indietro all'interno dell'area di progresso. In questo modo, l'applicazione è tenuto a chiamare :meth:`Gtk.ProgressBar.pulse` periodicamente per aggiornare la barra di avanzamento. È anche possibile scegliere la dimensione del passo, con il :meth:`metodo Gtk.ProgressBar.set_pulse_step`.

source: By default, :class:`Gtk.ProgressBar` is horizontal and left-to-right, but you can change it to a vertical progress bar by using the :meth:`Gtk.ProgressBar.set_orientation` method. Changing the direction the progress bar grows can be done using :meth:`Gtk.ProgressBar.set_inverted`. :class:`Gtk.ProgressBar` can also contain text which can be set by calling :meth:`Gtk.ProgressBar.set_text` and :meth:`Gtk.ProgressBar.set_show_text`.
it: In maniera predefinita, la :class:`Gtk.ProgressBar` è orizzontale e scorre da sinistra a destra, ma è possibile cambiarla in una barra di avanzamento verticale usando il metodo :meth:`Gtk.ProgressBar.set_orientation`. Cambiare la direzione della barra di avanzamento in questo nuovo orientamento è possibile utilizzando :meth:`Gtk.ProgressBar.set_inverted`. :class:`Gtk.ProgressBar` può anche contenere testo che può essere impostato con :meth:`Gtk.ProgressBar.set_text` e :meth:`Gtk.ProgressBar.set_show_text`.

source: ProgressBar Objects
it: Oggetti ProgressBar

source: Causes the progress bar to "fill in" the given fraction of the bar. *fraction* should be between 0.0 and 1.0, inclusive.
it: Fa in modo che la barra di avanzamento "riempia" la data porzione della barra. Il valore di *fraction* dovrebbe essere compreso tra 0,0 e 1,0 , estremi inclusi.

source: Sets the fraction of total progress bar length to move the bouncing block for each call to :meth:`pulse`.
it: Imposta la porzione di lunghezza totale della barra per spostare l'indicatore di attività per ogni chiamata a :meth:`pulse`.

source: Indicates that some progress is made, but you don't know how much. Causes the progress bar to enter *activity mode*, where a block bounces back and forth. Each call to :meth:`pulse` causes the block to move by a little bit (the amount of movement per pulse is determined by :meth:`set_pulse_step`).
it: Indica che qualche progresso è stato compiuto, senza sapere esattamente quanto. Mette la barra di avanzamento in modalità *attività*, dove un blocco rimbalza avanti e indietro. Ogni chiamata a :meth:`pulse` provoca il movimento del blocco (la velocità è determinata da :meth:`set_pulse_step`).

source: Sets the orientation. *orientation* can be one of
it: Importa l'orientamento. *orientation* può essere uno di

source: Sets whether the progressbar will show text superimposed over the bar. The shown text is either the value of the "text" property or, if that is ``None``, the "fraction" value, as a percentage.
it: Configura la visualizzazione o meno sullla barra di avanzamento di un testo sovrastante. Il testo visualizzato può essere sia il valore della proprietà "Testo" o, se questo è "None" (nessuno), il valore di "fraction", in percentuale.

source: Causes the given *text* to appear superimposed on the progress bar.
it: Fa in modo che il *testo* indicato appaia sopra la barra di avanzamento.

source: Progress bars normally grow from top to bottom or left to right. Inverted progress bars grow in the opposite direction.
it: La barra di avanzamento normalmente cresce dall'alto al basso o da sinistra a destra. Le barre invertite crescono in direzioni opposte.

source: Example
it: Esempio
