Repository: sebp/PyGObject-Tutorial
Catalog: translations/*/textview.po
Languages: it

source: Multiline Text Editor
it: Editor testo multilinea

source: The :class:`Gtk.TextView` widget can be used to display and edit large amounts of formatted text. Like the :class:`Gtk.TreeView`, it has a model/view design. In this case the :class:`Gtk.TextBuffer` is the model which represents the text being edited. This allows two or more :class:`Gtk.TextView` widgets to share the same :class:`Gtk.TextBuffer`, and allows those text buffers to be displayed slightly differently. Or you could maintain several text buffers and choose to display each one at different times in the same :class:`Gtk.TextView` widget.
it: Il widget :class:`Gtk.TextView` può essere utilizzato per visualizzare e modificare grandi quantità di testo formattato. Come :class:`Gtk.TreeView`, ha una progettazione modello/vista. In questo caso :class:`Gtk.TextBuffer` è il modello che rappresenta il testo in fase di modifica. Questo permette a due o più widget :class:`Gtk.TextView` di condividere lo stesso :class:`Gtk.TextBuffer` e permette a quei buffer di testo di essere visualizzati in modo leggermente diverso. Oppure si potrebbe mantenere diversi buffer di testo e scegliere di visualizzarne ciascuno in momenti diversi dello stesso :class:`widget di Gtk.TextView`.

source: The View
it: La vista

source: The :class:`Gtk.TextView` is the frontend with which the user can add, edit and delete textual data. They are commonly used to edit multiple lines of text. When creating a :class:`Gtk.TextView` it contains its own default :class:`Gtk.TextBuffer`, which you can access via the :meth:`Gtk.TextView.get_buffer` method.
it: :class:`Gtk.TextView` è il frontend con il quale l'utente può aggiungere, modificare e cancellare i dati testuali. Essi sono comunemente utilizzati per modificare più righe di testo. Quando si crea un :class:`Gtk.TextView` questo contiene il proprio :class:`Gtk.TextBuffer`, al quale si può accedere tramite il metodo :meth:`Gtk.TextView.get_buffer`.

source: By default, text can be added, edited and removed from the :class:`Gtk.TextView`. You can disable this by calling :meth:`Gtk.TextView.set_editable`. If the text is not editable, you usually want to hide the text cursor with :meth:`Gtk.TextView.set_cursor_visible` as well. In some cases it may be useful to set the justification of the text with :meth:`Gtk.TextView.set_justification`. The text can be displayed at the left edge, (:attr:`Gtk.Justification.LEFT`), at the right edge (:attr:`Gtk.Justification.RIGHT`), centered (:attr:`Gtk.Justification.CENTER`), or distributed across the complete width (:attr:`Gtk.Justification.FILL`).
it: In maniera predefinita, il testo può essere aggiunto, modificato e rimosso da :class:`Gtk.TextView`. È possibile disattivare questa possibilità chiamando :meth:`Gtk.TextView.set_editable`. Se il testo non è modificabile, di solito si desidera anche nascondere il cursore del testo con :meth:`Gtk.TextView.set_cursor_visible`. In alcuni casi può essere utile impostare la giustificazione del testo con :meth:`Gtk.TextView.set_justification`. Il testo può essere visualizzato sul bordo sinistro, (:attr:`Gtk.Justification.LEFT`), sul bordo destro (:attr:`Gtk.Justification.RIGHT`), centrato (:attr:`Gtk.Justification. CENTER`) o distribuito per tutta la larghezza disponibile (:attr:`Gtk.Justification.FILL`).

source: Another default setting of the :class:`Gtk.TextView` widget is long lines of text will continue horizontally until a break is entered. To wrap the text and prevent it going off the edges of the screen call :meth:`Gtk.TextView.set_wrap_mode`.
it: Un'altra impostazione predefinita del widget :class:`Gtk.TextView` sono le lunghe righe di testo che continueranno orizzontalmente fino a quando viene inserita una pausa. Per interrompere il testo ed evitare che vada fuori dai margini chiamate :meth:`Gtk.TextView.set_wrap_mode`.

source: TextView Objects
it: Oggetti TextView

source: Creates a new :class:`Gtk.TextView` associated with an empty default :class:`Gtk.TextBuffer`.
it: Crea una nuova :class:`Gtk.TextView` associata ad un :class:`Gtk.TextBuffer` vuoto predefinito.

source: Returns the :class:`Gtk.TextBuffer` being displayed by this text view.
it: Restituisce il :class:`Gtk.TextBuffer` visualizzato da questo widget.

source: Sets the default editability of this :class:`Gtk.TextView`.
it: Imposta la modificabilità predefinita di questo :class:`Gtk.TextView`.

source: Toggles whether the insertion point is displayed. A buffer with no editable text probably shouldn't have a visible cursor, so you may want to turn the cursor off.
it: Attiva o disattiva il punto di inserimento visualizzato. Un buffer senza testo modificabile probabilmente non dovrebbe avere un cursore visibile, quindi si consiglia di disabilitare il cursore.

source: Sets the default justification of text.
it: Imposta la giustificazione del testo predefinita

source: *justification* can be one of the following values:
it: *justification* può essere uno dei seguenti valori:

source: :attr:`Gtk.Justification.LEFT`: Text is placed at the left edge.
it: :attr:`Gtk.Justification.LEFT`: Testo allineato al lato sinistro.

source: :attr:`Gtk.Justification.RIGHT`: Text is placed at the right edge.
it: :attr:`Gtk.Justification.RIGHT`: Testo allineato al lato destro.

source: :attr:`Gtk.Justification.CENTER`: Text is placed in the center.
it: :attr:`Gtk.Justification.CENTER`: Testo allineato al centro.

source: :attr:`Gtk.Justification.FILL`: Text is distributed across the complete width.
it: :attr:`Gtk.Justification.FILL`: Il testo è distribuito per l'intera larghezza.

source: Sets the line wrapping for the view.
it: Imposta l'andata a capo della linea per la vista.

source: *wrap_mode* can be one of the following values:
it: *wrap_mode* può essere uno dei seguenti valori:

source: :attr:`Gtk.WrapMode.NONE`: Do not wrap lines; just make the text area wider.
it: :attr:`Gtk.WrapMode.NONE`: Non divide le linee; Lascia che il testo scorra liberamente.

source: :attr:`Gtk.WrapMode.CHAR`: Wrap text, breaking lines anywhere the cursor can appear (between characters, usually).
it: :attr:`Gtk.WrapMode.CHAR`: Divide il testo, andando a capo ovunque il cursore sia visibile (tra i carattere, di solito).

source: :attr:`Gtk.WrapMode.WORD`: Wrap text, breaking lines in between words.
it: :attr:`Gtk.WrapMode.WORD`: Divide il testo, andando a capo tra le parole.

source: :attr:`Gtk.WrapMode.WORD_CHAR`: Wrap text, breaking lines in between words, or if that is not enough, also between `graphemes`_.
it: :attr:`Gtk.WrapMode.WORD_CHAR`: Divide il testo, andando a capo tra le parole oppure, se non abbastanza, tra i `grafemi`_.

source: The Model
it: Il modello

source: The :class:`Gtk.TextBuffer` is the core of the :class:`Gtk.TextView` widget, and is used to hold whatever text is being displayed in the :class:`Gtk.TextView`. Setting and retrieving the contents is possible with :meth:`Gtk.TextBuffer.set_text` and :meth:`Gtk.TextBuffer.get_text`. However, most text manipulation is accomplished with *iterators*, represented by a :class:`Gtk.TextIter`. An iterator represents a position between two characters in the text buffer. Iterators are not valid indefinitely; whenever the buffer is modified in a way that affects the contents of the buffer, all outstanding iterators become invalid.
it: :class:`Gtk.TextBuffer` è il nucleo del widget :class:`Gtk.TextView`, ed è utilizzato per contenere qualsiasi testo visualizzabile in :class:`Gtk.TextView`. Impostare e recuperare il contenuto è possibile con :meth:`Gtk.TextBuffer.set_text` e :meth:`Gtk.TextBuffer.get_text`. Tuttavia, la maggior manipolazione del testo è compiuta con *iterators*, rappresentata da un :class:`Gtk.TextIter`. Un iteratore rappresenta una posizione tra due caratteri nel buffer di testo. Gli iteratori non sono sempre validi; quando il buffer è modificato in maniera tale che il suo contenuto ne risenta, tutti gli iteratori non sono più validi.

source: Because of this, iterators can't be used to preserve positions across buffer modifications. To preserve a position, use :class:`Gtk.TextMark`. A text buffer contains two built-in marks; an "insert" mark (which is the position of the cursor) and the "selection_bound" mark. Both of them can be retrieved using :meth:`Gtk.TextBuffer.get_insert` and :meth:`Gtk.TextBuffer.get_selection_bound`, respectively. By default, the location of a :class:`Gtk.TextMark` is not shown. This can be changed by calling :meth:`Gtk.TextMark.set_visible`.
it: A causa di questo, gli iteratori non possono essere utilizzati per conservare posizioni attraverso modifiche al buffer. Per conservare una posizione, usare :class:`Gtk.TextMark`. Un buffer di testo contiene due marchi integrati; un marchio "insert" (che è la posizione del cursore) e il marchio "selection_bound". Ciascuno di essi può essere recuperato utilizzando rispettivamente con :meth:`Gtk.TextBuffer.get_insert` e :meth:`Gtk.TextBuffer.get_selection_bound`. In maniera predefinita, la posizione di un :class:`Gtk.TextMark` non viene mostrato. Si può cambiare il comportamento chiamando :meth:`Gtk.TextMark.set_visible`.

source: Many methods exist to retrieve a :class:`Gtk.TextIter`. For instance, :meth:`Gtk.TextBuffer.get_start_iter` returns an iterator pointing to the first position in the text buffer, whereas :meth:`Gtk.TextBuffer.get_end_iter` returns an iterator pointing past the last valid character. Retrieving the bounds of the selected text can be achieved by calling :meth:`Gtk.TextBuffer.get_selection_bounds`.
it: Molti metodi esistono per recuperare un :class:`Gtk.TextIter`. Per esempio, :meth:`Gtk.TextBuffer.get_start_iter` restituisce un iteratore che punta alla prima posizione nel buffer di testo, mentre :meth:`Gtk.TextBuffer.get_end_iter` restituisce un iteratore che punta dopo l'ultimo carattere valido. Si possono recuperare i limiti del testo selezionato chiamando :meth:`Gtk.TextBuffer.get_selection_bounds`.

source: To insert text at a specific position use :meth:`Gtk.TextBuffer.insert`. Another useful method is :meth:`Gtk.TextBuffer.insert_at_cursor` which inserts text wherever the cursor may be currently positioned. To remove portions of the text buffer use :meth:`Gtk.TextBuffer.delete`.
it: Per inserire il testo in una specifica posizione, usate :meth:`Gtk.TextBuffer.insert`. Un altro metodo utile è :meth:`Gtk.TextBuffer.insert_at_cursor` che inserisce il testo laddove il cursore può essere attualmente posizionato. Per rimuovere porzioni di testo nel buffer usate :meth:`Gtk.TextBuffer.delete`.

source: In addition, :class:`Gtk.TextIter` can be used to locate textual matches in the buffer using :meth:`Gtk.TextIter.forward_search` and :meth:`Gtk.TextIter.backward_search`. The start and end iters are used as the starting point of the search and move forwards/backwards depending on requirements.
it: In aggiunta, :class:`Gtk.TextIter` può essere utilizzato per individuare abbinamenti di testo nel buffer utilizzando :meth:`Gtk.TextIter.forward_search` e :meth:`Gtk.TextIter.backward_search`. Gli iteratori di inizio e fine sono usati come punto di partenza della ricerca e si muovono avanti/indietro a seconda delle esigenze.

source: TextBuffer Objects
it: Oggetti TextBuffer

source: Deletes current contents of this buffer, and inserts *length* characters of *text* instead. If *length* is -1 or omitted, *text* is inserted completely.
it: Elimina il contenuto corrente di questo buffer, e inserisce solo una porzione di caratteri lunga *length* del testo *text*. Se *lenght* è -1 o omesso, *text* viene inserito completamente.

source: Returns the text in the range *start_iter* (included) and *end_iter* (excluded). Excludes undisplayed text.
it: Restituisce il testo nell'intervallo *start_iter* (incluso) e *end_iter* (escluso). Esclude il testo non visualizzato.

source: Returns the :class:`Gtk.TextMark` that represents the cursor (insertion point).
it: Restituisce il :class:`Gtk.TextMark` che rappresenta il cursore (punto di inserimento).

source: Returns the :class:`Gtk.TextMark` that represents the selection bound.
it: Restituisce il :class:`Gtk.TextMark` che rappresenta il vincolo di selezione.

source: Creates a :class:`Gtk.TextMark` at the position of the :class:`Gtk.TextIter` *where*. If *mark_name* is ``None``, the mark is anonymous; otherwise, the mark can be retrieved by name using :meth:`get_mark`. If a mark has left gravity, and text is inserted at the mark's current location, the mark will be moved to the left of the newly-inserted text. If the mark has right gravity (*left_gravity* is ``False``), the mark will end up on the right of newly-inserted text. The standard left-to-right cursor is a mark with right gravity (when you type, the cursor stays on the right side of the text you're typing).
it: Crea un :class:`Gtk.TextMark` alla posizione *where* del :class:`Gtk.TextIter`. Se *mark_name* è ``None``, il marchio è anonimo; altrimenti, il marchio può essere recuperato per nome utilizzando :meth:`get_mark`. Se un marchio è bilanciato a sinistra, e il testo viene inserito alla posizione corrente del marchio, il marchio sarà collocato a sinistra del testo appena inserito. Se il marchio è bilanciato a destra (*left_gravity* è ``False``), il marchio finirà a destra del testo appena inserito. Il cursore standard da sinistra-a-destra è un marchio con bilanciamento a destra (quando si digita, il cursore rimane sul lato destro del testo che si sta digitando).

source: If *left_gravity* is omitted, it defaults to ``False``.
it: Se *left_gravity* è omesso, il valore predefinito è ``False``.

source: Returns the :class:`Gtk.TextMark` named name in this buffer, or ``None`` if no such mark exists in the buffer.
it: Restituisce il nome indicato in :class:`Gtk.TextMark` in questo buffer, o ``None`` se tale marchio non esiste nel buffer.

source: Returns a :class:`Gtk.TextIter` pointing to first position in this buffer.
it: Restituisce un :class:`Gtk.TextIter` che punta alla prima posizione di questo buffer.

source: Returns a :class:`Gtk.TextIter` pointing past the last valid character in this buffer.
it: Restituisce un :class:`Gtk.TextIter` indicando l'ultimo carattere valido in questo buffer.

source: Returns a tuple of two :class:`Gtk.TextIter` objects pointing to the first character of the selection and to the first character after the selection, respectively. If no text is selected an empty tuple is returned.
it: Restituisce una tupla di due oggetti :class:`Gtk.TextIter` che puntano rispettivamente al primo carattere della selezione e al primo carattere dopo la selezione. Se non viene selezionato alcun testo viene restituita una tupla vuota.

source: Inserts *length* characters of *text* at position *text_iter*. If *length* is -1 or omitted, *text* is inserted completely.
it: Inserisce un numero di caratteri *lenght* di *text* alla posizione *text_iter*. Se *length* è -1 o omesso, *text* viene inserito completamente.

source: Simply calls :meth:`insert`, using the current cursor position as the insertion point.
it: Semplicemente chiama :meth:`insert`, utilizzando la posizione corrente del cursore come punto di inserimento.

source: Deletes text between *start_iter* and *end_iter*.
it: Elimina il testo tra *start_iter* e *end_iter*.

source: Creates a tag and adds it to the tag table of this buffer.
it: Crea una tag e la aggiunge alla tabella tag di questo buffer.

source: If *tag_name* is ``None``, the tag is anonymous, otherwise a tag with the same name must not already exist in the tag table of the buffer.
it: Se *tag_name* è ``None``, il tag è anonimo, altrimenti un tag con lo stesso nome non deve esistere già nella tabella tag del buffer.

source: *kwargs* is an arbitrary number of key-value pairs that represent a list properties to set on the tag, as with ``tag.set_property(prop_name, value)``.
it: *kwargs* è un numero arbitrario di coppie chiave-valore che rappresentano una lista di proprietà da impostare sul tag, come con ``tag.set_property (nome_proprietà, valore)``.

source: Applies *tag* to the given range.
it: Applica *tag* ad un dato intervallo.

source: Removes all occurrences of *tag* from the given range.
it: Rimuove tutte le occorrenze di *tag* dall'intervallo indicato.

source: Removes all tags in the given range.
it: Rimuove tutte le tag in un dato intervallo.

source: Searches forward for *needle*. The search will not continue past the :class:`Gtk.TextIter` *limit*.
it: Cerca in avanti per *needle*. La ricerca non continuerà oltre la fine di :class:`Gtk.TextIter`.

source: *flags* can be set to one of the following, or any combination of it by concatenating them with the bitwise-OR operator ``|``.
it: I *flags* possono essere impostati su una o qualsiasi combinazione concatenandoli con l'operatore bitwise OR `` | ``.

source: 0: The match must be exact.
it: 0: L'abbinamento dev'essere esatto.

source: :attr:`Gtk.TextSearchFlags.VISIBLE_ONLY`: The match may have invisible text interspersed in *needle*. i.e. *needle* will be a possibly-noncontiguous subsequence of the matched range.
it: :attr:`Gtk.TextSearchFlags.VISIBLE_ONLY`: L'abbinata può avere un testo invisibile intervallato in *needle*. In altri termini, *needle* sarà una successione possibilmente non contigua dell'intervallo abbinato.

source: :attr:`Gtk.TextSearchFlags.TEXT_ONLY`: The match may have pixbufs or child widgets mixed inside the matched range.
it: :attr:`Gtk.TextSearchFlags.TEXT_ONLY`: L'abbinata può avere pixbufs o widget figli mescolati all'interno dell'intervallo abbinato.

source: :attr:`Gtk.TextSearchFlags.CASE_INSENSITIVE`: The text will be matched regardless of what case it is in.
it: :attr:`Gtk.TextSearchFlags.CASE_INSENSITIVE`: Il testo sarà abbinato indipendentemente da minuscole o maiuscole.

source: Returns a tupel containing a :class:`Gtk.TextIter` pointing to the start and to the first character after the match. If no match was found, ``None`` is returned.
it: Restituisce una tupla contenente un :class:`Gtk.TextIter` che punta all'inizio e al primo carattere dopo il confronto. Se non è stata trovata alcuna corrispondenza, `` None`` viene restituito.

source: Same as :meth:`forward_search`, but moves backward.
it: Come :meth:`forward_search`, ma si muove all'indietro.

source: Sets the visibility of this mark; the insertion point is normally visible, i.e. you can see it as a vertical bar. Also, the text widget uses a visible mark to indicate where a drop will occur when dragging-and-dropping text. Most other marks are not visible. Marks are not visible by default.
it: Imposta la visibilità di questo marchio; il punto di inserimento è normalmente visibile, cioè si può vedere come una barra verticale. Inoltre, il widget di testo utilizza un segno visibile per indicare una destinazione durante il drag and drop di testo. Molti altri segni non sono visibili. I marchi non sono visibili per impostazione predefinita.

source: Tags
it: Le tag

source: Text in a buffer can be marked with tags. A tag is an attribute that can be applied to some range of text. For example, a tag might be called "bold" and make the text inside the tag bold. However, the tag concept is more general than that; tags don't have to affect appearance. They can instead affect the behaviour of mouse and key presses, "lock" a range of text so the user can't edit it, or countless other things. A tag is represented by a :class:`Gtk.TextTag` object. One :class:`Gtk.TextTag` can be applied to any number of text ranges in any number of buffers.
it: Il testo in un buffer può essere contrassegnato con tag. Una tag è un attributo che può essere applicato a qualche porzione di testo. Ad esempio, una tag potrebbe essere chiamato "bold" e rendere il testo all'interno della tag in grassetto. Tuttavia, il concetto di tag è generalizzabile; le tag non devono influenzare l'aspetto. Esse possono invece influenzare il comportamento del mouse e dei tasti premuti, "bloccare" una parte di testo in modo che l'utente non possa modificarlo o innumerevoli altre cose. Una tag è rappresentata da un oggetto :class:`Gtk.TextTag`. Un :class:`Gtk.TextTag` può essere applicato a qualsiasi numero di intervalli di testo in qualsiasi numero di buffer.

source: Each tag is stored in a :class:`Gtk.TextTagTable`. A tag table defines a set of tags that can be used together. Each buffer has one tag table associated with it; only tags from that tag table can be used with the buffer. A single tag table can be shared between multiple buffers, however.
it: Ogni tag viene memorizzata in una :class:`Gtk.TextTagTable`. Una tabella di tag definisce un insieme di tag utilizzabili insieme. Ogni buffer ha una tabella di tag ad esso associato; solo i tag da quella tabella possono essere utilizzati con il buffer. Una singola tabella di tag può essere tuttavia condivisa tra più buffer.

source: To specify that some text in the buffer should have specific formatting, you must define a tag to hold that formatting information, and then apply that tag to the region of text using :meth:`Gtk.TextBuffer.create_tag` and :meth:`Gtk.TextBuffer.apply_tag`::
it: Per specificare che un testo nel buffer dovrebbe avere una formattazione specifica, è necessario definire un tag con le informazioni di formattazione, e quindi applicare il tag alla regione di testo utilizzando :meth:`Gtk.TextBuffer.create_tag` e :meth:`Gtk.TextBuffer.apply_tag`::

source: The following are some of the common styles applied to text:
it: I seguenti sono alcuni degli stili comuni applicati al testo:

source: Background colour ("foreground" property)
it: Colore di sfondo (proprietà "background")

source: Foreground colour ("background" property)
it: Colore in primo piano (proprietà "foreground")

source: Underline ("underline" property)
it: Sottolineato (proprietà "underline")

source: Bold ("weight" property)
it: Grassetto (proprietà "weight")

source: Italics ("style" property)
it: Corsivo (proprietà "style")

source: Strikethrough ("strikethrough" property)
it: Barrato (proprietà "strikethrough")

source: Justification ("justification" property)
it: Justification (proprietà "justification", trad. giustificazione)

source: Size ("size" and "size-points" properties)
it: Size (proprietà "size" e "size-points", trad. dimensione e punti dimensione)

source: Text wrapping ("wrap-mode" property)
it: Andata a capo del testo (proprietà "wrap-mode")

source: You can also delete particular tags later using :meth:`Gtk.TextBuffer.remove_tag` or delete all tags in a given region by calling :meth:`Gtk.TextBuffer.remove_all_tags`.
it: È anche possibile eliminare le tag in un secondo momento utilizzando :meth:`Gtk.TextBuffer.remove_tag` o eliminare tutte le tag in una determinata regione chiamando :meth:`Gtk.TextBuffer.remove_all_tags`.

source: Example
it: Esempio
