Repository: sebp/PyGObject-Tutorial
Catalog: translations/*/treeview.po
Languages: it

source: Returns a tuple ``(model, treeiter)``, where *model* is the current model and *treeiter* a :class:`Gtk.TreeIter` pointing to the currently selected row. *treeiter* is ``None`` if no rows are selected.
it: Restituisce una tupla ``(modello, treeiter)``, dove *model* è il modello attuale e *treeiter* un :class:`Gtk.TreeIter` che indica la riga attualmente selezionata. *treeiter* è ``None`` se nessuna riga è selezionata.

source: This function will not work if the mode of this selection is :attr:`Gtk.SelectionMode.MULTIPLE`.
it: Questa funzione non funzionerà se la modalità di questa selezione è :attr:`Gtk.SelectionMode.MULTIPLE`.

source: Returns a list of :class:`Gtk.TreePath` instances of all selected rows.
it: Restituisce una lista di istanze :class:`Gtk.TreePath` per tutte le righe selezionate.

source: Sorting
it: Ordinamento

source: Sorting is an important feature for tree views and is supported by the standard tree models (:class:`Gtk.TreeStore` and :class:`Gtk.ListStore`), which implement the :class:`Gtk.TreeSortable` interface.
it: L'ordinamento è una caratteristica importante per le viste ad albero ed è supportato dai modelli ad albero standard (:class:`Gtk.TreeStore` e :class:`Gtk.ListStore`), che implementano l'interfaccia :class:`Gtk.TreeSortable`.

source: Sorting by clicking on columns
it: Ordinamento con clic sulle colonne

source: A column of a :class:`Gtk.TreeView` can easily made sortable with a call to :meth:`Gtk.TreeViewColumn.set_sort_column_id`. Afterwards the column can be sorted by clicking on its header.
it: Una colonna di un :class:`Gtk.TreeView` può essere facilmente ordinabile con una chiamata a :meth:`Gtk.TreeViewColumn.set_sort_column_id`. Successivamente, la colonna può essere ordinabile con un clic sulla sua intestazione.

source: First we need a simple :class:`Gtk.TreeView` and a :class:`Gtk.ListStore` as a model.
it: In primo luogo, abbiamo bisogno di una semplice :class:`Gtk.TreeView` e un :class:`Gtk.ListStore` come modello.

source: The next step is to enable sorting. Note that the *column_id* (``0`` in the example) refers to the column of the model and **not** to the TreeView's column.
it: Il passo successivo è quello di consentire l'ordinamento. Si noti che il *column_id* (``0`` nell'esempio) si riferisce alla colonna del modello e non alla colonna del TreeView.

source: Setting a custom sort function
it: Impostare una funzione di ordinamento personalizzata

source: It is also possible to set a custom comparison function in order to change the sorting behaviour. As an example we will create a comparison function that sorts case-sensitive. In the example above the sorted list looked like::
it: È anche possibile impostare una funzione di confronto personalizzato per modificare il comportamento dell'ordinamento. Come esempio, creeremo una funzione di confronto che ordina tenendo conto di maiuscole e minuscole. Nell'esempio precedente l'elenco ordinato era::

source: The case-sensitive sorted list will look like::
it: L'elenco case-sensitive ordinato risulterà così::

source: First of all a comparison function is needed. This function gets two rows and has to return a negative integer if the first one should come before the second one, zero if they are equal and a positive integer if the second one should come before the second one.
it: Prima di tutto, è necessaria una funzione di confronto. Quest'ultima ottiene due righe e deve restituire un intero negativo se il primo viene prima del secondo, zero se sono uguali e un intero positivo se il secondo arriva prima del secondo.

source: Then the sort function has to be set by :meth:`Gtk.TreeSortable.set_sort_func`.
it: Allora la funzione di ordinamento deve essere impostata da :meth:`Gtk.TreeSortable.set_sort_func`.

source: TreeSortable objects
it: Oggetti TreeSortable

source: Sets the current sort column to *sort_column_id*.
it: Imposta l'attuale colonna di ordinamento a *sort_column_id*.

source: Returns a tuple consisting of the current sort column and order.
it: Restituisce una tupla con l'attuale colonna di ordinamento.

source: Sets the comparison function used when sorting by the colum *sort_column_id*.
it: Imposta la funzione di confronto usata durante l'ordinamento della colonna *sort_column_id*.

source: *user_data* gets passed to *sort_func*.
it: *user_data* viene passato a *sort_func*.

source: *sort_func* is a function with the signature ``sort_func(model, iter1, iter2, user_data)`` and should return a negative integer if *iter1* sorts before *iter2*, zero if they are equal and a positive integer if *iter2* sorts before *iter1*.
it: * Sort_func * è una funzione con la firma ``sort_func (model,iter1,iter2,user_data)`` e dovrebbe restituire un intero negativo se *iter1* ordina prima * iter2 *, zero se sono uguali e un intero positivo se *iter2* ordina prima di *iter1*.

source: See :meth:`Gtk.TreeSortable.set_sort_func`. This sets the comparison function that is used when sorting by the default sort column
it: Vedere :meth:`Gtk.TreeSortable.set_sort_func`. Questo imposta la funzione di confronto che è utilizzata quando l'ordinamento avviene con la colonna predefinita per l'ordinamento.
