Repository: sebp/PyGObject-Tutorial
Catalog: translations/*/treeview.po
Languages: it

source: Tree and List Widgets
it: I widget Tree e List

source: A :class:`Gtk.TreeView` and its associated widgets are an extremely powerful way of displaying data. They are used in conjunction with a :class:`Gtk.ListStore` or :class:`Gtk.TreeStore` and provide a way of displaying and manipulating data in many ways, including:
it: Un :class:`Gtk.TreeView` e i suoi widget associati sono un modo estremamente potente per visualizzare dati. Sono utilizzati in combinazione con un :class:`Gtk.ListStore` o :class:` Gtk.TreeStore` e forniscono un modo per visualizzare e manipolare dati in molti modi:

source: Automatically updates when data added, removed or edited
it: Aggiorna automaticamente quando i dati sono aggiunti, rimossi o modificati

source: Drag and drop support
it: Supporto Drag and Drop

source: Sorting of data
it: Ordinamento di dati

source: Support embedding widgets such as check boxes, progress bars, etc.
it: Supporta widget integrati come quelli delle caselle di controllo, le barre di avanzamento, ecc.

source: Reorderable and resizable columns
it: Colonne riordinabili e ridimensionabili

source: Filtering of data
it: Filtraggio di dati

source: With the power and flexibility of a :class:`Gtk.TreeView` comes complexity. It is often difficult for beginner developers to be able to utilize correctly due to the number of methods which are required.
it: Con la potenza e la flessibilità di un :class:`Gtk.TreeView` viene anche complessità. E' spesso difficile per gli sviluppatori alle prime armi poter gestire il widget a causa del numero di metodi che sono richiesti.

source: The Model
it: Il modello

source: Each :class:`Gtk.TreeView` has an associated :class:`Gtk.TreeModel`, which contains the data displayed by the TreeView. Each :class:`Gtk.TreeModel` can be used by more than one :class:`Gtk.TreeView`. For instance, this allows the same underlying data to be displayed and edited in 2 different ways at the same time. Or the 2 Views might display different columns from the same Model data, in the same way that 2 SQL queries (or "views") might show different fields from the same database table.
it: Ogni :class:`Gtk.TreeView` ha un associato :class:`Gtk.TreeModel` che contiene i dati visualizzati da TreeView. Ogni :class:`Gtk.TreeModel` può essere utilizzato da più di un :class:`Gtk.TreeView`. Per esempio, questo permette agli stessi dati di essere visualizzati e modificati in 2 modi differenti allo stesso tempo. Le 2 Viste possono visualizzare diverse colonne degli stessi dati del Modello, così come 2 query SQL (o "viste") possono mostrare campi differenti della stessa tabella nel database.

source: Although you can theoretically implement your own Model, you will normally use either the :class:`Gtk.ListStore` or :class:`Gtk.TreeStore` model classes. :class:`Gtk.ListStore` contains simple rows of data, and each row has no children, whereas :class:`Gtk.TreeStore` contains rows of data, and each row may have child rows.
it: Anche se è possibile in teoria implementare il proprio modello, è di norma utilizzato il :class:`Gtk.ListStore` o :class:`Gtk.TreeStore`. :class:`Gtk.ListStore` contiene semplici righe di dati, e ogni riga non ha figli, mentre :class:`Gtk.TreeStore` contiene righe di dati e ognuna di queste può avere righe figlie.

source: When constructing a model you have to specify the data types for each column the model holds.
it: Quando si costruisce un modello è necessario specificare i tipi di dati per ogni colonna.

source: This creates a list store with three columns, two string columns, and a float column.
it: Questo crea una lista con tre colonne, due colonne stringa e una colonna per numeri a virgola mobile.

source: Adding data to the model is done using :meth:`Gtk.ListStore.append` or :meth:`Gtk.TreeStore.append`, depending upon which sort of model was created.
it: Per aggiungere dati al modello si usa :meth:`Gtk.ListStore.append` o :meth:`Gtk.TreeStore.append`, a seconda del tipo di modello creato.

source: Both methods return a :class:`Gtk.TreeIter` instance, which points to the location of the newly inserted row. You can retrieve a :class:`Gtk.TreeIter` by calling :meth:`Gtk.TreeModel.get_iter`.
it: Entrambi i metodi restituiscono un'istanza :class:`Gtk.TreeIter`, che punta alla posizione della riga appena inserita. È possibile recuperare un :class:`Gtk.TreeIter` chiamando :meth:`Gtk.TreeModel.get_iter`.

source: Once, data has been inserted you can retrieve or modify data using the tree iter and column index.
it: Una volta inseriti i dati è possibile recuperarli o modificarli utilizzando l'iteratore dell'albero e l'indice di colonna.

source: As with Python's built-in :class:`list` object you can use :func:`len` to get the number of rows and use slices to retrieve or set values.
it: Come per l'oggetto integrato di Python :class:`list`, è possibile utilizzare :func:`len` per ottenere il numero di righe e utilizzare porzioni per recuperare o impostare valori.

source: Iterating over all rows of a tree model is very simple as well.
it: Iterando su tutte le righe di un modello di albero è molto semplice.

source: Keep in mind, that if you use :class:`Gtk.TreeStore`, the above code will only iterate over the rows of the top level, but not the children of the nodes. To iterate over all rows and its children, use the ``print_tree_store`` function.
it: Tenete a mente, che se si utilizza :class:`Gtk.TreeStore`, il codice mostrato sopra scorrerà unicamente sulle righe del livello superiore, ma non i figli dei nodi. Per iterare su tutte le righe e i suoi figli, utilizzate la funzione di ``print_tree_store``.

source: Apart from accessing values stored in a :class:`Gtk.TreeModel` with the list-like method mentioned above, it is also possible to either use :class:`Gtk.TreeIter` or :class:`Gtk.TreePath` instances. Both reference a particular row in a tree model. One can convert a path to an iterator by calling :meth:`Gtk.TreeModel.get_iter`. As :class:`Gtk.ListStore` contains only one level, i.e. nodes do not have any child nodes, a path is essentially the index of the row you want to access.
it: A parte l'accesso ai valori memorizzati in :class:`Gtk.TreeModel` con il metodo di lista citato sopra, è anche possibile utilizzare le istanze :class:`Gtk.TreeIter` o :class:`Gtk.TreePath`. Entrambi fanno riferimento a una particolare riga in un modello ad albero. Si può convertire un percorso (path) in un iteratore chiamando :meth:`Gtk.TreeModel.get_iter`. Così come :class:`Gtk.ListStore` contiene un solo livello, es. i nodi non hanno alcun nodo figlio, un percorso è essenzialmente l'indice della riga al quale si desidera accedere.

source: In the case of :class:`Gtk.TreeStore`, a path is a list of indexes or a string. The string form is a list of numbers separated by a colon. Each number refers to the offset at that level. Thus, the path "0" refers to the root node and the path "2:4" refers to the fifth child of the third node.
it: Nel caso di :class:`Gtk.TreeStore`, un percorso è una lista di indici o una stringa. La forma della stringa è un elenco di numeri separati da due punti. Ogni numero si riferisce allo spostamento a quel livello. Così, il percorso "0" fa riferimento al nodo radice e il percorso "2:4" si riferisce al quinto figlio del terzo nodo.

source: TreeModel Objects
it: Oggetti TreeModel

source: Returns a :class:`Gtk.TreeIter` instance pointing to *path*.
it: Restituisce un'istanza :class:`Gtk.TreeIter` che punta a *path*.

source: *path* is expected to be a colon separated list of numbers or a tuple. For example, the string "10:4:0" or tuple (10, 4, 0) would create a path of depth 3 pointing to the 11th child of the root node, the 5th child of that 11th child, and the 1st child of that 5th child.
it: Ci si aspetta che *path* sia un elenco di numeri separati da due punti o una tupla. Per esempio, la stringa "10:4:0" o la tupla (10,4,0) creerebbero un percorso di profondità 3 puntando all'undicesimo nodo figlio rispetto alla radice, il 5° figlio di quel 11° nodo figlio, e il 1° nodo figlio di quel quinto nodo figlio.

source: Returns a :class:`Gtk.TreeIter` instance pointing the node following *treeiter* at the current level or ``None`` if there is no next iter.
it: Restituisce un'istanza :class:`Gtk.TreeIter` che punta al nodo successivo a *treeiter* al livello attuale o ``None`` se non esiste alcun successore.

source: Returns ``True`` if *treeiter* has children, ``False`` otherwise.
it: Restituisce ``True`` se *treeiter* ha figli, ``False`` altrimenti.

source: Returns a :class:`Gtk.TreeIter` instance pointing to the first child of *treeiter* or ``None`` if *treeiter* has no children.
it: Restituisce un'istanza :class:`Gtk.TreeIter` che punta al primo figlio di *treeiter* o ``None`` se *treeiter* non ha figli.

source: Returns a :class:`Gtk.TreeIter` instance pointing to the first iterator in the tree (the one at the path "0") or ``None`` if the tree is empty.
it: Restituisce un'istanza :class: `Gtk.TreeIter` che punta al primo iteratore nella struttura (quello nel percorso" 0 ") o ``None`` se l'albero è vuoto.

source: ListStore Objects
it: Oggetti ListStore

source: Creates a new :class:`Gtk.ListStore` with the specified column data types. Each row added to the list store will have an item in each column.
it: Crea un nuovo :classe:`Gtk.ListStore` con i determinati tipi di dati di colonna. Ogni riga aggiunta al list store avrà un elemento in ogni colonna.

source: Supported data types are the standard Python ones and GTK+ types:
it: I datatype supportati sono standard di Python e GTK+:

source: Appends a new row to this list store.
it: Accoda una nuova riga a questo list store.

source: *row* is a list of values for each column, i.e. ``len(store) == len(row)``. If *row* is omitted or ``None``, an empty row will be appended.
it: *row* è un elenco di valori per ogni colonna, in altri termini ``len(store) == len(row)``. Se *row* viene omesso o è ``None``, sarà aggiunta una riga vuota.

source: Returns a :class:`Gtk.TreeIter` pointing to the appended row.
it: Restituisce un :class:`Gtk.TreeIter` che punta alla riga accodata.

source: TreeStore Objects
it: Oggetti TreeStore

source: Arguments are the same as for the :class:`Gtk.ListStore` constructor.
it: Gli argomenti sono gli stessi che per il costruttore :class:`Gtk.ListStore`.

source: Appends a new row to this tree store. *parent* must be a valid :class:`Gtk.TreeIter`. If *parent* is not ``None``, then it will append the new row after the last child of *parent*, otherwise it will append a row to the top level.
it: Accoda una nuova riga al tree store. *parent* deve essere un valido :class:`Gtk.TreeIter`. Se *parent* non è ``None``, allora sarà accodata alla nuova riga dopo l'ultimo figlio di *parent*, altrimenti sarà accodata una riga al livello superiore.

source: TreePath Objects
it: Oggetti TreePath

source: Construct a :class:`Gtk.TreePath` pointing to the node specified by *path*.
it: Costruire un :class:`Gtk.TreePath` che punta al nodo specificato in *path*.

source: If *path* is a string it is expected to be a colon separated list of numbers. For example, the string "10:4:0" would create a path of depth 3 pointing to the 11th child of the root node, the 5th child of that 11th child, and the 1st child of that 5th child.
it: Se *path* è una stringa, si aspetta che essa sia una lista di numeri separati da due punti. Per esempio, la stringa "10:4:0" creerebbe un percorso di profondità 3 che punta all'undicesimo figlio del nodo radice, il quinto figlio dell'undicesimo figlio, e il 1° figlio del quinto figlio.

source: If *path* is a list or a tuple it is expected to contain the indexes of the nodes. Referring to the above mentioned example, the expression ``Gtk.TreePath("10:4:0")`` is equivalent to ``Gtk.TreePath([10, 4, 3])``.
it: Se *path* è una lista o una tupla si prevede che contenga gli indici dei nodi. Facendo riferimento all'esempio menzionato sopra, l'espressione ``Gtk.TreePath ("10:4:0")`` è equivalente a ``Gtk.TreePath ([10,4,3])``.

source: The View
it: La visualizzazione

source: While there are several different models to choose from, there is only one view widget to deal with. It works with either the list or the tree store. Setting up a :class:`Gtk.TreeView` is not a difficult matter. It needs a :class:`Gtk.TreeModel` to know where to retrieve its data from, either by passing it to the :class:`Gtk.TreeView` constructor, or by calling :meth:`Gtk.TreeView.set_model`.
it: Ci sono diversi modelli tra cui scegliere, ma un solo widget View da affrontare. Funziona sia con la lista o il tree store. Impostare un :class:`Gtk.TreeView` non è difficile. Serve un :class:`Gtk.TreeModel` per sapere dove recuperare i dati, o per passarlo al costruttore :class:`Gtk.TreeView` o chiamando :meth:`Gtk.TreeView.set_model`.

source: Once the :class:`Gtk.TreeView` widget has a model, it will need to know how to display the model. It does this with columns and cell renderers.
it: Una volta che il widget :class:`Gtk.TreeView` ha un modello, servirà sapere come visualizzare il modello. Lo si fa con i renderer di colonne e celle.

source: Cell renderers are used to draw the data in the tree model in a way. There are a number of cell renderers that come with GTK+, for instance :class:`Gtk.CellRendererText`, :class:`Gtk.CellRendererPixbuf` and :class:`Gtk.CellRendererToggle`. In addition, it is relatively easy to write a custom renderer yourself.
it: I renderer di cella sono utilizzati per disegnare i dati nel modello di albero. C'è una serie di renderer di celle disponibili con GTK+, come :class:`Gtk.CellRendererText`, :class:`Gtk.CellRendererPixbuf` e :class:`Gtk.CellRendererToggle`. Inoltre, è relativamente facile scriversi un renderer personalizzato.

source: A :class:`Gtk.TreeViewColumn` is the object that :class:`Gtk.TreeView` uses to organize the vertical columns in the tree view. It needs to know the name of the column to label for the user, what type of cell renderer to use, and which piece of data to retrieve from the model for a given row.
it: :class:`Gtk.TreeViewColumn` è l'oggetto che :class:`Gtk.TreeView` usa per organizzare le colonne verticali nella vista ad albero. Ha bisogno di conoscere il nome della colonna da mostrare per l'utente, il tipo di renderer di celle da usare e quale porzione di dati da recuperare dal modello per una data riga.

source: To render more than one model column in a view column, you need to create a :class:`Gtk.TreeViewColumn` instance and use :meth:`Gtk.TreeViewColumn.pack_start` to add the model columns to it.
it: Per mostrare più di una colonna del modello in una colonna della vista, è necessario creare un'istanza di :class:`Gtk.TreeViewColumn` e usare :meth:`Gtk.TreeViewColumn.pack_start` per aggiungere le colonne del modello.

source: TreeView Objects
it: Oggetti TreeView

source: Creates a new :class:`Gtk.TreeView` widget with the model initialized to *treemodel*. *treemodel* must be a class implementing :class:`Gtk.TreeModel`, such as :class:`Gtk.ListStore` or :class:`Gtk.TreeStore`. If *treemodel* is omitted or ``None``, the model remains unset and you have to call :meth:`set_model` later.
it: Crea un nuovo widget :class:`Gtk.TreeView` con il modello inizializzato a *treemodel*. Quest'ultimo deve essere una classe che implementa :classe:`Gtk.TreeModel`, come ad esempio :class:`Gtk.ListStore` o :class:`Gtk.TreeStore`. Se *treemodel* viene omesso oppure è ``None``, il modello rimane senza impostazioni e si deve chiamare successivamente :meth:`set_model`.

source: Sets the model for this tree view. If this tree view already has a model set, it will remove it before setting the new model. If *model* is ``None``, then it will unset the old model.
it: Imposta il modello per questa visualizzazione ad albero. Se quest'ultima ha già un modello impostato, sarà sostituito con quello nuovo. Se *model* è ``None``, allora pulirà l'impostazione del vecchio modello.

source: Returns the model this tree view is based on. Returns ``None`` if the model is unset.
it: Restituisce il modello utilizzato da questa vista ad albero. Restituisce ``None`` se il modello non ha impostazioni.

source: Appends *column* to the list of columns.
it: Accoda *column* alla lista delle colonne.

source: Gets the :class:`Gtk.TreeSelection` associated with this tree view.
it: Ottiene il :class:`Gtk.TreeSelection` associato con questa vista ad albero.

source: Arguments are the same as :meth:`Gtk.Widget.drag_source_set`
it: Gli arguments sono gli stessi di :meth:`Gtk.Widget.drag_source_set`

source: Arguments are the same as :meth:`Gtk.Widget.drag_dest_set`
it: Gli argomenti sono gli stessi di :meth:`Gtk.Widget.drag_dest_set`

source: TreeViewColumn Objects
it: Oggetti TreeViewColumn

source: Creates a new :class:`Gtk.TreeViewColumn`.
it: Crea un nuovo :class:`Gtk.TreeViewColumn`.

source: *renderer* is expected to be a :class:`Gtk.CellRenderer` instance, and *kwargs* key-value pairs specifying the default values of *renderer*'s properties. This is equivalent to calling :meth:`pack_start` and :meth:`add_attribute` for each key-value pair in *kwargs*.
it: Il *renderer* dovrebbe essere un'istanza :class:`Gtk.CellRenderer`, e la coppia chiave-valore *kwargs* specificare i valori predefiniti delle proprietà del *renderer*. Ciò equivale a chiamare :meth:`pack_start` e :meth:`add_attribute` per ogni coppia chiave-valore in *kwargs*.

source: If *renderer* is omitted, you have to call :meth:`pack_start` or :meth:`pack_end` yourself.
it: Se *renderer* viene omesso, è necessario chiamare :meth:`pack_start` o :meth:`pack_end`.

source: Adds an attribute mapping to this column.
it: Aggiunge un attributo che mappa questa colonna.

source: *attribute* is the parameter on *renderer* to be set from the value. So for example if column 2 of the model contains strings, you could have the "text" attribute of a :class:`Gtk.CellRendererText` get its values from column 2.
it: *attribute* è il parametro del *renderer* da impostare col valore. Così, per esempio, se la colonna 2 del modello contiene stringhe, si avrà l'attributo "text" di un :class:`Gtk.CellRendererText` che prenderà i propri valori dalla colonna 2.

source: Packs the *renderer* into the beginning of this column. If expand is ``False``, then the *renderer* is allocated no more space than it needs. Any unused space is divided evenly between cells for which expand is ``True``.
it: Racchiude il *renderer* all'inizio di questa colonna. Se *expand* è ``False``, allora il *renderer* è allocato con lo spazio strettamente necessario. Lo spazio non utilizzato è diviso equamente tra le celle con *expand* impostato a ``True``.

source: Adds the *renderer* to end of this column. If expand is ``False``, then the *renderer* is allocated no more space than it needs. Any unused space is divided evenly between cells for which expand is ``True``.
it: Aggiunge il *renderer* alla fine di questa colonna. Se *expand* è ``False``, allora il *renderer* è allocato con lo spazio strettamente necessario. Lo spazio non utilizzato è diviso equamente tra le celle con *expand* impostato a ``True``.

source: Sets the column of the model by which this column (of the view) should be sorted. This also makes the columnd header clickable.
it: Imposta la colonna del modello con la colonna (della vista) che dovrebbe essere ordinata. Questo rende anche l'intestazione di colonna cliccabile.

source: Gets the column id set by :meth:`Gtk.TreeViewColumn.set_sort_column_id`
it: Ottiene l'id di colonna ottenuto da :meth:`Gtk.TreeViewColumn.set_sort_column_id`

source: Sets whether a little arrow is displayed in the column header to in
it: Indica se una piccola freccia è visualizzata nell'intestazione della colonna da inserire

source: *setting* can either be ``True`` (indicator is shown) or ``False``
it: *setting* può essere sia ``True`` (l'indicatore è mostrato) o ``False``

source: Gets the value set by :meth:`Gtk.TreeViewColumn.set_sort_indicator`
it: Ottiene il valore impostato da :meth:`Gtk.TreeViewColumn.set_sort_indicator`

source: Changes the order by which the column is sorted.
it: Cambia verso all'ordinamento della colonna.

source: *order* can either be ``Gtk.SortType.ASCENDING`` or ``Gtk.SortType.DESCENDING``.
it: *order* può essere ``Gtk.SortType.ASCENDING`` o ``Gtk.SortType.DESCENDING``.

source: Gets the sort order set by :meth:`Gtk.TreeViewColumn.set_sort_order`
it: Ottiene il verso di ordinamento impostato da :meth:`Gtk.TreeViewColumn.set_sort_order`

source: The Selection
it: La selezione

source: Most applications will need to not only deal with displaying data, but also receiving input events from users. To do this, simply get a reference to a selection object and connect to the "changed" signal.
it: La maggior parte delle applicazioni non avrà solo bisogno di occuparsi della visualizzazione dei dati, ma anche ricevere eventi di input da parte degli utenti. Per fare questo, è sufficiente ottenere un riferimento a un oggetto di selezione e collegarlo al segnale "changed".

source: Then to retrieve data for the row selected:
it: Poi per ottenere i dati per la riga selezionata:

source: You can control what selections are allowed by calling :meth:`Gtk.TreeSelection.set_mode`. :meth:`Gtk.TreeSelection.get_selected` does not work if the selection mode is set to :attr:`Gtk.SelectionMode.MULTIPLE`, use :meth:`Gtk.TreeSelection.get_selected_rows` instead.
it: Si possono gestire le selezioni autorizzate chiamando :meth:`Gtk.TreeSelection.set_mode`. :meth:`Gtk.TreeSelection.get_selected` non funziona se la modalità di selezione impostata a :attr:`Gtk.SelectionMode.MULTIPLE`, utilizzate in alternativa :meth:`Gtk.TreeSelection.get_selected_rows`.

source: TreeSelection Objects
it: Oggetti TreeSelection

source: Where type is one of
it: Dopo il tipo è uno di

source: :attr:`Gtk.SelectionMode.NONE`: No selection is possible
it: :attr:`Gtk.SelectionMode.NONE`: Nessuna selezione possibile

source: :attr:`Gtk.SelectionMode.SINGLE`: Zero or one element may be selected
it: :attr:`Gtk.SelectionMode.SINGLE`: Zero o un solo elemento possono essere selezionati

source: :attr:`Gtk.SelectionMode.BROWSE`: Exactly one element is selected. In some circumstances, such as initially or during a search operation, it's possible for no element to be selected. What is really enforced is that the user can't deselect a currently selected element except by selecting another element.
it: :attr:`Gtk.SelectionMode.BROWSE`: Solo un elemento è selezionato. In alcune circostanze, come all'inizio o durante un'operazione di ricerca, non è possibile selezionare alcun elemento. Ciò che è veramente forzato è che l'utente non può deselezionare un elemento a meno che non se ne selezioni un altro.

source: :attr:`Gtk.SelectionMode.MULTIPLE`: Any number of elements may be selected. Clicks toggle the state of an item. Any number of elements may be selected. The Ctrl key may be used to enlarge the selection, and Shift key to select between the focus and the child pointed to. Some widgets may also allow Click-drag to select a range of elements.
it: :attr:`Gtk.SelectionMode.MULTIPLE`: Qualsiasi numero di elementi può essere selezionato. I clic alternano lo stato degli elementi. È possibile selezionare un qualsiasi numero di elementi. Il tasto Ctrl può essere utilizzato per estendere la selezione, e il tasto Shift può essere utilizzato per selezionare tra messa a fuoco e l'elemento figlio al quale si punta. Alcuni widget possono anche permettere il clic-trascinato per selezionare più elementi.
