Repository: sebp/PyGObject-Tutorial
Catalog: translations/locale/*/LC_MESSAGES/application.po
Languages: it

source: Application
it: Il widget Application

source: :class:`Gtk.Application` encompeses many repetitive tasks that a modern application needs such as handling multiple instances, D-Bus activation, opening files, command line parsing, startup/shutdown, menu management, window management, and more.
it: :class:`Gtk.Application` evita molti compiti ripetitivi che un'applicazione moderna richiede come la gestione di più istanze, l'attivazione D-Bus, l'apertura dei file, il parsing da linea di comando, l'avvio/arresto, la gestione dei menu, la gestione delle finestre, e altro ancora.

source: Actions
it: Azioni

source: :class:`Gio.Action` is a way to expose any single task your application or widget does by a name. These actions can be disabled/enabled at runtime and they can either be activated or have a state changed (if they contain state).
it: :class:`Gio.Action` è un modo per esporre ogni singolo task che la vostra applicazione o widget compiono da un nome. Queste azioni possono essere disabilitate/abilitate in fase di esecuzione e possono sia essere attivate o avere uno stato cambiato (se contengono uno stato).

source: The reason to use actions is to separate out the logic from the UI. For example this allows using a menubar on OSX and a gear menu on GNOME both simply referencing the name of an action. The main implementation of this you will be using is :class:`Gio.SimpleAction` which will be showed off later.
it: Il motivo per utilizzare le azioni è quello di separare la logica dall'interfaccia utente. Per esempio, vi permette di utilizzare sia una barra dei menu su OSX e un menu su GNOME riferendosi semplicemente al nome di un'azione. L'implementazione principale che userete è :class:`Gio.SimpleAction`, mostrato successivamente.

source: Many classes such as :class:`Gio.MenuItem` and :class:`Gtk.ModelButton` support properties to set an action name.
it: Esistono molte classi, come :class:`Gio.MenuItem` e :class:`Gtk.ModelButton`, che supportano le proprietà per impostare un nome di azione.

source: These actions can be grouped together into a :class:`Gio.ActionGroup` and when these groups are added to a widget with :meth:`Gtk.Widget.insert_action_group()` they will gain a prefix. Such as "win" when added to a :class:`Gtk.ApplicationWindow`. You will use the full action name when referencing it such as "app.about" but when you create the action it will just be "about" until added to the application.
it: Queste azioni possono essere raggruppate in un :class:`Gio.ActionGroup` e quando questi gruppi sono aggiunti ad un widget con :meth:`Gtk.Widget.insert_action_group()` guadagneranno un prefisso. Come "win" quando è aggiunto ad un :class:`Gtk.ApplicationWindow`. Si utilizzerà il nome pieno dell'azione quando si fa riferimento ad essa, ad esempio "app.about", ma quando si crea l'azione sarà solo "about" finché non la sia aggiunge all'applicazione.

source: You can also very easily make keybindings for actions by setting the `accel` property in the :class:`Gio.Menu` file or by using :meth:`Gtk.Application.add_accelerator()`.
it: Si può anche facilmente creare combinazioni di tasti per le azioni impostando la proprietà `accel` nei file :class:`Gio.Menu` o utilizzando :meth:`Gtk.Application.add_accelerator()`.

source: Menus
it: Menu

source: Your menus should be defined in XML using :class:`Gio.Menu` and would reference the previously mentioned actions you defined. :class:`Gtk.Application` allows you to set a menu either via :meth:`Gtk.Application.set_app_menu()` or :meth:`Gtk.Application.set_menubar()`. If you make use of :class:`Gio.Resource` this can automatically use the correct menu based on platform, otherwise you can set them manually. A detailed example is shown below.
it: I vostri menu dovrebbero essere definiti in XML utilizzando :class:`Gio.Menu` e dovrebbero riferirsi alle azioni definite e citate in precedenza. :class:`Gtk.Application` consente di impostare un menu sia con :meth:`Gtk.Application.set_app_menu()` o con :meth:`Gtk.Application.set_menubar()`. Se si fa uso di :class:`Gio.Resource` questo può utilizzare automaticamente il menu corretto in base alla piattaforma, altrimenti si possono impostare manualmente. Un esempio dettagliato è mostrato di seguito.

source: Command Line
it: Linea di comando

source: When creating your application it takes a flag property of :class:`Gio.ApplicationFlags`. Using this you can let it handle everything itself or have more custom behavior.
it: Creando la vostra applicazione ci vuole una proprietà flag di :class:`Gio.ApplicationFlags`. Usando questo si lascia la gestione di tutto o avere un comportamento personalizzato.

source: You can use `HANDLES_COMMAND_LINE` to allow custom behavior in :meth:`Gio.Application.do_command_line()`. In combination with :meth:`Gio.Application.add_main_option()` to add custom options.
it: È possibile utilizzare `HANDLES_COMMAND_LINE` per consentire un comportamento personalizzato in :meth:`Gio.Application.do_command_line()`. In combinazione con :meth:`Gio.Application.add_main_option()` per aggiungere opzioni personalizzate.

source: Using `HANDLES_OPEN` will do the work of simply taking file arguments for you and let you handle it in :meth:`Gio.Application.do_open()`.
it: Usando `HANDLES_OPEN` si farà il lavoro prendendo file come argomenti e lasciare la gestione degli stessi in :meth:`Gio.Application.do_open()`.

source: If your application is already open these will all be sent to the existing instance unless you use `NON_UNIQUE` to allow multiple instances.
it: Se l'applicazione è già aperta questi saranno tutti inviati all'istanza esistente a meno che non si utilizzi `NON_UNIQUE` per consentire istanze multiple.

source: Example
it: Esempio

source: See Also
it: Ulteriori riferimenti
