Repository: sebp/PyGObject-Tutorial
Catalog: translations/locale/*/LC_MESSAGES/basics.po
Languages: it, ja

source: Basics
it: Elementi base
ja: 基本

source: This section will introduce some of the most important aspects of GTK+.
it: Questa sezione introdurrà alcuni dei principali aspetti di GTK+.
ja: このセクションでは GTK+ でもっとも重要な部分について紹介します。

source: Main loop and Signals
it: Ciclo principale (main loop) e Segnali
ja: メイン・ループといろいろなシグナル

source: Like most GUI toolkits, GTK+ uses an event-driven programming model. When the user is doing nothing, GTK+ sits in the main loop and waits for input. If the user performs some action - say, a mouse click - then the main loop "wakes up" and delivers an event to GTK+.
it: Come molti toolkit GUI, GTK+ utilizza un modello di programmazione event-driven. Quando l'utente non fa nulla, GTK+ resta nel ciclo principale e attende che qualcosa accada. Se l'utente esegue alcune azioni - tipo, un clic con il mouse - allora il ciclo principale "si sveglia" e consegna un evento a GTK+.
ja: 多くの GUI ツールキット同様に、GTK+ もイベント駆動型のプログラミング・モデルを採用しています。ユーザが何もしなければ、GTK+ はメイン・ループの中でじっとしたまま入力待ちになります。ユーザが何かアクションを起こしたら - 例えば、マウスをクリックすると - メイン・ループが「目を覚まして」そのイベントを GTK+ に配送します。

source: When widgets receive an event, they frequently emit one or more signals. Signals notify your program that "something interesting happened" by invoking functions you've connected to the signal. Such functions are commonly known as *callbacks*. When your callbacks are invoked, you would typically take some action - for example, when an Open button is clicked you might display a file chooser dialog. After a callback finishes, GTK+ will return to the main loop and await more user input.
it: Quando i widget ricevono un evento, emettono uno o più segnali. I segnali notificano al tuo programma che "qualcosa di interessante è successo" invocando le funzioni che erano state precedentemente collegate ai segnali. Queste funzioni sono comunemente conosciute come *callback*. Quando le callback vengono invocate, seguono delle azioni - per esempio, quando si fa clic su un pulsante Apri per aprire una finestra di dialogo. Dopo che la callback è terminata, GTK+ torna al ciclo principale e aspetta altre interazioni dell'utente.
ja: ウィジェットがイベントを一つ受け取ると、それらは一個以上のシグナルを発行します。シグナルは、あなたがそのシグナルに接続しておいた関数を呼び出すことで、あなたのプログラムに「何か興味あることが起こりましたよ」と通知してくれます。そのような関数は一般的にコールバックと呼ばれています。コールバックが呼び出されると、原則的に何かアクションを起こすことになります - 例えば、開くボタンをクリックするとファイル選択ダイアログが表示されます。コールバックが完了したら、GTK+ はメイン・ループに制御を戻し、再び次のユーザからの入力待ちに入ります。

source: A generic example is:
it: Un esempio generico è:
ja: シグナルに接続する一般的な定義は次のとおりです:

source: Firstly, *widget* is an instance of a widget we created earlier. Next, the event we are interested in. Each widget has its own particular events which can occur. For instance, if you have a button you usually want to connect to the "clicked" event. This means that when the button is clicked, the signal is issued. Thirdly, the *callback* argument is the name of the callback function. It contains the code which runs when signals of the specified type are issued. Finally, the *data* argument includes any data which should be passed when the signal is issued. However, this argument is completely optional and can be left out if not required.
it: Primo, un *widget* è un'istanza di un widget che abbiamo creato in precedenza. Secondo, l'evento che ci interessa. Ogni widget ha i propri particolari eventi che possono occorrere. Per esempio, un pulsante che vogliamo collegare all'evento "clicked". Questo significa che al clic sul pulsante viene emesso il segnale. Terzo, l'argomento della *callback* è il nome della funzione callback. Esso contiene il codice che sarà eseguito quando i segnali del tipo indicato sono emessi. Per finire, l'argomento *data* include qualsiasi dato passabile quando il segnale viene emesso. Comunque, questo argomento è completamente opzionale e può essere omesso se non richiesto.
ja: まず *widget* はこれより先に生成した任意のウィジェットのインスタンスに相当します。次に *event* はこのプログラムで興味を持ったイベントです。ウィジェットはそれぞれ自分自身で特定のイベントを所有しています。例えば、ボタンならば、通常は "clicked" イベントに接続します。これは、ボタンをクリックしたら、そのシグナルが発行されるという意味です。三つ目の *callback* はコールバックの関数名です。この関数には、特定の種類のシグナルが発行されたら実行するコードが含まれています。最後の *data* はシグナルが発行された時にコールバックの関数に引き渡すべきデータが含まれています。但し、これは完全にオプションであり、必要なければ指定しなくても構いません。

source: The function returns a number that identifies this particular signal-callback pair. It is required to disconnect from a signal such that the callback function will not be called during any future or currently ongoing emissions of the signal it has been connected to.
it: La funzione restituisce un numero che identifica l'accoppiata segnale-callback. E' richiesto per disconnettersi da un segnale, come quello che la funzione callback non sarà chiamata durante qualsiasi emissione futura o corrente del segnale collegato.
ja: :func:`connect` 関数は、この特定のシグナルとコールバックのペアを識別する一個の数値を返します。この値は、コールバックに接続しているシグナルが発行されているか、または将来発行される状態にある時に、あえてコールバックの関数を呼び出さないように、シグナルからの接続を切断するような時に必要になります。

source: If you have lost the "handler_id" for some reason (for example the handlers were installed using :func:`Gtk.Builder.connect_signals`), you can still disconnect a specific callback using the function :func:`disconnect_by_func`:
it: Se avete perso il valore di "handler_id" per qualche motivo (ad esempio, i gestori sono stati installati utilizzando :func:`Gtk.Builder.connect_signals`), è ancora possibile disconnettere una callback specifica utilizzando la funzione :func:`disconnect_by_func`:

source: Almost all applications will connect to the "delete-event" signal of the top-level window. It is emitted if a user requests that a toplevel window is closed. The default handler for this signal destroys the window, but does not terminate the application. Connecting the "delete-event" signal to the function :func:`Gtk.main_quit` will result in the desired behaviour.
it: Quasi tutte le applicazioni si collegano al segnale "delete-event" della finestra top-level. Il segnale viene emesso se una richiesta utente vuole chiudere la finestra principale. Il gestore predefinito per questo segnale distrugge la finestra, ma non termina l'applicazione. Collegando il segnale "delete-event" alla funzione :func:`Gtk.main_quit` si avrà il comportamento desiderato.
ja: アプリケーションのほぼ全てが、トップレベル・ウィンドウの "delete-event” シグナルに接続します。このシグナルは、ユーザがトップレベル・ウィンドウを閉じるように要求があったら発行されます。このシグナルに対するデフォルトのコールバック (ハンドラ) はウィンドウを破棄 (destroy) しますが、アプリケーションは終了しません。"delete-event" シグナルを :func:`Gtk.main_quit` 関数に接続すると、アプリケーションも一緒に終了します。

source: Calling :func:`Gtk.main_quit` makes the main loop inside of :func:`Gtk.main` return.
it: Chiamando :func:`Gtk.main_quit` si esce dal ciclo principale di :func:`Gtk.main`.
ja: :func:`Gtk.main_quit` 関数を呼び出すと :func:`Gtk.main` 関数の内側にあるメイン・ループに制御が戻ります。

source: Properties
it: Proprietà
ja: いろいろなプロパティ

source: Properties describe the configuration and state of widgets. As for signals, each widget has its own particular set of properties. For example, a button has the property "label" which contains the text of the label widget inside the button. You can specify the name and value of any number of properties as keyword arguments when creating an instance of a widget. To create a label aligned to the right with the text "Hello World" and an angle of 25 degrees, use:
it: Le proprietà descrivono la configurazione e lo stato dei widget. Così come per i segnali, ogni widget ha il proprio particolare insieme di proprietà. Per esempio, un pulsante ha la proprietà "label" la quale contiene il testo del widget etichetta nel pulsante. Si può indicare il nome e il valore di qualsivoglia proprietà come argomento chiave con la creazione di un'istanza del widget. Per creare un'etichetta allineata a destra con il testo "Hello World" e un angolo di 25 gradi, utilizzate:
ja: プロパティにはウィジェットの設定や状態を記述します。シグナルに関しては、ウィジエットは自分専用のプロパティの集合を所有しています。例えば、ボタンならば "label" というプロパティがあり、これにはボタンの内側にあるラベル・ウィジェットが所有している文字列 (これもプロパティ) が格納されています。任意のウィジェットを生成する際にキーワード型の引数を使ってプロパティの名前とそのプロパティに格納する値を、いくつか指定することができます。例えば "Hello World" という文字列を右寄せにして、表示する角度を 25 度にしたラベルを生成する際は、次のようになります::

source: which is equivalent to
it: equivalente a
ja: これは次の呼び出しと等価です::

source: Instead of using getters and setters you can also get and set the gobject properties through the "props" property such as ``widget.props.prop_name = value``. This is equivelent to the more verbose ``widget.get_property("prop-name")`` and ``widget.set_property("prop-name", value)``.
it: Invece di utilizzare dei getters e setters si possono rispettivamente configurare le proprietà anche con ``widget.get_property("prop-name")`` e ``widget.set_property("prop-name", value)``.

source: To see which properties are available for a widget in the running version of GTK you can "dir" the "props" property:
it: Per elencare le proprietà disponibili per un widget nella versione disponibile di GTK scrivete:

source: This will print in the console the list of properties a Gtk.Box has.
it: Sarà mostrato in console l'elenco delle proprietà di Gtk.Box.

source: Instead of using getters and setters you can also get and set the properties with ``widget.get_property("prop-name")`` and ``widget.set_property("prop-name", value)``, respectively.
ja: getter と setter を利用する代わりに、 ``widget.get_property("プロパティ名")`` と ``widget.set_property("プロパティ名", その値)`` を使ってそれぞれプロパティを取得したり指定することも可能です。
