Repository: sebp/PyGObject-Tutorial
Catalog: translations/locale/*/LC_MESSAGES/builder.po
Languages: it, ja

source: Glade and Gtk.Builder
it: Glade e Gtk.Builder
ja: Glade と Gtk.Builder

source: The :class:`Gtk.Builder` class offers you the opportunity to design user interfaces without writing a single line of code. This is possible through describing the interface by a XML file and then loading the XML description at runtime and create the objects automatically, which the Builder class does for you. For the purpose of not needing to write the XML manually the `Glade <http://glade.gnome.org/>`_ application lets you create the user interface in a WYSIWYG (what you see is what you get) manner
ja: :class:`Gtk.Builder` クラスではプログラムのコードを使わずにグラフィカルなユーザ・インタフェース (UI) を設計するためのメカニズムを提供しています。これにより XML ファイルでインタフェースを記述しておけば、Builder クラスがプログラムの実行時にその XML の記述を読み込んで自動的にインタフェースのオブジェクトを生成してくれます。さらに一行一行 XML を記述しなくても `Glade <http://glade.gnome.org/>`_ というアプリケーションが ``WYSIWYG`` (*what you see is what you get*) な作法でユーザ・インタフェースを生成してくれます。

source: This method has several advantages:
it: Questo metodo ha molti vantaggi:
ja: このメカニズムにはいくつかの利点があります:

source: Less code needs to be written.
it: E' necessario scrivere meno codice.
ja: 記述すべきコードが少なくて済む

source: UI changes can be seen more quickly, so UIs are able to improve.
it: I cambiamenti alla UI sono visibili immediatamente, così le interfacce migliorano.
ja: UI の変更がすぐに分かるので、たくさんの UI を改善できる

source: Designers without programming skills can create and edit UIs.
it: I designer senza esperienza di programmazione possono creare e modificare interfacce.
ja: プログラミングの技術を持たないデザイナのレベルでも UI を作成したり変更できる

source: The description of the user interface is independent from the programming language being used.
it: La descrizione dell'interfaccia utente è indipendente dal linguaggio di programmazione utilizzato.
ja: UI の記述が、使っているプログラミング言語に依存しない

source: There is still code required for handling interface changes triggered by the user, but :class:`Gtk.Builder` allows you to focus on implementing that functionality.
it: E' ancora richiesto del codice per gestire i cambiamenti all'interfaccia imposti dall'utente, ma :class:`Gtk.Builder` permette di focalizzarsi sull'implementazione delle funzionalità.
ja: ユーザ・インタフェースの変更には、まだプログラマがコードを書いてやらないといけない部分もありますが, :class:`Gtk.Builder` を使えば機能的な部分に集中して実装できるはずです。

source: Creating and loading the .glade file
it: Creare e caricare i file .glade
ja: .glade ファイルの作成と読み込み

source: First of all you have to download and install Glade. There are `several tutorials <https://live.gnome.org/Glade/Tutorials>`_ about Glade, so this is not explained here in detail. Let's start by creating a window with a button in it and saving it to a file named *example.glade*. The resulting XML file should look like this.
ja: まず最初に `Glade <http://glade.gnome.org/>`_ をダウンロードしてインストールする必要があります。Glade については `チュートリアルがいくつか <https://live.gnome.org/Glade/Tutorials>`_ あるので、ここでは詳細の説明は割愛します。ではウィンドウを一つ作成して、その中にボタンを配置して *example.glade* というファイルに保存するところから始めましょう。その XML ファイルは例えば次のようになります。

source: To load this file in Python we need a :class:`Gtk.Builder` object.
it: Per caricare questo file in Python abbiamo bisogno di un oggetto :class:`Gtk.Builder`.
ja: このファイルを Python で読み込むには :class:`Gtk.Builder` 型のオブジェクトが必要になります。

source: The second line loads all objects defined in *example.glade* into the Builder object.
it: La seconda linea carica tutti gli oggetti definiti in *example.glade* nell'oggetto Builder.
ja: ２行目で *example.glade* にある全てのユーザ・インタフェースの定義を Builder オブジェクトへ読み込んでいます。

source: It is also possible to load only some of the objects. The following line would add only the objects (and their child objects) given in the tuple.
it: E' anche possibile caricare solo alcuni oggetti. La linea seguente aggiungerà solo gli oggetti indicati (e i rispettivi oggetti figli).
ja: あるいは、複数のオブジェクトの中のいくつかのオブジェクトだけ読み込んでやることも可能です。次はオブジェクト (とその子のオブジェクト) だけタプルの中に追加する例です。

source: These two methods exist also for loading from a string rather than a file. Their corresponding names are :meth:`Gtk.Builder.add_from_string` and :meth:`Gtk.Builder.add_objects_from_string` and they simply take a XML string instead of a file name.
it: Questi due metodi esistono anche per caricare da una stringa anziché da un file. I loro nomi rispettivi sono :meth:`Gtk.Builder.add_from_string` e :meth:`Gtk.Builder.add_objects_from_string` e prenderanno semplicemente una stringa XML anziché il nome di un file.
ja: ファイルからではなく文字列から読み込むメソッドが二つ用意されています。それぞれ :meth:`Gtk.Builder.add_from_string` と :meth:`Gtk.Builder.add_objects_from_string` で、共にファイル名の代わりに XML 記述を受け取ります。

source: Accessing widgets
it: Accesso ai widget
ja: ウィジェットへのアクセス

source: Now that the window and the button are loaded we also want to show them. Therefore the :meth:`Gtk.Window.show_all` method has to be called on the window. But how do we access the associated object?
it: Ora che la finestra e il pulsante sono caricati vogliamo mostrarli. Per farlo è necessario il metodo :meth:`Gtk.Window.show_all` sulla finestra. Come possiamo accedere all'oggetto associato?
ja: ここで読み込んだウィンドウとボタンを表示するために、ウィンドウの上で :meth:`Gtk.Window.show_all` メソッドを呼び出して下さい。とはいえ、表示されたユーザ・インタフェースのオブジェクトにアクセスするにはどうすればよいのでしょう？

source: Every widget can be retrieved from the builder by the :meth:`Gtk.Builder.get_object` method and the widget's *id*. It is really *that* simple.
it: Ogni widget può essere estratto dal builder tramite il metodo :meth:`Gtk.Builder.get_object` e l'*id* del widget. E' veramente *così* semplice.
ja: これらのオブジェクトは全て :meth:`Gtk.Builder.get_object` メソッドやウィジェットの *id* を使って Builder から取得することができます。それは本当に簡単です。

source: It is also possible to get a list of all objects with
it: E' anche possibile ricevere una lista di tutti gli oggetti con
ja: さらに、次のようにして全てのオブジェクトのリストを取得できます:

source: Connecting Signals
it: Collegare segnali
ja: シグナルに接続する

source: Glade also makes it possible to define signals which you can connect to handlers in your code without extracting every object from the builder and connecting to the signals manually. The first thing to do is to declare the signal names in Glade. For this example we will act when the window should be closed and when the button was pressed, so we give the name "onDeleteWindow" to the "delete-event" signal of the window and "onButtonPressed" to the "pressed" signal of the button. Now the XML file should look like this.
it: Glade permette anche di definire i segnali collegabili ai gestori nel codice senza estrarre ogni oggetto dal builder e collegare i segnali manualmente. La prima cosa da fare è dichiarare i nomi dei segnali in Glade. Per questo esempio agiremo quando la finestra dovrebbe essere chiusa e quando il pulsante è stato premuto, quindi diamo il nome di "onDeleteWindow" al segnale "delete-event" della finestra e "onButtonPressed" per il segnale "pressed" del pulsante. Ora il file XML dovrebbe essere simile al seguente.
ja: Glade ではさらにコードの中にあるハンドラに接続することが可能なシグナルを Builder から全てのオブジェクトを展開して手動で接続することなく定義できます。その際に最初にやることは Glade の中でシグナルの名前を宣言することです。例えば、ここではウィンドウを閉じた時とボタンを押下した時のハンドラとシグナルとして、"onDeleteWindow" にウィンドウの "delete-event" シグナルを接続し、"onButtonPressed" にボタンの "pressed" シグナルを接続するものとします。この時の XML ファイルは次のようになります。

source: Now we have to define the handler functions in our code. The *onDeleteWindow* should simply result in a call to :meth:`Gtk.main_quit`. When the button is pressed we would like to print the string "Hello World!", so we define the handler as follows
it: Ora dobbiamo definire le funzioni del gestore nel nostro codice. *onDeleteWindow* dovrebbe semplicemente tradursi in una chiamata a: meth: `Gtk.main_quit`. Quando si preme il pulsante ci piacerebbe stampare la stringa "Hello World!", così definiamo il gestore (handler) come segue
ja: それからプログラムでハンドラの関数をそれぞれ定義して下さい。例えば *onDeleteWindow* では単に :meth:`Gtk.main_quit` を呼び出すだけにします。もう一つのハンドラの場合、ボタンが押下されたら "Hello World!" なんて文字列を出力したいので、次のような関数を定義します:

source: Next, we have to connect the signals and the handler functions. The easiest way to do this is to define a *dict* with a mapping from the names to the handlers and then pass it to the :meth:`Gtk.Builder.connect_signals` method.
it: A questo punto, dobbiamo collegare i segnali e le funzioni di gestione. Il modo più semplice per farlo è quello di definire un dizionario di mappatura dai nomi ai gestori, passandolo poi al metodo :meth:`Gtk.Builder.connect_signals`.
ja: 次に、対応するシグナルとハンドラの関数とをそれぞれ接続します。それを一番簡単に実現する方法はハンドラの名前をキーに持つ *辞書* を定義して、それを :meth:`Gtk.Builder.connect_signals` メソッドに引き渡すというものです。

source: An alternative approach is to create a class which has methods that are called like the signals. In our example the last code snippet could be rewritten as:
it: Un approccio alternativo è quello di creare una classe che ha metodi chiamati come segnali. Nel nostro esempio l'ultimo frammento di codice si può riscrivere come:
ja: それ以外の方法としては、シグナルのようにハンドラを呼び出すメソッドを持った任意のクラスを生成するというものです。この例だと、最後のプログラムコードを次のように書き直すことになります:

source: Builder Objects
ja: Builder のオブジェクト

source: Loads and parses the given file and merges it with the current contents of builder.
ja: 指定したファイルを読み込んで解析し、この Builder が持つ現在のユーザ・インタフェースの定義とマージします。

source: Parses the given string and merges it with the current contents of builder..
ja: 指定した文字列を解析し、この Builder が持つ現在のユーザ・インタフェースの定義とマージします。

source: Same as :meth:`Gtk.Builder.add_from_file`, but loads only the objects with the ids given in the *object_ids* list.
ja: :meth:`Gtk.Builder.add_from_file` と同じですが、指定した *object_ids* というリストの中にある id を持ったオブジェクトだけ読み込みます。

source: Same as :meth:`Gtk.Builder.add_from_string`, but loads only the objects with the ids given in the *object_ids* list.
ja: :meth:`Gtk.Builder.add_from_string` と同じですが、指定した *object_ids* というリストの中にある id を持ったオブジェクトだけ読み込みます。

source: Retrieves the widget with the id *object_id* from the loaded objects in the builder.
ja: この Builder が読み込んだオブジェクトのうち *object_id* を id として持つウィジェットを返します。

source: Returns all loaded objects.
ja: この Builder が読み込んだ全てのオブジェクトを返します。

source: Connects the signals to the methods given in the *handler_object*. The *handler_object* can be any object which contains keys or attributes that are called like the signal handler names given in the interface description, e.g. a class or a dict.
ja: シグナルを *handler_object* の中に指定されたメソッドに接続します。この *handler_object* には、Glade ファイルの中で指定したシグナルのハンドラ名のように呼び出されるキーと属性値を含むオブジェクト (すなわち、クラスまたは辞書) を指定できます。

source: Example
it: Esempio
ja: 例

source: The final code of the example
it: Il codice finale dell'esempio
ja: この例の最終的なプログラム・コードは次のとおりです。

source: The :class:`Gtk.Builder` class offers you the opportunity to design user interfaces without writing a single line of code. This is possible through describing the interface by a XML file and then loading the XML description at runtime and create the objects automatically, which the Builder class does for you. For the purpose of not needing to write the XML manually the `Glade <https://glade.gnome.org/>`_ application lets you create the user interface in a WYSIWYG (what you see is what you get) manner
it: La classe :class:`Gtk.Builder` offre l'opportunità di progettare interfacce utente senza scrivere una singola linea di codice. Questo è possibile descrivendo l'interfaccia con un file XML, caricando le descrizioni all'avvio e creando gli oggetti automaticamente, quando si invoca la classe Builder. Per non scrivere manualmente questi file XML, l'applicazione `Glade <https://glade.gnome.org/>` vi permette di creare l'interfaccia utente in maniera visuale (WYSIWYG).

source: First of all you have to download and install Glade. There are `several tutorials <https://wiki.gnome.org/action/show/Apps/Glade/Tutorials>`_ about Glade, so this is not explained here in detail. Let's start by creating a window with a button in it and saving it to a file named *example.glade*. The resulting XML file should look like this.
it: Prima di tutto, è necessario scaricare ed installare Glade. Ci sono `diversi tutorial <https://live.gnome.org/Glade/Tutorials>`_ su Glade, per questo non viene trattato qui in dettaglio. Iniziate creando una finestra con un pulsante e salvate il file con il nome *example.glade*. Il file XML sarà simile al seguente.
