Repository: sebp/PyGObject-Tutorial
Catalog: translations/locale/*/LC_MESSAGES/button_widgets.po
Languages: it, ja

source: Button Widgets
it: I widget dei pulsanti
ja: ボタン・ウィジェット

source: Button
it: Pulsante
ja: ボタン

source: The Button widget is another commonly used widget. It is generally used to attach a function that is called when the button is pressed.
it: ``Gtk.Button`` è un altro widget comune. E' generalmente utilizzato per associare una funzione da chiamare quando un pulsante viene premuto.
ja: ボタン・ウィジェットもよく使用するもう一つウィジェットです。ほとんどの場合、ボタンを生成してから、そのボタンを押下する際に呼び出すメソッドを関連づけるという使い方が一般的です。

source: The :class:`Gtk.Button` widget can hold any valid child widget. That is it can hold most any other standard :class:`Gtk.Widget`. The most commonly used child is the :class:`Gtk.Label`.
it: Il widget :class:`Gtk.Button` può contenere qualsiasi widget figlio valido. Così può contenere gran parte degli altri standard :class:`Gtk.Widget`. Il widget figlio più comunemente utilizzato è :class:`Gtk.Label`.
ja: :class:`Gtk.Button` ウィジットの上には妥当な子ウィジェットをいくつかパッキングできるようになっています。それらの子ウィジェットは、すなわち、標準の :class:`Gtk.Widget` クラスのオブジェクトです。もっともよく利用する子ウィジェットは :class:`Gtk.Label` です。

source: Usually, you want to connect to the button's "clicked" signal which is emitted when the button has been pressed and released.
it: Di solito, si desidera collegare al pulsante il segnale "clicked" il quale viene emesso quando il pulsante è premuto e rilasciato.
ja: 通常、ボタンを押下したり解放する際に発行される "clicked" シグナルに接続することになります。

source: Button Objects
ja: ボタンのオブジェクト

source: If label is not ``None``, creates a new :class:`Gtk.Button` with a :class:`Gtk.Label` child containing the given text.
ja: *label* が ``None`` でなければ、指定した文字列を格納した :class:`Gtk.Label` を子ウィジェットに持つ新しい :class:`Gtk.Button` を一つ生成します。

source: If *stock* is not ``None``, creates a new button containing the image and text from a :ref:`stock item <stock-items>`.
ja: *stock* が ``None`` でなければ :ref:`ストック・アイテム <stock-items>` から取得した画像とラベルを子ウィジェットに持つ新しいボタンを生成します。

source: If *use_underline* is set to ``True``, an underline in the text indicates the next character should be used for the mnemonic accelerator key.
ja: *use_underline* を ``True`` にすると、ラベルの中で下線の次にある文字をニーモニックのアクセラレータ・キーとして利用できるようになります。

source: Sets the text of the label of the button to *label*.
ja: ボタンのラベルを *label* という文字列にします。

source: If *True*, an underline in the text of the button label indicates the next character should be used for the mnemonic accelerator key.
ja: *use_underline* を ``True`` にすると、ボタンにあるラベルの中で下線の次にある文字をニーモニックのアクセラレータ・キーとして扱います。

source: Example
it: Esempio
ja: 例

source: ToggleButton
it: Pulsante a due stati
ja: トグルボタン

source: A :class:`Gtk.ToggleButton` is very similar to a normal :class:`Gtk.Button`, but when clicked they remain activated, or pressed, until clicked again. When the state of the button is changed, the "toggled" signal is emitted.
it: Un :class:`Gtk.ToggleButton` è molto simile ad un normale :class:`Gtk.Button`, ma quando cliccati rimangono attivi, o premuti, finché non si fa nuovamente clic su di essi. Quando lo stato del pulsante viene modificato, il segnale "toggled" viene emesso.
ja: :class:`Gtk.ToggleButton` クラスは :class:`Gtk.Button` クラスにとてもよく似ていますが、ボタンをクリックするともう一度クリックされるまでそのボタンの状態を記憶しています。ボタンの状態が変更されると、"toggled" というシグナルが発行されます。

source: To retrieve the state of the :class:`Gtk.ToggleButton`, you can use the :meth:`Gtk.ToggleButton.get_active` method. This returns ``True`` if the button is "down". You can also set the toggle button's state, with :meth:`Gtk.ToggleButton.set_active`. Note that, if you do this, and the state actually changes, it causes the "toggled" signal to be emitted.
it: Per recuperare lo stato di un :class:`Gtk.ToggleButton`, è possibile utilizzare il metodo :meth:`Gtk.ToggleButton.get_active`. Ciò restituisce ``True`` se il pulsante è premuto. È inoltre possibile impostare lo stato del pulsante di commutazione con :meth:`Gtk.ToggleButton.set_active`. Si noti che facendo ciò, e lo stato cambia, causerà l'emissione del segnale "toggled".
ja: :class:`Gtk.ToggleButton` の状態を取得する際は :meth:`Gtk.ToggleButton.get_active` メソッドを利用します。このメソッドは、ボタンが「押下」されていたら ``True`` を返します。さらに、トグルボタンの状態を :meth:`Gtk.ToggleButton.set_active` メソッドで指定することもできます。但し、このようにしてトグルボタンの状態を変更した場合でも "toggled" シグナルが発行される点に留意して下さい。

source: ToggleButton Objects
ja: トグルボタンのオブジェクト

source: The arguments are the same as for the :class:`Gtk.Button` constructor.
ja: 引数は :class:`Gtk.Button` のコンストラクタと同じです。

source: Returns the buttons current state. Returns ``True`` if the toggle button is pressed in and ``False`` if it is raised.
ja: 現在のトグルボタンの状態を返します。トグルボタンが押下されている場合は ``True`` を返し、トグルボタンが押下されていない場合は ``False`` を返します。

source: Sets the status of the toggle button. Set to ``True`` if you want the button to be pressed in, and ``False`` to raise it. This action causes the "toggled" signal to be emitted.
ja: トグルボタンの状態をセットします。トグルボタンを押下した状態にしたいのであれば ``True`` を指定し、逆にトグルボタンが押下されていない状態にしたいのであれば ``False`` にします。このメソッドを呼び出すと "toggled" シグナルが発行されます。

source: CheckButton
it: Pulsante di spunta
ja: チェックボタン

source: :class:`Gtk.CheckButton` inherits from :class:`Gtk.ToggleButton`. The only real difference between the two is :class:`Gtk.CheckButton`'s appearance. A :class:`Gtk.CheckButton` places a discrete :class:`Gtk.ToggleButton` next to a widget, (usually a :class:`Gtk.Label`). The "toggled" signal, :meth:`Gtk.ToggleButton.set_active` and :meth:`Gtk.ToggleButton.get_active` are inherited.
it: :class:`Gtk.CheckButton` eredita da :class:`Gtk.ToggleButton`. L'unica vera differenza tra i due è l'aspetto di :class:`Gtk.CheckButton`. Quest'ultimo posiziona un discreto :class:`Gtk.ToggleButton` accanto ad un widget (di solito un :class:`Gtk.Label`). Il segnale "toggled", :meth:`Gtk.ToggleButton.set_active` e :meth:`Gtk.ToggleButton.get_active` vengono ereditati.
ja: :class:`Gtk.CheckButton` は :class:`Gtk.ToggleButton` から派生したクラスの一つです。この二つのクラスの違いは :class:`Gtk.CheckButton` の外観ぐらいです。 :class:`Gtk.CheckButton` クラスは一個の完全な :class:`Gtk.ToggleButton` オブジェクトを任意のウィジェット (通常は一個の :class:`Gtk.Label`) の隣に配置します。"toggled" シグナルや :meth:`Gtk.ToggleButton.set_active` や :meth:`Gtk.ToggleButton.get_active` といったメソッドも継承しています。

source: CheckButton Objects
ja: チェックボタンのオブジェクト

source: Arguments are the same as for :class:`Gtk.Button`.
ja: 引数は :class:`Gtk.Button` のコンストラクタと同じです。

source: RadioButton
it: Pulsante di scelta
ja: ラジオボタン

source: Like checkboxes, radio buttons also inherit from :class:`Gtk.ToggleButton`, but these work in groups, and only one :class:`Gtk.RadioButton` in a group can be selected at any one time. Therefore, a :class:`Gtk.RadioButton` is one way of giving the user a choice from many options.
it: Come le caselle di spunta, i pulsanti di scelta ereditano anche da :class:`Gtk.ToggleButton`, ma questi ultimi due lavorano in gruppo, e solo un :class:`Gtk.RadioButton` in un gruppo può essere selezionato in qualsiasi momento. Pertanto, un :class:`Gtk.RadioButton` è un modo di dare all'utente una scelta tra molte opzioni.
ja: チェックボタン同様に、ラジオボタンもまた :class:`Gtk.ToggleButton` クラスから派生していますが、ラジオボタンはグループで連動します。具体的には、グループの中にある :class:`Gtk.RadioButton` を一回につき一個だけ選択することができます。そのため :class:`Gtk.RadioButton` クラスは、ユーザが複数のオプションを選択するといったユーザ・インタフェースを提供しています。

source: Radio buttons can be created with one of the static methods :meth:`Gtk.RadioButton.new_from_widget`, :meth:`Gtk.RadioButton.new_with_label_from_widget` or :meth:`Gtk.RadioButton.new_with_mnemonic_from_widget`. The first radio button in a group will be created passing ``None`` as the *group* argument. In subsequent calls, the group you wish to add this button to should be passed as an argument.
it: I pulsanti di scelta possono essere creati con uno dei metodi statici :meth:`Gtk.RadioButton.new_from_widget`, :meth:`Gtk.RadioButton.new_with_label_from_widget` o :meth:`Gtk.RadioButton.new_with_mnemonic_from_widget`. Il primo pulsante di scelta in un gruppo verrà creato passando ``None`` come argomento *group*. Nelle chiamate successive, il gruppo al quale si desidera aggiungere questo pulsante dovrebbe essere passato come argomento.
ja: ラジオボタンは :meth:`Gtk.RadioButton.new_from_widget` または :meth:`Gtk.RadioButton.new_with_label_from_widget` 、あるいは :meth:`Gtk.RadioButton.new_with_mnemonic_from_widget` といった static メソッドのいずれかで生成します。グループの中にある一番最初のラジオボタンは *group* という引数を ``None`` にして生成します。それ以降の (ラジオボタン生成の) メソッドで、この一番最初のラジオボタンのインスタンスを引数に渡すことで、生成したラジオボタンをグループに追加できます。

source: When first run, the first radio button in the group will be active. This can be changed by calling :meth:`Gtk.ToggleButton.set_active` with ``True`` as first argument.
it: Alla prima esecuzione, il primo pulsante di scelta nel gruppo sarà attivo. Questo può essere cambiato chiamando :meth:`Gtk.ToggleButton.set_active` con ``True`` come primo argomento.
ja: 初めて実行した場合、グループの中にある一番最初のボタンの状態が ON になります。これは ``True`` を先頭の引数にして :meth:`Gtk.ToggleButton.set_active` メソッドを呼び出すことで変更することができます。

source: Changing a :class:`Gtk.RadioButton`'s widget group after its creation can be achieved by calling :meth:`Gtk.RadioButton.join_group`.
it: Per cambiare il gruppo di widget di un :class:`Gtk.RadioButton`dopo la sua creazione, fate riferimento a :meth:`Gtk.RadioButton.join_group`.
ja: :class:`Gtk.RadioButton` を生成した後に、それらが所属しているグループを変更するには :meth:`Gtk.RadioButton.join_group` メソッドを呼び出して下さい。

source: RadioButton Objects
ja: ラジオボタンのオブジェクト

source: Creates a new :class:`Gtk.RadioButton`, adding it to the same group as the *group* widget. If *group* is ``None``, a new group is created.
ja: 新しい :class:`Gtk.RadioButton` を一つ生成し *group* というウィジェットと同じグループに追加します。 *group* を ``None`` にすると新しいグループも生成されます。

source: Creates a new :class:`Gtk.RadioButton`. The text of the label widget inside the button will be set to *label*. *group* is the same as for :meth:`new_from_widget`.
ja: 新しい :class:`Gtk.RadioButton` を一つ生成します。ラジオボタンの中にあるラベルの文字列を *label* にします。 *group* 引数は :meth:`Gtk.RadioButton.new_from_widget` メソッドと同じ扱いです。

source: Same as :meth:`new_with_label_from_widget`, but underscores in *label* indicate the mnemonic for the button.
ja: :meth:`Gtk.RadioButton.new_with_label_from_widget` と同じですが *label* の中にニーモニックのアクセラレータ・キーを表す下線が付与される点が違います。

source: Joins this radio button to the group of another :class:`Gtk.RadioButton` object.
ja: このラジオボタンを別の :class:`Gtk.RadioButton` のグループに追加します。

source: LinkButton
it: Pulsante collegamento
ja: リンクボタン

source: A :class:`Gtk.LinkButton` is a :class:`Gtk.Button` with a hyperlink, similar to the one used by web browsers, which triggers an action when clicked. It is useful to show quick links to resources.
it: Un :class:`Gtk.LinkButton` è un :class:`Gtk.Button` con un collegamento ipertestuale, simile a quello utilizzato dai browser web, che innesca un'azione quando si fa clic. E' utile per mostrare collegamenti rapidi alle risorse.
ja: :class:`Gtk.LinkButton` はウェブ・ブラウザでよく利用されるハイパーリンクを持った :class:`Gtk.Button` の一種で、そのリンクをクリックすると関連づけられた任意のアクションを始動します。いろいろなリソースへのリンクを素早く表示させる際に便利なインタフェースです。

source: The URI bound to a :class:`Gtk.LinkButton` can be set specifically using :meth:`Gtk.LinkButton.set_uri`, and retrieved using :meth:`Gtk.LinkButton.get_uri`.
it: L'URI associato a un :class:`Gtk.LinkButton` può essere impostato con :meth:`Gtk.LinkButton.set_uri` e recuperato utilizzando :meth:`Gtk.LinkButton.get_uri`.
ja: :class:`Gtk.LinkButton` に関連づける URI は :meth:`Gtk.LinkButton.set_uri` メソッドで指定し :meth:`Gtk.LinkButton.get_uri` メソッドで取得できます。

source: LinkButton Objects
ja: リンクボタンのオブジェクト

source: *uri* is the address of the website which should be loaded. The label is set as the text which should be displayed. If it is set to ``None`` or omitted, the web address will be displayed instead.
ja: 引数の *uri* は参照することになるウェブサイトのアドレスです。引数の *label* はハイパーリンクとして表示する際の文字列です。この引数を ``None`` にするか省略すると、ウェブサイトのアドレスがそのまま表示されます。

source: Retrieves the URI set using :meth:`set_uri`.
ja: :meth:`Gtk.LinkButton.set_uri` メソッドを使って指定した URI を取得します。

source: Sets *uri* as the URI where this button points to. As a side-effect this unsets the 'visited' state of the button.
ja: このボタンが指している先の URI を *uri* にします。このメソッドを呼び出すと、ボタンが保持している 'visited' というステータスをリセットします。

source: SpinButton
it: Pulsante numerico
ja: スピンボタン

source: A :class:`Gtk.SpinButton` is an ideal way to allow the user to set the value of some attribute. Rather than having to directly type a number into a :class:`Gtk.Entry`, :class:`Gtk.SpinButton` allows the user to click on one of two arrows to increment or decrement the displayed value. A value can still be typed in, with the bonus that it can be checked to ensure it is in a given range. The main properties of a :class:`Gtk.SpinButton` are set through :class:`Gtk.Adjustment`.
it: Un :class:`Gtk.SpinButton` è un modo ideale per consentire all'utente di impostare il valore di qualche attributo. Invece di dover digitare direttamente un numero in un :class:`Gtk.Entry`, :class:`Gtk.SpinButton` permette all'utente di fare clic su una delle due frecce per incrementare o decrementare il valore visualizzato. Un valore può ancora essere digitato, con il vantaggio che di essere controllato per assicurarsi che sia in un dato intervallo. Le principali proprietà di un :class:`Gtk.SpinButton` vengono impostate tramite :class:`Gtk.Adjustment`.
ja: :class:`Gtk.SpinButton` クラスは、ユーザが任意の属性に対して調節しながら値を指定できるようにするための理想的な方法を提供します。直接 :class:`Gtk.Entry` に値を入力する代わりに :class:`Gtk.SpinButton` を使えばユーザは二つの矢印 (アローボタン) のいずれかをクリックして表示されている値を増やしたり減らしたりできます。さらに値をそのまま入力することもでき、その値が指定された範囲に収まっているかチェックする機能も付いています。 :class:`Gtk.SpinButton` の主なプロパティは :class:`Gtk.Adjustment` を介して指定します。

source: To change the value that :class:`Gtk.SpinButton` is showing, use :meth:`Gtk.SpinButton.set_value`. The value entered can either be an integer or float, depending on your requirements, use :meth:`Gtk.SpinButton.get_value` or :meth:`Gtk.SpinButton.get_value_as_int`, respectively.
it: Per modificare il valore mostrato da :class:`Gtk.SpinButton`, utilizzate :meth:`Gtk.SpinButton.set_value`. Il valore immesso può essere sia un numero intero o a virgola mobile, a seconda delle esigenze, utilizzando rispettivamente :meth:`Gtk.SpinButton.get_value` o :meth:`Gtk.SpinButton.get_value_as_int`.
ja: :class:`Gtk.SpinButton` が表示している値を変更する際は :meth:`Gtk.SpinButton.set_value` メソッドを使います。入力できる値は必要に応じて実数値または整数値いずれかで、それぞれ :meth:`Gtk.SpinButton.get_value` または :meth:`Gtk.SpinButton.get_value_as_int` メソッドで取得できます。

source: When you allow the displaying of float values in the spin button, you may wish to adjust the number of decimal spaces displayed by calling :meth:`Gtk.SpinButton.set_digits`.
it: Quando si consente la visualizzazione dei valori decimali nel pulsante numerico, si può regolare il numero di spazi decimali visualizzati con :meth:`Gtk.SpinButton.set_digits`.
ja: スピンボタンの中に実数値を表示できるような場合 :meth:`Gtk.SpinButton.set_digits` メソッドを使って小数点以下の桁数を調整できます。

source: By default, :class:`Gtk.SpinButton` accepts textual data. If you wish to limit this to numerical values only, call :meth:`Gtk.SpinButton.set_numeric` with ``True`` as argument.
it: In maniera predefinita, :class:`Gtk.SpinButton` accetta dati testuali. Se si desidera limitare questo ai soli valori numerici, chiamate :meth:`Gtk.SpinButton.set_numeric` con ``True`` come argomento.
ja: デフォルトで :class:`Gtk.SpinButton` は文字列のデータを受け取ることができるようになっています。もし数値だけ入力できるように制限したい場合 :meth:`Gtk.SpinButton.set_numeric` メソッドに引数として ``True`` を渡して呼び出して下さい。

source: We can also adjust the update policy of :class:`Gtk.SpinButton`. There are two options here; by default the spin button updates the value even if the data entered is invalid. Alternatively, we can set the policy to only update when the value entered is valid by calling :meth:`Gtk.SpinButton.set_update_policy`.
it: Possiamo anche modificare la politica di aggiornamento di :class:`Gtk.SpinButton`. Ci sono due opzioni; in maniera predefinita il pulsante numerico aggiorna il valore anche se il dato inserito non è valido. In alternativa, si può impostare la politica di aggiornamento solo quando il valore immesso è valido chiamando :meth:`Gtk.SpinButton.set_update_policy`.
ja: また :class:`Gtk.SpinButton` の更新ポリシーも調整することが可能です。ここには二つの選択肢があります。デフォルトで、スピンボタンは例え間違ったデータが入力された場合でも値を更新するというポリシーになっています。あるいは :meth:`Gtk.SpinButton.set_update_policy` を呼び出して、妥当なデータが入力された時にのみ値を更新するというポリシーも選択できます。

source: SpinButton Objects
ja: スピンボタンのオブジェクト

source: Replaces the :class:`Gtk.Adjustment` associated with this spin button.
ja: このスピンボタンに関連づけられている :class:`Gtk.Adjustment` を *adjustment* で置き換えます。

source: Set the precision to be displayed by this spin button. Up to 20 digit precision is allowed.
ja: このスピンボタンに表示する値の精度を指定します。小数点以下 20 桁までの精度を指定できます。

source: Sets the step and page increments for this spin button. This affects how quickly the value changes when the spin button's arrows are activated.
ja: このスピンボタンに対するステップ単位とページ単位の増分値を指定します。これは、スピンボタンについているアローボタンを押下した時にどれくらい値を変化させるかに影響します。

source: Sets the value of this spin button.
ja: このスピンボタンの値を *value* にします。

source: Get the value of this spin button represented as an float.
ja: このスピンボタンが保持している値を実数値として取得します。

source: Get the value of this spin button represented as an integer.
ja: このスピンボタンが保持している値を整数値として取得します。

source: If *numeric* is ``False``, non-numeric text can be typed into the spin button, else only numbers can be typed.
ja: *numeric* が ``False`` の場合、数値ではない文字列をスピンボタンに入力できるようになります。それ以外は数値だけ入力できます。

source: Sets the update behavior of a spin button. This determines whether the spin button is always updated or only when a valid value is set. The *policy* argument can either be :attr:`Gtk.SpinButtonUpdatePolicy.ALWAYS` or :attr:`Gtk.SpinButtonUpdatePolicy.IF_VALID`.
ja: このスピンボタンの更新ポリシーを指定します。このポリシーは常にスピンボタンの値を更新するか、あるいは妥当な値が入力された時にだけ更新するかを決定します。引数の *policy* には :attr:`Gtk.SpinButtonUpdatePolicy.ALWAYS` または :attr:`Gtk.SpinButtonUpdatePolicy.IF_VALID` のいずれかを指定できます。

source: Adjustment Objects
ja: アジャストメントのオブジェクト

source: The :class:`Gtk.Adjustment` object represents a value which has an associated lower and upper bound, together with step and page increments, and a page size. It is used within several GTK+ widgets, including :class:`Gtk.SpinButton`, :class:`Gtk.Viewport`, and :class:`Gtk.Range`.
ja: :class:`Gtk.Adjustment` は下限と上限を持ち、ステップ単位とページ単位の増減値を持ち、ページサイズを持つ一個の値を表す抽象的なオブジェクトです。このオブジェクトは :class:`Gtk.SpinButton` や :class:`Gtk.Viewport` や :class:`Gtk.Range` といった GTK+ のいろいろなウィジェットの中で利用されています。

source: *value* is the initial value, *lower* the minimum value, *upper* the maximum value, *step_increment* the step increment, *page_increment* the page increment, and *page_size* the page size.
ja: *value* は初期値、 *lower* は最小値、 *upper* は最大値、 *step_increment* はステップ単位の増減値、 *page_increment* はページ単位の増減値、そして *page_size* は一ページの大きさです。

source: Switch
it: Pulsanti scambiatori

source: A :class:`Gtk.Switch` is a widget that has two states: on or off. The user can control which state should be active by clicking the empty area, or by dragging the handle.
it: Un :class:`Gtk.Switch` è un widget che ha due stati: acceso o spento. L'utente può controllare quale stato dovrebbe essere attivo facendo clic sull'area vuota, o trascinando la maniglia.

source: You shouldn't use the "activate" signal on the Gtk.Switch which is an action signal and emitting it causes the switch to animate. Applications should never connect to this signal, but use the "notify::active" signal, see the example here below.
it: Non dovreste utilizzare il segnale di "activate" con Gtk.Switch il quale è un segnale di azione e anima lo scambio. Le applicazioni non dovrebbero mai collegarsi a questo segnale, ma usare il segnale "notify::active", si veda l'esempio seguente.
