Repository: sebp/PyGObject-Tutorial
Catalog: translations/locale/*/LC_MESSAGES/drag_and_drop.po
Languages: it, ja

source: Drag and Drop
ja: ドラッグ＆ドロップ

source: Versions of PyGObject < 3.0.3 contain a bug which does not allow drag and drop to function correctly. Therefore a version of PyGObject >= 3.0.3 is required for the following examples to work.
it: Le versioni di PyGObject <3.0.3 contengono un bug che non permette il funzionamento corretto del drag and drop. Pertanto è necessaria una versione di PyGObject >= 3.0.3 affinché si possa lavorare con i seguenti esempi.
ja: PyGObject < 3.0.3 には正しく機能しないドラッグ＆ドロップの実装が含まれています。そのためここで紹介する例を動作させるには PyGObject >= 3.0.3 が必要になります。

source: Setting up drag and drop between widgets consists of selecting a drag source (the widget which the user starts the drag from) with the :meth:`Gtk.Widget.drag_source_set` method, selecting a drag destination (the widget which the user drops onto) with the :meth:`Gtk.Widget.drag_dest_set` method and then handling the relevant signals on both widgets.
it: La configurazione del drag and drop tra widget consiste nel selezionare una sorgente di trascinamento (il widget dal quale l'utente inizia il trascinamento) con il metodo :meth:`Gtk.Widget.drag_source_set`, selezionando una destinazione (il widget sul quale l'utente arriverà a destinazione) con il metodo :meth:`Gtk.Widget.drag_dest_set` e poi gestire i segnali rilevanti in entrambi i widget.
ja: :meth:`Gtk.Widget.drag_source_set` メソッドを使って選択した ``ドラッグ元`` (ユーザがドラッグを開始するウィジェット) と, :meth:`Gtk.Widget.drag_dest_set` メソッドを使って選択した ``ドラッグ先`` (ユーザがドロップする先のウィジェット) のペアの間でドラッグ＆ドロップを設定し、双方のウィジェットで適切なシグナルを処理します。

source: Instead of using :meth:`Gtk.Widget.drag_source_set` and :meth:`Gtk.Widget.drag_dest_set` some specialised widgets require the use of specific functions (such as :class:`Gtk.TreeView` and :class:`Gtk.IconView`).
it: Anziché usare :meth:`Gtk.Widget.drag_source_set` e :meth:`Gtk.Widget.drag_dest_set` alcuni widget specializzati richiedono l'uso di determinate funzioni (come :class:`Gtk.TreeView` e :class:`Gtk.IconView`).
ja: (:class:`Gtk.TreeView` や :class:`Gtk.IconView` といった) 特別なウィジェットの場合は :meth:`Gtk.Widget.drag_source_set` と :meth:`Gtk.Widget.drag_dest_set` といったメソッドではなく、特定のメソッド必要になってきます。

source: A basic drag and drop only requires the source to connect to the "drag-data-get" signal and the destination to connect to the "drag-data-received" signal. More complex things such as specific drop areas and custom drag icons will require you to connect to :ref:`additional signals <drag-signals>` and interact with the :class:`Gdk.DragContext` object it supplies.
it: Un semplice drag and drop richiede solo la sorgente da collegare al segnale "drag-data-get" e la destinazione da collegare al segnale "drag-data-received". Le cose più complesse, come una specifica area di rilascio e le icone di trascinamento personalizzate, richiedono di collegarsi ai :ref:`segnali aggiuntivi <drag-segnali>` e interagire con l'oggetto :class:`Gdk.DragContext`.
ja: 基本的なドラッグ＆ドロップ処理ならばドラッグ元を "drag-data-get" シグナルに接続し、ドラッグ先を "drag-data-received" シグナルに接続するだけです。そうではなくもっと複雑なこと、例えばドロップする領域を指定したり独自にドラッグ用アイコンを指定するような場合は :ref:`その他のシグナル <drag-signals>` に接続し、あらかじめ指定しておいた :class:`Gdk.DragContext` 型のオブジェクトを利用して処理する必要があります。

source: In order to transfer data between the source and destination, you must interact with the :class:`Gtk.SelectionData` variable supplied in the :ref:`"drag-data-get" <drag-signals>` and :ref:`"drag-data-received" <drag-signals>` signals using the :class:`Gtk.SelectionData` get and set methods.
it: Per trasferire i dati dalla sorgente alla destinazione, è necessario interagire con la variabile :class:`Gtk.SelectionData` indicata nei segnali :ref:`drag-data-get <drag-signals>` e :ref:`drag-data-received <drag-signals>` e usare i metodi get e set di :class:`Gtk.SelectionData`.
ja: ドラッグ元からドラッグ先へデータを転送するために, :class:`Gtk.SelectionData` 型の変数を :class:`Gtk.SelectionData` の getter/setter を使って :ref:`"drag-data-get" <drag-signals>` と :ref:`"drag-data-received" <drag-signals>` のシグナルに引き渡す必要があります。

source: Target Entries
it: Voci destinazione
ja: ターゲット・エントリ

source: To allow the drag source and destination to know what data they are receiving and sending, a common list of :class:`Gtk.TargetEntry's <Gtk.TargetEntry>` are required. A :class:`Gtk.TargetEntry` describes a piece of data that will be sent by the drag source and received by the drag destination.
it: Per informare l'origine del trascinamento e la destinazione sul tipo di dati che si stanno inviando e ricevendo, è necessaria una lista comune di <Gtk.TargetEntry> del widget :class:`Gtk.TargetEntry`. Quest'ultimo descrive un pezzo dei dati che saranno inviati dalla sorgente di trascinamento e ricevuti dalla destinazione.
ja: ドラッグ元とドラッグ先でどんな種類のデータを送ったり受け取ることができるかを知るには :class:`Gtk.TargetEntry <Gtk.TargetEntry>` を要素とする共通リストが必要になります。この :class:`Gtk.TargetEntry` にはドラッグ元が送信し、ドラッグ先で受け取るデータの一部が記載されています。

source: There are two ways of adding :class:`Gtk.TargetEntry's <Gtk.TargetEntry>` to a source and destination. If the drag and drop is simple and each target entry is of a different type, you can use the group of methods :meth:`mentioned here <Gtk.Widget.drag_source_add_text_targets>`.
it: Ci sono due modi di aggiungere <Gtk.TargetEntry> della classe :class:`Gtk.TargetEntry` ad una sorgente e destinazione. Se il drag and drop è semplice e ogni voce di destinazione è di tipo diverso, è possibile utilizzare il gruppo di metodi :meth:`menzionati qui <Gtk.Widget.drag_source_add_text_targets>`.
ja: 複数の :class:`Gtk.TargetEntry <Gtk.TargetEntry>` をドラッグ元とドラッグ先に追加する方法は二つあります。もし簡単なドラッグ＆ドロップとしてターゲット・エントリがそれぞれ異なる種類であるならば, :meth:`rag_source_add_text_targets <Gtk.Widget.drag_source_add_text_targets>` 系のメソッドを利用できます。

source: If you require more than one type of data or wish to do more complex things with the data, you will need to create the :class:`Gtk.TargetEntry's <Gtk.TargetEntry>` using the :meth:`Gtk.TargetEntry.new` method.
it: Se avete bisogno di più tipi di dati o si desidera fare cose più complesse con i dati, è necessario creare il <Gtk.TargetEntry> di :class:`Gtk.TargetEntry` con il metodo :meth:`Gtk.TargetEntry.new `.
ja: もし二種類以上のデータをやりとりしたり、データを使ってもっと複雑なことをしたいのであれば :meth:`Gtk.TargetEntry.new` メソッドを使って :class:`Gtk.TargetEntry <Gtk.TargetEntry>` をいくつか生成する必要があります。

source: Drag and Drop Methods and Objects
ja: ドラッグ＆ドロップのメソッドとオブジェクト

source: Sets the widget to be a drag source.
ja: このウィジェットをドラッグ元にします。

source: *start_button_mask* are a combination of :attr:`Gdk.ModifierType` masks which sets which buttons must be pressed for a drag to occur. *targets* is a list of :class:`Gtk.TargetEntry's <Gtk.TargetEntry>` which describe the data to be passed between source and destination. *actions* are a combination :attr:`Gdk.DragAction` masks to show possible drag actions.
ja: *start_button_mask* には :attr:`Gdk.ModifierType` 型のマスク (ドラッグを開始する際に押下するのボタン) をいくつか組み合わせて指定します。 *targets* には :class:`Gtk.TargetEntry <Gtk.TargetEntry>` (ドラッグ元とドラッグ先との間で転送されるデータの種類を記述したもの) を要素とするリストを指定します。 *actions* には :attr:`Gdk.DragAction` 型のマスク (ドラッグで実施可能なアクションの種類) を組み合わせて指定します。

source: Sets the widget to be a drag destination.
ja: このウィジェットをドラッグ先にします。

source: *flags* are a combination of :attr:`Gtk.DestDefaults` masks which configures the processes which occur on a drag site. *targets* is a list of :class:`Gtk.TargetEntry's <Gtk.TargetEntry>` which describe the data to be passed between source and destination. *actions* are a combination :attr:`Gdk.DragAction` masks to show possible drag actions.
ja: *flags* には :attr:`Gtk.DestDefaults` 型のマスク (ドラッグ先で処理するアクション) をいくつか組み合わせて指定します。 *targets* には :class:`Gtk.TargetEntry <Gtk.TargetEntry>` (ドラッグ元とドラッグ先との間で転送されるデータの種類を記述したもの) を要素とするリストを指定します。 *actions* には :attr:`Gdk.DragAction` 型のマスク (ドラッグ先で実施可能なアクション) をいくつか組み合わせて指定します。

source: Add a :class:`Gtk.TargetEntry` to the drag source/destination which contains a piece of text.
ja: :class:`Gtk.TargetEntry` を文字列を含むドラッグ元/先へ一つ追加します。

source: Add a :class:`Gtk.TargetEntry` to the drag source/destination which contains a :class:`GdkPixbuf.Pixbuf`.
ja: :class:`Gtk.TargetEntry` を :class:`GdkPixbuf.Pixbuf` を持つドラッグ元/先へ一つ追加します。

source: Add a :class:`Gtk.TargetEntry` to the drag source/destination which contains a list of URIs.
ja: :class:`Gtk.TargetEntry` を URI を要素とするリストを持つドラッグ元/先へ一つ追加します。

source: Creates a new target entry.
ja: 新しいターゲット・エントリを生成します。

source: *target* is a string describing the type of data the target entry describes.
ja: *target* にはターゲット・エントリに記載するデータの種類 (文字列) を指定します。

source: *flags* controls under which conditions will the data be transferred in a drag and drop and is a combination of the :attr:`Gtk.TargetFlags` values:
ja: *flags* はドラッグ＆ドロップでデータを転送する条件を表し、次の :attr:`Gtk.TargetFlags` 型の値を組み合わせて指定します:

source: :attr:`Gtk.TargetFlags.SAME_APP` - Only transferred in the same application
ja: :attr:`Gtk.TargetFlags.SAME_APP` - 同じアプリケーションの中でのみ転送する

source: :attr:`Gtk.TargetFlags.SAME_WIDGET` - Only transferred within the same widget
ja: :attr:`Gtk.TargetFlags.SAME_WIDGET` - 同じウィジェットの中でのみ転送する

source: :attr:`Gtk.TargetFlags.OTHER_APP` - Only transferred in a different application
ja: :attr:`Gtk.TargetFlags.OTHER_APP` - 異なるアプリケーションの間でのみ転送する

source: :attr:`Gtk.TargetFlags.OTHER_WIDGET` - Only transferred within a different widget
ja: :attr:`Gtk.TargetFlags.OTHER_WIDGET` - 異なるウィジェットの間でのみ転送する

source: *info* is an ID which the application can use to determine between different pieces of data contained in a drag and drop operation.
ja: *info* は、ドラッグ＆ドロップの操作に含まれているデータの種類を確定する際にアプリケーションが利用できる識別子です。

source: Returns the contents of the text contained in selection data
ja: ``セレクション`` の中に含まれるデータから文字列を返します。

source: Sets the contents of the text contained in selection data to *text*
ja: ``セレクション`` の中に含めるデータに *text* を格納します。

source: Returns the pixbuf contained in selection data
ja: ``セレクション`` の中に含まれるデータから Pixbuf を返します。

source: Sets the pixbuf contained in selection data to *pixbuf*
ja: ``セレクション`` の中に含めるデータに *pixbuf* を格納します。

source: Drag Source Signals
it: Segnali della sorgente di trascinamento
ja: ドラッグ元のシグナル

source: Name
it: Nome
ja: シグナルの名前

source: When it is emitted
it: Quando è emesso
ja: 発行されるタイミング

source: Common Purpose
it: Scopo comune
ja: 主な目的

source: User starts a drag
it: L'utente inizia a trascinare
ja: ユーザがドラッグを開始した時

source: Set-up drag icon
it: Imposta l'icona di trascinamento
ja: ドラッグ中のアイコンをセットする

source: When drag data is requested by the destination
it: Quando i dati trascinati sono richiesti dalla destinazione
ja: ドラッグ先からデータの要求があった時

source: Transfer drag data from source to destination
it: Trasferisce i dati trascinati dalla sorgente alla destinazione
ja: ドラッグ元からドラッグ先へデータを転送する

source: When a drag with the action Gdk.DragAction.MOVE is completed
it: Quando un trascinamento con l'azione Gdk.DragAction.MOVE è completata
ja: Gdk.DragAction.MOVE のアクションを持つドラッグが完了した時

source: Delete data from the source to complete the 'move'
it: Elimina i dati dalla sorgente per completare il 'movimento'
ja: ドラッグ元のデータを削除して「移動」を完了する

source: When the drag is complete
it: Quando il trascinamento è completato
ja: ドラッグが完了した時

source: Undo anything done in drag-begin
it: Annulla qualsiasi cosa fatta in drag-begin
ja: drag-begin で実施した状態に戻す

source: Drag Destination Signals
it: Segnali per la destinazione del trascinamento
ja: ドラッグ先のシグナル

source: Drag icon moves over a drop area
it: Trascina un'icona muovendola in un'area di ricezione
ja: ドラッグ中のアイコンがドロップ領域の上に移動した時

source: Allow only certain areas to be dropped onto
it: Si consente solo ad alcune aree di ricevere
ja: 決められた領域だけドロップできる

source: Icon is dropped onto a drag area
it: L'icona viene fatto cadere in una zona di trascinamento
ja: アイコンがドロップ領域の上でドロップされた時

source: When drag data is received by the destination
it: Quando i dati trascinati sono giunti a destinazione
ja: ドラッグ先がデータを受け取った時

source: Example
it: Esempio
ja: 例
