Repository: sebp/PyGObject-Tutorial
Catalog: translations/locale/*/LC_MESSAGES/introduction.po
Languages: it, ja

source: Getting Started
it: Per iniziare
ja: 始めてみよう

source: Simple Example
it: Un semplice esempio
ja: 簡単な例

source: To start with our tutorial we create the simplest program possible. This program will create an empty 200 x 200 pixel window.
it: Per iniziare con il nostro tutorial creiamo il programma più semplice possibile. Questo programma aprirà una finestra vuota di 200 x 200 pixel.

source: We will now explain each line of the example.
it: Spiegheremo ora ogni singola linea dell'esempio.
ja: このプログラムの各行について解説していきます。

source: In the beginning, we have to import the Gtk module to be able to access GTK+'s classes and functions. Since a user's system can have multiple versions of GTK+ installed at the same, we want to make sure that we when we import Gtk that it referrs to GTK+ 3 and not any other version of the library, which is the purpose of statement ``gi.require_version('Gtk', '3.0')``.
it: All'inizio, dobbiamo importare il modulo Gtk per essere in grado di accedere alle sue classi e le sue funzioni. Dal momento che il sistema di un utente può avere più versioni di GTK + installato nello stesso, si vuole fare in modo che quando importiamo la libreria si faccia riferimento a GTK+ 3 e non qualsiasi altra versione della stessa, ecco lo scopo della dichiarazione ``gi .require_version('Gtk', '3.0')``.

source: The next line creates an empty window.
it: La prossima linea crea una finestra vuota.

source: Followed by connecting to the window's delete event to ensure that the application is terminated if we click on the *x* to close the window.
it: Segue il collegamento all'evento di chiusura della finestra, per assicurare che l'applicazione sia terminata se si fa clic su *x* per chiudere la finestra.
ja: 続いて、ウィンドウの delete イベントに接続することで、 このウィンドウの *x* をクリックして閉じるとアプリケーションが終了することを保証します。

source: In the next step we display the window.
it: Nel passo successivo visualizzeremo una finestra.
ja: 次はウィンドウを表示させています。

source: Finally, we start the GTK+ processing loop which we quit when the window is closed (see line 5).
it: Finalmente, avviamo il ciclo GTK+ dal quale usciremo chiudendo la finestra (vedi linea 5).
ja: 最後に、GTK+ の制御用ループを起動して、ウィンドウを閉じたらアプリケーションが終了するようにします (5行目を参照のこと)。

source: To run the program, open a terminal, change to the directory of the file, and enter::
it: Per eseguire il programma, aprite un terminale, entrare nella directory del file e digitate::
ja: このプログラムを実行するには、端末を開いて、このファイルがあるフォルダに移動し、次を入力します::

source: Extended Example
it: Esempio esteso
ja: ちょっと高度な例

source: For something a little more useful, here's the PyGObject version of the classic "Hello World" program.
it: Per qualcosa di più utile, qui c'è la versione PyGObject del classico programma "Hello World".
ja: ちょっとだけ使えるものにするために、ここで古典的なプログラムである「Hello World」の PyGObject 版を紹介します。

source: This example differs from the simple example as we sub-class :class:`Gtk.Window` to define our own :class:`MyWindow` class.
it: Questo esempio si differenzia dal precedente perché abbiamo creato una sotto classe a :class:`Gtk.Window` chiamata :class:`MyWindow`.
ja: この例と簡単な例との違いは、ここで自作した :class:`MyWindow` クラスは :class:`Gtk.Window` クラスのサブクラスとして定義している点です。

source: In the class's constructor we have to call the constructor of the super class. In addition, we tell it to set the value of the property `title` to `Hello World`.
it: Nella costruzione della classe dobbiamo chiamare il costruttore della classe principale. Inoltre, impostiamo il valore della proprietà `title` a `Hello World`.
ja: クラスのコンストラクタの中で、スーパークラスのコンストラクタを呼び出す必要があります。加えて "title" というプロパティの値を `Hello World` にするようにスーパークラスに指示します。

source: The next three lines are used to create a button widget, connect to its `clicked` signal and add it as child to the top-level window.
it: Le prossime tre linee sono utilizzate per creare il widget di un pulsante, collegarlo al suo segnale `clicked` e aggiungerlo come widget figlio alla finestra di primo livello.
ja: 次の三行はボタン・ウィジェットを生成し、その `clicked` シグナルに接続して、ボタン・ウィジェットをトップレベルのウィンドウに追加します。

source: Accordingly, the method :meth:`on_button_clicked` will be called if you click on the button.
it: Di conseguenza, il metodo :meth:`on_button_clicked` verrà chiamato se si fa clic sul pulsante.
ja: そのため :meth:`on_button_clicked` というメソッドを実装して、ボタンの上でクリックしたら呼び出されるようにします。

source: The last block, outside of the class, is very similar to the simple example above, but instead of creating an instance of the generic :class:`Gtk.Window` class, we create an instance of :class:`MyWindow`.
it: L'ultimo blocco, al di fuori della classe, è molto simile alla semplice esempio precedente, ma invece di creare un'istanza della classe generica :class:`Gtk.Window`, creiamo un'istanza di :class:`MyWindow`.
ja: クラスの外側にある最後のブロックは、前述の簡単な例のプログラムにとても似ています。但し、 :class:`Gtk.Window` という汎用クラスのインスタンスを生成する代わりに、自作した :class:`MyWindow` クラスのインスタンスを生成しています。

source: To start with our tutorial we create the simplest program possible. This program will create an emtpy 200 x 200 pixel window.
ja: これからチュートリアルを開始するにあたり、一番簡単なプログラムを作成します。このプログラムは縦横が 200 x 200 ピクセルの何もないウィンドウを一つ生成します。

source: The first line of all Python programs should start with ``#!`` followed by the path to the Python interpreter you want to invoke.
ja: 全ての Python プログラムの先頭行は ``#!`` で始め、それから実行時に呼び出す Python インタプリタへのパスを続けます。

source: In order to access GTK+ classes and functions we first must import the Gtk module. The next line creates an empty window.
ja: GTK+ のいろいろなクラスと関数にアクセスするために、まず Gtk モジュールをインポートする必要があります。次の行で空っぽのウィンドウを一つ生成しています。
