Repository: sebp/PyGObject-Tutorial
Catalog: translations/locale/*/LC_MESSAGES/layout.po
Languages: it, ja

source: Layout Containers
it: Contenitori di layout
ja: レイアウト用のコンテナ

source: While many GUI toolkits require you to precisely place widgets in a window, using absolute positioning, GTK+ uses a different approach. Rather than specifying the position and size of each widget in the window, you can arrange your widgets in rows, columns, and/or tables. The size of your window can be determined automatically, based on the sizes of the widgets it contains. And the sizes of the widgets are, in turn, determined by the amount of text they contain, or the minimum and maximum sizes that you specify, and/or how you have requested that the available space should be shared between sets of widgets. You can perfect your layout by specifying padding distance and centering values for each of your widgets. GTK+ then uses all this information to resize and reposition everything sensibly and smoothly when the user manipulates the window.
it: Mentre molti toolkit GUI richiedono di posizionare con precisione i widget in una finestra, utilizzando il posizionamento assoluto, GTK+ utilizza un approccio differente. Invece di specificare la posizione e le dimensioni di ogni oggetto nella finestra, si organizzano widget in righe, colonne e/o tabelle. La dimensione della finestra può essere determinata automaticamente, in base alle dimensioni dei widget in essa contenuti. Le dimensioni dei widget sono, a loro volta, determinate dalla quantità di testo contenuta, o le dimensioni minime e massime specificate, e/o la configurazione richiesta per gestire lo spazio disponibile da condividere tra widget. È possibile perfezionare il layout specificando il padding e la centratura per ognuno dei vostri widget. GTK+ utilizza quindi tutte queste informazioni per ridimensionare e riposizionare tutto flessibilmente quando l'utente manipola la finestra.
ja: 多くの GUI ツールキットがウィンドウの中に任意のウィジェットを正確に配置するために絶対座標を要求してくる一方で、GTK+ では別のアプローチを採用しています。ウィンドウの中に配置するいろいろなウィジェットに対して位置と大きさをぞれぞれ指定する代わりに、行や列、そして/あるいはテーブルの類にウィジェットを配置していくとができます。ウィンドウの大きさは、その中に配置しているいろいろなウィジェットの大きさに基づいて自動的に計算させることが可能です。さらにウィンドウの中にあるウィジェットの大きさは、それらのウィジェットが格納している文字列の長さとか、明示的に指定した最小値と最大値から計算するとか、もしくはウィンドウの中で利用できる領域を複数のウィジェットの間で共有するよう要求することができるようになっています。ウィジェットとウィジェットの間隔や均等配置などを指定することでレイアウトを完成させていくことができます。それから、GTK+ はこれらのレイアウト情報を全て利用して、ユーザがウィンドウを操作したら、賢く滑らかにその大きさを変更したり配置を更新します。

source: GTK+ arranges widgets hierarchically, using *containers*. They are invisible to the end user and are inserted into a window, or placed within each other to layout components. There are two flavours of containers: single-child containers, which are all descendants of :class:`Gtk.Bin`, and multiple-child containers, which are descendants of :class:`Gtk.Container`. The most commonly used are vertical or horizontal boxes (:class:`Gtk.Box`), tables (:class:`Gtk.Table`) and grids (:class:`Gtk.Grid`).
ja: GTK+ は *コンテナ* を使っていろいろなウィジェットを階層的に配置していきます。ユーザにはコンテナは見えません。コンテナはウィンドウに埋め込まれるか、別のコンテナの中に配置されます。コンテナには二種類あります: 子を一つだけ配置できるタイプのコンテナは全て :class:`Gtk.Bin` クラスから派生しています。複数の子を配置できるコンテナは :class:`Gtk.Container` クラスから派生しています。もっともよく利用するのは垂直と水平のボックス (:class:`Gtk.Box`)、テーブル (:class:`Gtk.Table`)、そして格子 (:class:`Gtk.Grid`) です。

source: Boxes
it: Caselle
ja: ボックス

source: Boxes are invisible containers into which we can pack our widgets. When packing widgets into a horizontal box, the objects are inserted horizontally from left to right or right to left depending on whether :meth:`Gtk.Box.pack_start` or :meth:`Gtk.Box.pack_end` is used. In a vertical box, widgets are packed from top to bottom or vice versa. You may use any combination of boxes inside or beside other boxes to create the desired effect.
it: Le caselle sono contenitori invisibili in cui possiamo collocare i nostri widget. Quando si aggiungono widget in una casella orizzontale, gli oggetti vengono inseriti in senso orizzontale da sinistra a destra o da destra a sinistra a seconda che :meth:`Gtk.Box.pack_start` o :meth:`Gtk.Box.pack_end` siano utilizzati. In una casella verticale, gli oggetti vengono inseriti dall'alto verso il basso o viceversa. È possibile utilizzare qualsiasi combinazione di casella all'interno o accanto ad altre caselle per creare l'effetto desiderato.
ja: ボックスは見えないコンテナの一つで、いろいろなウィジェットを詰め込む (パッキングする) ことができます。水平ボックスの中にウィジェットをパッキングしていくと、それらのオブジェクトは左から右へ、または右から左へ横方向に並べられていきます (並べられていく向きは :meth:`Gtk.Box.pack_start` または :meth:`Gtk.Box.pack_end` 関数で指定した向きに依存します)。垂直ボックスの場合、ウィジェットは上から下へ、またはその逆向きに縦方向に並べられていきます。ボックスを他のボックスの中にパッキングしたり、別のボックスの横に並べる等してお望みのレイアウトを実現できます。

source: Box Objects
ja: ボックスのオブジェクト

source: The rectangular area of a :class:`Gtk.Box` is organized into either a single row or a single column of child widgets depending upon whether the "orientation" property is set to :attr:`Gtk.Orientation.HORIZONTAL` or :attr:`Gtk.Orientation.VERTICAL`.
ja: :class:`Gtk.Box` の矩形領域は、"orientation" プロパティの内容 (:attr:`Gtk.Orientation.HORIZONTAL` または :attr:`Gtk.Orientation.VERTICAL`) に応じて複数の子ウィジェットを一行または一列の中に並べていきます。

source: If *homogeneous* is ``True``, all widgets in the box will be the same size, of which the size is determined by the largest child widget. If it is omitted, *homogeneous* defaults to ``False``.
ja: *homogeneous* というプロパティを ``True`` にすると、ボックス内の全ての子ウィジェットが同じ大きさになります (一番大きな子ウィジェットの大きさに合わせられます)。このプロパティの指定を省略すると、 *homogeneous* の内容はデフォルト値の ``False`` になります。

source: *spacing* is the number of pixels to place by default between children. If omitted, no spacing is used, i.e. *spacing* is set to 0.
ja: *spacing* というプロパティは子ウィジェットの間隔をピクセル単位で指定します。省略すると間隔がなくなります (すなわち *spacing* が 0 になります)。

source: By default, child widgets are organized into a single row, i.e. the "orientation" property is set to :attr:`Gtk.Orientation.HORIZONTAL`.
ja: デフォルトで、子ウィジェットは一行の中に並べられるようになっています。すなわち、"orientation" プロパティは :attr:`Gtk.Orientation.HORIZONTAL` になります。

source: :class:`Gtk.Box` uses a notion of *packing*. Packing refers to adding widgets with reference to a particular position in a :class:`Gtk.Container`. For a :class:`Gtk.Box`, there are two reference positions: the start and the end of the box. If "orientation" is :attr:`Gtk.Orientation.VERTICAL`, the start is defined as the top of the box and the end is defined as the bottom. If "orientation" is :attr:`Gtk.Orientation.HORIZONTAL`, the start is defined as the left side and the end is defined as the right side.
ja: :class:`Gtk.Box` は *パッキング* の記法を使用します。パッキングは :class:`Gtk.Container` の特定の位置 (リファレンス位置) に関してウィジェットを追加していくことを指示します。 :class:`Gtk.Box` の場合、リファレンス位置は二つあります。それはボックスの先頭と末尾です。"orientation" が :attr:`Gtk.Orientation.VERTICAL` の場合、先頭はボックスの上端で、末尾は下端になります。また、"orientation" が :attr:`Gtk.Orientation.HORIZONTAL` の場合、先頭は左端で、末尾が右端になります。

source: Adds *child* to box, packed with reference to the start of box. The *child* is packed after any other child packed with reference to the start of box.
ja: *child* を、ボックスの先頭をリファレンス位置としてパッキングしながら追加します。 *child* は、ボックスの先頭にパッキングされたその他の子ウィジェットの後に追加されていきます。

source: *child* should be a :class:`Gtk.Widget` to be added to this box. The *expand* argument when set to ``True`` allows the *child* widget to take all available space it can. Alternately, if the value is set to ``False``, the box will be shrunken to the same size as the child widget.
ja: *child* は、このボックスに追加する一個の :class:`Gtk.Widget` です。 *expand* を ``True`` にすると *child* はボックス内で利用できる空間を全て占有します。逆に ``False`` にすると、ボックスが *child* と同じ大きさに縮まります。

source: If the *fill* argument is set to ``True``, the *child* widget takes all available space and is equal to the size of the box. This only has an effect when *expand* is set to ``True``. A child is always allocated the full height of a horizontally oriented and the full width of a vertically oriented box. This option affects the other dimension.
ja: *fill* を ``True`` にすると *child* は利用できる空間を全て占有し、ボックスと同じ大きさになります。これは *expand* を ``True`` にした時にだけ効果があります。 *child* は常に水平ボックスと同じ高さを持ち、垂直ボックスと同じ幅を持ちます。このオプションは他の次元でも効果があります。

source: *padding* defines extra space in pixels to put between this child and its neighbours, over and above the global amount specified by "spacing" property. If *child* is a widget at one of the reference ends of box, then padding pixels are also put between *child* and the reference edge of this box.
ja: *padding* は、子ウィジェットとその横にあるウィジェットとの間に挿入する余白をピクセル単位で指定します (その際は、ボックス生成時に指定した *spacing* というプロパティの値と加算されます)。 *child* がボックスの末尾に配置されたウィジェットの場合 *padding* に指定した余白がその *child* とボックスの終端との間にも挿入されます。

source: Adds *child* to box, packed with reference to the end of box. The *child* is packed after (away from end of) any other child packed with reference to the end of box.
ja: *child* を、ボックスの終端をリファレンス位置としてパッキングしながら追加します。 *child* はボックスの末尾にパッキングされたその他の子ウィジェットの前に (ボックスの先頭に向かって) 追加されていきます。

source: Arguments are the same as for :meth:`pack_start`.
ja: 引数は :meth:`Gtk.Box.pack_start` 関数と同じです。

source: If *homogeneous* is ``True``, all widgets in the box will be the same size, of which the size is determined by the largest child widget.
ja: *homogeneous* を ``True`` にすると、ボックス内の全ての子ウィジェットは同じ大きさになります (一番大きな子ウィジェットの大きさに合わせられます)。

source: Example
it: Esempio
ja: 例

source: Let's take a look at a slightly modified version of the extended example with two buttons.
it: Diamo uno sguardo ad una versione leggermente modificata dell'esempio esteso con due pulsanti.
ja: 前述のちょっと高度な例を少し変更し二つのボタンを持つアプリケーションをみていくことにしましょう。

source: First, we create a horizontally orientated box container where 6 pixels are placed between children. This box becomes the child of the top-level window.
it: In primo luogo, creiamo un contenitore casella orientato in senso orizzontale in cui indichiamo 6 pixel di distanza tra i widget figli. Questa casella sarà il widget figlio della finestra di primo livello.
ja: まず最初に、水平方向のボックス型のコンテナを一つ生成します。このボックスの中で子ウィジェットは 6 ピクセル毎に配置されるようにします。個のボックスはトップレベル・ウィンドウの子になります。

source: Subsequently, we add two different buttons to the box container.
it: Successivamente, si aggiungono due pulsanti diversi al contenitore casella.
ja: その次に、このボック型のコンテナにボタンを二つ追加していきます。

source: While with :meth:`Gtk.Box.pack_start` widgets are positioned from left to right, :meth:`Gtk.Box.pack_end` positions them from right to left.
it: Mentre con :meth:`widget Gtk.Box.pack_start` sono posizionati da sinistra a destra, :meth:`Gtk.Box.pack_end` li posiziona da destra a sinistra.
ja: :meth:`Gtk.Box.pack_start` メソッドを使うとウィジェットを左から右に配置していくのに対し :meth:`Gtk.Box.pack_end` メソッドは右から左へウィジェットを配置します。

source: Grid
it: Griglia
ja: グリッド

source: :class:`Gtk.Grid` is a container which arranges its child widgets in rows and columns, but you do not need to specify the dimensions in the constructor. Children are added using :meth:`Gtk.Grid.attach`. They can span multiple rows or columns. It is also possible to add a child next to an existing child, using :meth:`Gtk.Grid.attach_next_to`.
it: :class:`Gtk.Grid` è un contenitore che organizza i suoi widget figli in righe e colonne, ma non richiede di specificare le dimensioni del costruttore. I widget figli vengono aggiunti utilizzando :meth:`Gtk.Grid.attach`. Possono estendersi su più righe o colonne. È anche possibile aggiungere un widget figlio accanto ad un altro esistente, utilizzando :meth:`Gtk.Grid.attach_next_to`.
ja: :class:`Gtk.Grid` は子ウィジェットを格子の中に配置することができるコンテナの一つですが、コンストラクタで格子の次元 (行数×列数) を指定する必要はありません。子ウィジェットは :meth:`Gtk.Grid.attach` メソッドを使って追加します。子ウィジェットを複数の行や列をまたいで配置することもできます。さらに :meth:`Gtk.Grid.attach_next_to` メソッドを使うと、位置を指定せずに既存のウィジェットを指定してその隣に子ウィジェットを配置することもできます。

source: :class:`Gtk.Grid` can be used like a :class:`Gtk.Box` by just using :meth:`Gtk.Grid.add`, which will place children next to each other in the direction determined by the "orientation" property (defaults to :attr:`Gtk.Orientation.HORIZONTAL`).
it: :class:`Gtk.Grid` può essere utilizzato come un :class:`Gtk.Box` se si utilizza :meth:`Gtk.Grid.add`, il quale porrà i widget figli uno accanto all'altro nella direzione determinata dalla proprietà "orientation" (valore predefinito a :attr:`Gtk.Orientation.HORIZONTAL`).
ja: :class:`Gtk.Grid` は :meth:`Gtk.Grid.add` メソッドを利用すると :class:`Gtk.Box` のように、"orientation" プロパティの値 (デフォルトは :attr:`Gtk.Orientation.HORIZONTAL`) によって決定される向きに子ウィジェットを並べていくことができます。

source: Grid Objects
ja: グリッドのオブジェクト

source: Creates a new grid widget.
ja: 新しいグリッドのオブジェクトを生成します。

source: Adds *child* to this grid.
ja: このグリッドに *child* を追加します。

source: The position of *child* is determined by the index of the cell left to it (*left*) and above of it (*top*). The number of 'cells' that *child* will occupy is determined by *width* and *height*.
ja: *child* の位置はその左側 (*left*) と上側 (*top*) のセルの番号で決まります。 *child* が占有するセルの個数は *width* と *height* で決まります。

source: Adds *child* to this grid, next to *sibling*. *side* is the side of *sibling* that *child* is positioned next to. It can be one of
ja: このグリッドの *sibling* の隣に *child* を追加します。 *side* は *child* を配置する *sibling* の側を、次のいづれかで指定します::

source: *width* and *height* determine the number of 'cells' that *child* will occupy.
ja: *child* が占有するセルの個数は *width* と *height* で決まります。

source: Adds *widget* to this grid in the direction determined by the "orientation" property.
ja: このグリッドで "orientation" のプロパティが指定した向きに *widget* を追加していきます。

source: Table
ja: テーブル

source: Tables allows us to place widgets in a grid similar to :class:`Gtk.Grid`.
ja: テーブルを使うと :class:`Gtk.Grid` に似た格子 (セル) 状のボックスの中にいろいろなウィジェットを配置できます。

source: The grid's dimensions need to be specified in the :class:`Gtk.Table` constructor. To place a widget into a box, use :meth:`Gtk.Table.attach`.
ja: 格子の次元 (行数×列数) は :class:`Gtk.Table` クラスのコンストラクタの中で指定する必要があります。そのボックスの中にウィジェットを一つ配置する時は :meth:`Gtk.Table.attach` メソッドを使用します。

source: :meth:`Gtk.Table.set_row_spacing` and :meth:`Gtk.Table.set_col_spacing` set the spacing between the rows at the specified row or column. Note that for columns, the space goes to the right of the column, and for rows, the space goes below the row.
ja: :meth:`Gtk.Table.set_row_spacing` と :meth:`Gtk.Table.set_col_spacing` といったメソッドは、指定した行または列にある行間または列間に挿入する余白の大きさを指定します。ここで、列間の場合の余白は列の右側に付与され、行間の場合の余白は行の下側に付与される点に注意して下さい。

source: You can also set a consistent spacing for all rows and/or columns with :meth:`Gtk.Table.set_row_spacings` and :meth:`Gtk.Table.set_col_spacings`. Note that with these calls, the last row and last column do not get any spacing.
ja: さらに :meth:`Gtk.Table.set_row_spacings` と :meth:`Gtk.Table.set_col_spacings` メソッドを使って全ての行または列の間に一定サイズの余白を挿入することもできます。その場合、最後の行と最後の列には余白が付与されない点に注意して下さい。

source: Table Objects
ja: テーブルのオブジェクト

source: The first argument is the number of rows to make in the table, while the second, obviously, is the number of columns. If *homogeneous* is ``True``, the table cells will all be the same size (the size of the largest widget in the table).
ja: 一番目の引数はテーブルの行数で、次の引数は、お分かりのとおり、テーブルの列数です。 *homogeneous* を ``True`` にすると、テーブルの中の格子が全て同じ大きさになります (テーブルの中で一番大きなウィジェットの大きさに合わせられます)。

source: Adds a widget to a table.
ja: 一個のウィジェットをテーブルの任意の場所に追加します。

source: *child* is the widget that should be added to the table. The number of 'cells' that a widget will occupy is specified by *left_attach*, *right_attach*, *top_attach* and *bottom_attach*. These each represent the leftmost, rightmost, uppermost and lowest column and row numbers of the table. (Columns and rows are indexed from zero).
ja: *child* はテーブルに追加するウィジェットです。任意のウィジェットが占有する「セル」の番号を *left_attach* と *right_attach* と *top_attach* と *bottom_attach* で指定します。これらはそれぞれテーブル上の左端、右端、上端、下端の列番号と行番号を表します (列番号と行番号は共に 0 から始まる整数値です)。

source: For example, if you want a button in the lower-right cell of a 2 x 2 table, and want it to occupy that cell only, then the code looks like the following.
ja: 例えば、2×2 の大きさを持つテーブルの右下隅にあるセルにボタンをパッキングし、そのセルだけ占有したい場合のコードは次のようになります

source: If, on the other hand, you wanted a widget to take up the entire top row of our 2 x 2 table, you'd use
ja: また、その一方でウィジェットを同じ 2×2 のテーブルの先頭行一杯にパッキングしたい場合のコードは次のようになります。

source: *xoptions* and *yoptions* are used to specify packing options and may be bitwise ORed together to allow multiple options. These options are:
ja: *xoptions* と *yoptions* はパッキング時のオプションを指定する際に使用します。複数のオプションをビット単位の論理和 (OR) を使って表現できます。利用可能なオプションは次のとおりです::

source: :attr:`Gtk.AttachOptions.EXPAND`: The widget should expand to take up any extra space in its container that has been allocated.
ja: :attr:`Gtk.AttachOptions.EXPAND`: ウィジェットは確保されたコンテナの中にある全ての領域を占有するために広がる

source: :attr:`Gtk.AttachOptions.FILL`: The widget will expand to use all the room available.
ja: :attr:`Gtk.AttachOptions.FILL`: ウィジェットは利用可能なセルを使うために広がる

source: :attr:`Gtk.AttachOptions.SHRINK`: Reduce size allocated to the widget to prevent it from moving off screen.
ja: :attr:`Gtk.AttachOptions.SHRINK`: ウィジェットが画面から消えてしまわないよう小さくする

source: If omitted, *xoptions* and *yoptions* defaults to ``Gtk.AttachOptions.EXPAND | Gtk.AttachOptions.FILL``.
ja: このオプションを省略すると *xoptions* と *yoptions* はデフォルトの ``Gtk.AttachOptions.EXPAND | Gtk.AttachOptions.FILL`` になります。

source: Finally, the padding arguments work just as they do for :meth:`Gtk.Box.pack_start`. If omitted, *xpadding* and *ypadding* defaults to ``0``.
ja: 最後の *xpadding* と *ypadding* は :meth:`Gtk.Box.pack_start` メソッドに渡す *padding* 引数と同じ働きをします。これらを省略すると *xpadding* と *ypadding* はデフォルト値の 0 になります。

source: Changes the space between a given table row and the subsequent row.
ja: 指定した *row* とその下の行との間隔を変更します。

source: Alters the amount of space between a given table column and the following column.
ja: 指定した *col* とその隣にある列との間隔を変更します。

source: Sets the space between every row in this table equal to *spacing*.
ja: このテーブルの中にある全ての行の間隔を *spacing* に変更します。

source: Sets the space between every column in this table equal to *spacing*.
ja: このテーブルの中にある全ての列の間隔を *spacing* に変更します。

source: GTK+ arranges widgets hierarchically, using *containers*. They are invisible to the end user and are inserted into a window, or placed within each other to layout components. There are two flavours of containers: single-child containers, which are all descendants of :class:`Gtk.Bin`, and multiple-child containers, which are descendants of :class:`Gtk.Container`. The most commonly used are vertical or horizontal boxes (:class:`Gtk.Box`) and grids (:class:`Gtk.Grid`).
it: GTK+ organizza i widget in maniera gerarchica, usando i *contenitori*. Essi sono invisibili all'utente finale e sono inseriti in una finestra, o collocati all'interno di altre per organizzare la visualizzazione. Ci sono due tipi di contenitori: contenitori single-child, che discendono tutti da :class:`Gtk.Bin`, e contenitori multiple-child, discendenti di :class:`Gtk.Container`. Quelli maggiormente utilizzati sono le caselle verticali o orizzontali (:class:`Gtk.Box`) e le griglie (:class:`Gtk.Grid`).

source: ListBox
it: Casella elenco

source: A :class:`Gtk.ListBox` is a vertical container that contains :class:`Gtk.ListBoxRow` children. These rows can by dynamically sorted and filtered, and headers can be added dynamically depending on the row content. It also allows keyboard and mouse navigation and selection like a typical list.
it: Un :class:`Gtk.ListBox` è un contenitore verticale che contiene come :class:` Gtk.ListBoxRow` figli. Queste righe possono essere dinamicamente ordinate e filtrate, e le intestazioni possono essere aggiunte dinamicamente a seconda del contenuto. Consente inoltre la navigazione da tastiera e mouse e le selezione come in un tipico elenco.

source: Using :class:`Gtk.ListBox` is often an alternative to :class:`Gtk.TreeView`, especially when the list contents has a more complicated layout than what is allowed by a :class:`Gtk.CellRenderer`, or when the contents is interactive (i.e. has a button in it).
it: L'utilizzo di :class:`Gtk.ListBox` è spesso un'alternativa a :class:`Gtk.TreeView`, soprattutto quando i contenuti della lista hanno un layout più complicato di quanto consentito da un: classe: `Gtk.CellRenderer`, o quando il contenuto è interattivo (in altri termini, ha un pulsante integrato).

source: Although a :class:`Gtk.ListBox` must have only :class:`Gtk.ListBoxRow` children you can add any kind of widget to it via :meth:`Gtk.Container.add`, and a :class:`Gtk.ListBoxRow` widget will automatically be inserted between the list and the widget.
it: Anche se un :class:`Gtk.ListBox` deve avere solo :class:`Gtk.ListBoxRow` figli è possibile aggiungere qualsiasi tipo di widget tramite :meth:`Gtk.Container.add`, e un widget :class:`Gtk.ListBoxRow` sarà automaticamente inserito tra la lista e il widget.

source: Stack and StackSwitcher
it: Stack e StackSwitcher

source: A :class:`Gtk.Stack` is a container which only shows one of its children at a time. In contrast to :class:`Gtk.Notebook`, :class:`Gtk.Stack` does not provide a means for users to change the visible child. Instead, the :class:`Gtk.StackSwitcher` widget can be used with :class:`Gtk.Stack` to provide this functionality.
it: Un :class:`Gtk.Stack` è un contenitore che mostra solo uno dei suoi figli alla volta. In contrasto con :class:`Gtk.Notebook`, :class:`Gtk.Stack` non fornisce agli utenti un mezzo per cambiare il widget figlio visibile. Invece, il widget :class:`Gtk.StackSwitcher` può essere utilizzato con :class:`Gtk.Stack` per fornire questa funzionalità.

source: Transitions between pages can be animated as slides or fades. This can be controlled with :meth:`Gtk.Stack.set_transition_type`. These animations respect the "gtk-enable-animations" setting.
it: Le transizioni tra le pagine possono essere animate come diapositive o dissolvenze. Ciò può essere controllato con :meth:`Gtk.Stack.set_transition_type`. Queste animazioni rispettano la relativa impostazione "gtk-enable-animations".

source: Transition speed can be adjusted with :meth:`Gtk.Stack.set_transition_duration`
it: La velocità di transizione può essere configurata con :meth:`Gtk.Stack.set_transition_duration`

source: The :class:`Gtk.StackSwitcher` widget acts as a controller for a :class:`Gtk.Stack`; it shows a row of buttons to switch between the various pages of the associated stack widget.
it: Il widget :class:`Gtk.StackSwitcher` agisce come controllore per un :class:`Gtk.Stack`; mostra una riga di pulsanti per passare tra le varie pagine del widget stack associato.

source: All the content for the buttons comes from the child properties of the :class:`Gtk.Stack`.
it: Tutti i contenuti per i pulsanti vengono dalle proprietà del figlio :class:`Gtk.Stack`.

source: It is possible to associate multiple :class:`Gtk.StackSwitcher` widgets with the same :class:`Gtk.Stack` widget.
it: E' possibile associare più widget :class:`Gtk.StackSwitcher` con il medesimo widget :class:`Gtk.Stack`.

source: HeaderBar
it: Barra di intestazione

source: A :class:`Gtk.HeaderBar` is similar to a horizontal :class:`Gtk.Box`, it allows to place children at the start or the end. In addition, it allows a title to be displayed. The title will be centered with respect to the width of the box, even if the children at either side take up different amounts of space.
it: Un :class:`Gtk.HeaderBar` è simile ad una casella orizzontale :class:`Gtk.Box`, permette di posizionare i figli all'inizio o alla fine. Inoltre, permette la visualizzazione di un titolo. Quest'ultimo sarà centrato rispetto alla larghezza della casella, anche se i figli ai lati occupano differenti quantità di spazio.

source: Since GTK+ now supports Client Side Decoration, a :class:`Gtk.HeaderBar` can be used in place of the title bar (which is rendered by the Window Manager).
it: Dal momento che GTK+ ora supporta decorazioni lato client (Client Side Decoration), una :class:`Gtk.HeaderBar` può essere utilizzata al posto della barra del titolo (che è mostrata dal Window Manager).
