Repository: sebp/PyGObject-Tutorial
Catalog: translations/locale/*/LC_MESSAGES/layout.po
Languages: it, ja

source: A :class:`Gtk.HeaderBar` is usually located across the top of a window and should contain commonly used controls which affect the content below. They also provide access to window controls, including the close window button and window menu.
it: Un :class:`Gtk.HeaderBar` si trova di solito nella parte superiore di una finestra e dovrebbe contenere comandi di uso comune che influenzano il contenuto sottostante. Forniscono anche l'accesso ai controlli delle finestre, compreso il pulsante per la chiusura della finestra.

source: FlowBox
it: Caselle di scorrimento

source: A :class:`Gtk.FlowBox` is a container that positions child widgets in sequence according to its orientation.
it: Un :class:`Gtk.FlowBox` è un contenitore che posiziona i widget figli in sequenza a seconda dell'orientamento.

source: For instance, with the horizontal orientation, the widgets will be arranged from left to right, starting a new row under the previous row when necessary. Reducing the width in this case will require more rows, so a larger height will be requested.
it: Ad esempio, con l'orientamento orizzontale, i widget saranno disposti da sinistra a destra, iniziando una nuova riga sotto la riga precedente quando necessario. Ridurre la larghezza in questo caso richiede più righe, quindi sarà richiesta una maggiore altezza.

source: Likewise, with the vertical orientation, the widgets will be arranged from top to bottom, starting a new column to the right when necessary. Reducing the height will require more columns, so a larger width will be requested.
it: Allo stesso modo, con l'orientamento verticale, i widget saranno disposti dall'alto al basso, a partire da una nuova colonna a destra quando necessario. Se si riduce l'altezza saranno richieste più colonne, quindi sarà richiesta una maggiore larghezza.

source: The children of a :class:`Gtk.FlowBox` can be dynamically sorted and filtered.
it: I figli di un :class:`Gtk.FlowBox` possono essere ordinati e filtrati in maniera dinamica.

source: Although a :class:`Gtk.FlowBox` must have only :class:`Gtk.FlowBoxChild` children, you can add any kind of widget to it via :meth:`Gtk.Container.add`, and a :class:`Gtk.FlowBoxChild` widget will automatically be inserted between the box and the widget.
it: Anche se un :class:`Gtk.FlowBox` deve avere solo :class:`Gtk.FlowBoxChild` figli, è possibile aggiungere qualsiasi tipo di widget tramite :meth:`Gtk.Container.add` e un widget :class:`Gtk.FlowBoxChild` sarà automaticamente inserito tra la casella e il widget.

source: The :class:`Gtk.Notebook` widget is a :class:`Gtk.Container` whose children are pages that can be switched between using tab labels along one edge.
it: Un widget :class:`Gtk.Notebook` è un :class:`Gtk.Container` i cui figli sono pagine che possono essere commutate utilizzando etichette su un bordo.

source: There are many configuration options for GtkNotebook. Among other things, you can choose on which edge the tabs appear (see :meth:`Gtk.Notebook.set_tab_pos`), whether, if there are too many tabs to fit the notebook should be made bigger or scrolling arrows added (see :meth:`Gtk.Notebook.set_scrollable`, and whether there will be a popup menu allowing the users to switch pages (see :meth:`Gtk.Notebook.popup_enable`, :meth:`Gtk.Notebook.popup_disable`).
it: Molte configurazioni per GtkNotebook. Tra le tante, è possibile scegliere il bordo dove visualizzare le etichette (vedi :meth:`Gtk.Notebook.set_tab_pos`), se è necessario allargare il notebook o aggiungere frecce di scorrimento con troppe schede (vedi :meth:`Gtk.Notebook.set_scrollable`, e se ci sarà un menu a comparsa affinché gli utenti possano cambiare pagina (vedi :meth:`Gtk.Notebook.popup_enable`, :meth:`Gtk.Notebook.popup_disable`).
