Repository: sebp/PyGObject-Tutorial
Catalog: translations/locale/*/LC_MESSAGES/objects.po
Languages: it, ja

source: This section will introduce some important aspects about the GObject implementation in python.
ja: このセクションでは Python における GObject の実装について重要な部分をいくつか紹介します。

source: A native GObject is accessible via :class:`GObject.GObject`. It is rarely intanciated directly, we generally use inherited class. A :class:`Gtk.Widget` is an inherited class of a :class:`GObject.GObject`. It may be interesting to make an inherited class to create a new widget, like a settings dialog.
ja: 素の GObject には :class:`GObject.GObject` からアクセスできます。但し、この型から直接インスタンスを生成することはめったになく、一般的にはこの型から派生したクラスを使用します。例えば :class:`Gtk.Widget` は :class:`GObject.GObject` から派生したクラスの一つです。どちらかというとアプリを実装するよりも、設定ダイアログといった新しいウィジェットを生成するような派生クラスを作る方が面白いかもしれません。

source: :const:`GObject.SIGNAL_RUN_FIRST` indicates ths signal will invoke the object method handler (:meth:`do_my_signal` here) in the first emission stage. Alternatives are :const:`GObject.SIGNAL_RUN_LAST` (the method handler will be invoked in the third emission stage) and :const:`GObject.SIGNAL_RUN_CLEANUP` (invoke the method handler in the last emission stage).
ja: ディクショナリの値として最初に渡している :const:`GObject.SIGNAL_RUN_FIRST` は、このシグナル発行の第一ステージにオブジェクトのメソッド・ハンドラ (上の例だと :meth:`do_my_signal`) を呼び出すという意味です。それ以外には, :const:`GObject.SIGNAL_RUN_LAST` (シグナル発行の第三ステージにメソッド・ハンドラを呼び出す) や :const:`GObject.SIGNAL_RUN_CLEANUP` (シグナル発行の最後のステージにメソッド・ハンドラを呼び出す) を指定できます。

source: One of GObject's nice features is its generic get/set mechanism for object properties. Each class inherited from :class:`GObject.GObject` can define new properties. Each property as a type which never changes (e.g. str, float, int...). For instance, they are used for :class:`Gtk.Button` where there is a "label" property which contains the text of the button.
ja: GObject が提供してくれる素晴らしい機能の一つに、オブジェクトが持つプロパティにアクセスするための汎用的な set/get アクセッサのメカニズムがあります。 :class:`GObject.GObject` から派生したクラスはそれぞれ新しいプロパティを定義できます。プロパティの型は変更できません (例: str, float, int...)。 例えば、プロパティの型は (ボタンに表示する文字列を格納した) "label" プロパティを持つ :class:`Gtk.Button` で使用されます。

source: A property is defined with a name and a type. Even is python itself is dynamically typed, you can't change the type of a property once it is defined. A property can be created using :func:`GObject.property`.
ja: 一個のプロパティは一個の名前と一個の型で定義されます。Python 自身が動的な型づけを行っているため、一度プロパティを定義したらその型は変更できません。プロパティは :func:`GObject.property` を使って作成します。

source: Properties can also be readonly, if you want some properties to be readable but not writable. To do so, you can add some flags to the property definition, to control read/write access. Flags are :const:`GObject.PARAM_READABLE` (only read access for external code), :const:`GObject.PARAM_WRITABLE` (only write access), :const:`GObject.PARAM_READWRITE` (public):
ja: さらに読み込みは可能だが書き込みできないプロパティが欲しいといった場合、読み込み専用のプロパティにする機能もあります。そのような場合、いくつかのフラグをプロパティの定義に追加して、読み込みまたは書き込みのアクセスを制御できます。指定できるフラグには :const:`GObject.PARAM_READABLE` (外部からのアクセスは読み込みだけ), :const:`GObject.PARAM_WRITABLE` (書き込みだけ), :const:`GObject.PARAM_READWRITE` (読み書き可) があります:

source: You can also define new read-only properties with a new method decorated with :func:`GObject.property`:
ja: さらに :func:`GObject.property` で修飾された新しいメソッドを使って読み込み専用のプロパティを定義することも可能です:

source: When a property is modified, a signal is emitted, whose name is "notify::property_name":
ja: プロパティが変更されると、"``notify::property_name``" というシグナルが自動的に発行されます:
