Repository: sebp/PyGObject-Tutorial
Catalog: translations/locale/*/LC_MESSAGES/objects.po
Languages: it, ja

source: Objects
it: Gli oggetti
ja: オブジェクト

source: GObject is the fundamental type providing the common attributes and methods for all object types in GTK+, Pango and other libraries based on GObject. The :class:`GObject.GObject` class provides methods for object construction and destruction, property access methods, and signal support.
it: GObject è il tipo fondamentale che fornisce gli attributi e i metodi comuni per tutti i tipi di oggetto in GTK+, Pango e le altre librerie basate su GObject. La classe :class:`GObject.GObject` fornisce i metodi per la costruzione di un oggetto e la relativa distruzione, metodi di accesso alle proprietà e il supporto al segnale.
ja: GObject は GTK+ にある全てのオブジェクト型に共通な属性とメソッドを提供する基本型であり、Pango とその他のライブラリはこの GObject が基になっています。 :class:`GObject.GObject` というクラスがオブジェクトを生成したり破棄するメソッドやプロパティにアクセスするメソッド、シグナルのサポートを提供しています。

source: This section will introduce some important aspects about the GObject implementation in Python.
it: Questa sezione introdurrà alcuni aspetti importanti relativi all'implementazione di GObject in Python.

source: Inherit from GObject.GObject
it: Ereditare da GObject.GObject
ja: GObject.GObject から派生させる

source: A native GObject is accessible via :class:`GObject.GObject`. It is rarely instantiated directly, we generally use inherited class. A :class:`Gtk.Widget` is an inherited class of a :class:`GObject.GObject`. It may be interesting to make an inherited class to create a new widget, like a settings dialog.
it: Un GObject nativo è accessibile tramite :class:`GObject.GObject`. Viene raramente istanziato direttamente, di solito si usa una classe ereditata. :classe:`Gtk.Widget` è una classe ereditata di :class:`GObject.GObject`. Può essere interessante realizzare una classe ereditata per creare un nuovo widget, come una finestra delle impostazioni.

source: To inherit from :class:`GObject.GObject`, you must call :meth:`GObject.GObject.__init__` in your constructor (if the class inherits from :class:`Gtk.Button`, it must call :func:`Gtk.Button.__init__` for instance), like in the example below:
it: Per ereditare da un :class:`GObject.GObject`, è necessario chiamare :meth:`GObject.GObject .__ init__` nel costruttore (se la classe eredita da :class:`Gtk.Button` si deve chiamare :func:`Gtk.Button .__ init__`) ,come mostrato di seguito:
ja: :class:`GObject.GObject` から派生させるには、次の例のように、自分のクラスのコンストラクタで :meth:`GObject.GObject.__init__` を呼び出して下さい (もし自分のクラスが :class:`Gtk.Button` といったクラスから派生しているのであれば, :func:`Gtk.Button.__init__` を呼び出して下さい):

source: Signals
it: Segnali
ja: いろいろなシグナル

source: Signals connect arbitrary application-specific events with any number of listeners. For example, in GTK+, every user event (keystroke or mouse move) is received from the X server and generates a GTK+ event under the form of a signal emission on a given object instance.
it: I segnali collegano arbitrari eventi specifici per l'applicazione con un indefinito numero di ascoltatori. Per esempio, in GTK+, ogni evento generato da un utente (tasto o movimento del mouse) viene ricevuto dal server X e genera un evento GTK+ sotto forma di una emissione di segnale su una determinata istanza di oggetto.
ja: シグナルはアプリケーション専用の任意のイベントに、それを受け取る側の番号を使って接続します。GTK+ の場合、ユーザ・イベント (例えばキー押下やマウスを移動するイベントなど) をＸサーバから受け取る度に、指定したオブジェクトのインスタンス上でシグナル発行規則に従ったGTK+ のイベントを生成します。

source: Each signal is registered in the type system together with the type on which it can be emitted: users of the type are said to connect to the signal on a given type instance when they register a function to be invoked upon the signal emission. Users can also emit the signal by themselves or stop the emission of the signal from within one of the functions connected to the signal.
it: Ogni segnale è registrato nel sistema insieme al tipo dal quale può essere emesso: gli utenti del tipo si collegano al segnale su una determinata istanza del tipo quando registrano una funzione da richiamare con l'emissione del segnale. Gli utenti possono anche emettere il segnale da soli o interrompere l'emissione del segnale all'interno di una delle funzioni connesse allo stesso.
ja: 各シグナルは、それを発行することができる型と共に GObject の型システムに登録されます (その型を利用する側では、シグナルが発行されると呼び出されるコールバック関数を登録する時に、指定した型のインスタンスに対して「シグナルを接続する」といいます)。さらに型を利用する側は自分自身でシグナルを発行したり、そのシグナルに接続している関数の中からシグナルの発行を停止することもできます。

source: Receive signals
it: Ricevere segnali
ja: シグナルを受信する

source: See :ref:`signals`
it: Vedi :ref:`segnali`
ja: :ref:`signals` を参照して下さい。

source: Create new signals
it: Creare nuovi segnali
ja: 新しいシグナルを作成する

source: New signals can be created by adding them to :attr:`GObject.GObject.__gsignals__`, a dictionary:
it: Nuovi segnali possono essere creati aggiungendoli a :attr:`GObject.GObject .__ gsignals__`, un dizionario:
ja: 新しいシグナルは、それを :attr:`GObject.GObject.__gsignals__` というディクショナリに追加することで作成できます。

source: When a new signal is created, a method handler can also be defined, it will be called each time the signal is emitted. It is called do_signal_name.
it: Quando un nuovo segnale è creato - anche un gestore di metodo può essere definito - verrà chiamato ogni volta che il segnale sarà emesso. Si chiamerà do_signal_name.
ja: 新しいシグナルを作成する際は、任意のメソッド・ハンドラも一緒に定義できます (このハンドラはシグナルが発行される度に呼び出されます)。そのハンドラは ``do_シグナル名`` にして下さい:

source: :const:`GObject.SIGNAL_RUN_FIRST` indicates that this signal will invoke the object method handler (:meth:`do_my_signal` here) in the first emission stage. Alternatives are :const:`GObject.SIGNAL_RUN_LAST` (the method handler will be invoked in the third emission stage) and :const:`GObject.SIGNAL_RUN_CLEANUP` (invoke the method handler in the last emission stage).
it: :const:`GObject.SIGNAL_RUN_FIRST` indica un segnale che invocherà il gestore del metodo per l'oggetto (:meth:`do_my_signal` qui) nella prima fase di emissione. Le alternative sono :const:`GObject.SIGNAL_RUN_LAST` (il gestore del metodo verrà richiamato nella terza fase di emissione) e :const:`GObject.SIGNAL_RUN_CLEANUP` (richiamare il gestore del metodo nella fase ultima di emissione).

source: The second part, ``None``, indicates the return type of the signal, usually ``None``.
it: La seconda parte, ``None``, indica il tipo restituito dal segnale, di solito ``None``.
ja: 同様に二番目に渡している値の ``None`` はシグナルの返り値の型ですが、通常は ``None`` にして下さい。

source: ``(int,)`` indicates the signal arguments, here, the signal will only take one argument, whose type is int. This argument type list must end with a comma.
it: ``(int,)`` indica gli argomenti del segnale, qui, il segnale prenderà solo un argomento, il cui tipo è int. Questo elenco di tipi relativi agli argomenti deve terminare con una virgola.
ja: 同様に最後に渡している値の ``(int,)`` はシグナルが受け取る引数を表しており、上の例だとシグナルは一個だけ引数を受け取り、その型は int になります。ここで渡すことができるいろいろな引数の型はタプルに格納し、その終端はカンマ (,) にして下さい。

source: Signals can be emitted using :meth:`GObject.GObject.emit`:
it: I segnali possono essere emessi usando :meth:`GObject.GObject.emit`:
ja: シグナルは :meth:`GObject.GObject.emit` を使って発行します:

source: Properties
it: Proprietà
ja: いろいろなプロパティ

source: One of GObject's nice features is its generic get/set mechanism for object properties. Each class inherited from :class:`GObject.GObject` can define new properties. Each property has a type which never changes (e.g. str, float, int...). For instance, they are used for :class:`Gtk.Button` where there is a "label" property which contains the text of the button.
it: Una delle caratteristiche interessanti di GObject è il suo meccanismo di get/set per la proprietà dell'oggetto. Ogni classe ereditata da :class:`GObject.GObject` può definire nuove proprietà. Ogni proprietà ha un tipo che non cambierà mai (es. str, float, int ...). Per esempio, sono usate con :class:`Gtk.Button` dove c'è una proprietà "label" che contiene il testo del pulsante.

source: Use existing properties
it: Utilizzare le proprietà esistenti
ja: 既存のプロパティを使用する

source: The class :class:`GObject.GObject` provides several useful functions to manage existing properties, :func:`GObject.GObject.get_property` and :func:`GObject.GObject.set_property`.
it: La classe :class:`GObject.GObject` fornisce diverse funzioni utili per gestire le proprietà esistenti, :func:`GObject.GObject.get_property` e :func:`GObject.GObject.set_property`.
ja: :class:`GObject.GObject` クラスは既存のプロパティを管理するための便利なメソッドをいくつか提供しています。例えば :func:`GObject.GObject.get_property` と :func:`GObject.GObject.set_property` です。

source: Some properties also have functions dedicated to them, called getter and setter. For the property "label" of a button, there are two functions to get and set them, :func:`Gtk.Button.get_label` and :func:`Gtk.Button.set_label`.
it: Alcune proprietà hanno anche funzioni dedicate a loro, chiamati getter e setter. Per la proprietà "label" di un pulsante, ci sono due funzioni per ottenere e impostare, :func:`Gtk.Button.get_label` e :func:`Gtk.Button.set_label`.
ja: さらにプロパティの中には自分自身にアクセスするためのメソッド、すなわち getter と setter 呼ばれる関数を用意しているものもあります。例えばボタンの "label" というプロパティには、このラベルのデータを取得したり指定するための関数として :func:`Gtk.Button.get_label` と :func:`Gtk.Button.set_label` があります。

source: Create new properties
it: Crea nuove proprietà
ja: 新しいプロパティを作成する

source: A property is defined with a name and a type. Even if Python itself is dynamically typed, you can't change the type of a property once it is defined. A property can be created using :class:`GObject.Property`.
it: Una proprietà è definita con un nome e un tipo. Anche se lo stesso Python è tipizzato dinamicamente, non è possibile modificare il tipo di una proprietà una volta definito. Una proprietà può essere creata utilizzando :func:`GObject.property`.

source: Properties can also be read-only, if you want some properties to be readable but not writable. To do so, you can add some flags to the property definition, to control read/write access. Flags are :const:`GObject.PARAM_READABLE` (only read access for external code), :const:`GObject.PARAM_WRITABLE` (only write access), :const:`GObject.PARAM_READWRITE` (public):
it: Le proprietà possono anche essere di sola lettura, se si desidera che alcuni oggetti siano leggibili ma non modificabili. Per fare ciò, è possibile aggiungere alcuni flag alla definizione di proprietà, per controllare l'accesso in lettura / scrittura. I flag sono :const:`GObject.PARAM_READABLE` (accesso in sola lettura per il codice esterno), :const:`GObject.PARAM_WRITABLE` (solo accesso in scrittura), :const:`GObject.PARAM_READWRITE` (pubblico):

source: You can also define new read-only properties with a new method decorated with :class:`GObject.Property`:
it: È inoltre possibile definire nuove proprietà in sola lettura con un nuovo metodo e :func:`GObject.property`:

source: You can get this property using:
it: È possibile ottenere questo struttura tramite:
ja: このプロパティは次のようにして取得します:

source: The API of :class:`GObject.Property` is similar to the builtin :py:func:`property`. You can create property setter in a way similar to Python property:
it: L'API di :class:`GObject.Property` è simile alla proprietà interna :py:func:`. È possibile creare un setter di proprietà in un modo simile a Python:

source: There is also a way to define minimum and maximum values for numbers, using a more verbose form:
it: Vi è anche un modo per definire i valori minimi e massimi per i numeri, utilizzando una forma più dettagliata:
ja: また、もっと冗長な書式でプロパティの数値の最小値と最大値を定義する方法もあります:

source: Properties must be defined in :attr:`GObject.GObject.__gproperties__`, a dictionary, and handled in do_get_property and do_set_property.
it: Le proprietà devono essere definite in :attr:`GObject.GObject .__ gproperties__`, un dizionario gestito in do_get_property e do_set_property.
ja: プロパティは :attr:`GObject.GObject.__gproperties__` というディクショナリの中に定義し ``do_get_property()`` と ``do_set_property()`` というメソッドの中で処理するようにして下さい。

source: Watch properties
it: Proprietà Watch
ja: プロパティを監視する

source: When a property is modified, a signal is emitted, whose name is "notify::property-name":
it: Quando una proprietà viene modificata, si emette un segnale il cui nome sarà "notify::property_name":

source: Note that you have to use the canonical property name when connecting to the notify signals, as explained in :func:`GObject.Object.signals.notify`. For instance, for a Python property `foo_bar_baz` you would connect to the signal `notify::foo-bar-baz` using
it: Si noti che è necessario utilizzare il nome della proprietà durante il collegamento ai segnali di notifica, come spiegato in :func:`GObject.Object.signals.notify`. Per esempio, per una proprietà Python `foo_bar_baz` ci si può collegare al segnale `notify::foo-bar-baz` usando

source: Retrieves a property value.
it: Estrae un valore dalla proprietà.
ja: プロパティの値を取得します。

source: Set property *property_name* to *value*.
it: Imposta *property_name* a *value*.
ja: *property_name* の名前を持つプロパティの値を *value* にします。

source: Emit signal *signal_name*. Signal arguments must follow, e.g. if your signal is of type ``(int,)``, it must be emitted with::
it: Emette il segnale *signal_name*. Gli argomenti del segnale devono seguire, es. se il segnale è di tipo ``(int,)``, dev'essere emesso con::
ja: *signal_name* というシグナルを発行します。シグナルの引数は次の規則に従って下さい: 例えば ``(int,)`` 型の引数を受け取る場合、次のような書式で発行する::

source: This method freezes all the "notify::" signals (which are emitted when any property is changed) until the :meth:`thaw_notify` method is called.
it: Questo metodo blocca tutti i segnali "notify::" segnali (che vengono emessi quando ogni proprietà viene modificata) finché il metodo :meth:`thaw_notify` viene chiamato.
ja: このメソッドは (プロパティが変更されると発行される) "notify::" 系のシグナルを :meth:`GObject.GObject.thaw_notify` メソッドが呼び出されるまで全て凍結します。

source: It recommended to use the *with* statement when calling :meth:`freeze_notify`, that way it is ensured that :meth:`thaw_notify` is called implicitly at the end of the block::
it: Si consiglia di utilizzare lo statement *with* quando si chiama :meth:`freeze_notify`, in questo modo si garantisce che :meth:`thaw_notify` è chiamato implicitamente alla fine del blocco::
ja: :meth:`GObject.GObject.freeze_notify` メソッドを呼び出す際に、ブロックの最後で暗黙的に :meth:`GObject.GObject.thaw_notify` を呼び出すようなコードと「一緒に」使用することをお薦めします。

source: Thaw all the "notify::" signals which were thawed by :meth:`freeze_notify`.
it: Sblocca tutti i segnali "notify::" che erano stati bloccati da :meth:`freeze_notify`.
ja: :meth:`GObject.GObject.freeze_notify` によって発行が凍結されていた全ての "notify::" シグナルを再び発行できるようにします。

source: It is recommended to not call :meth:`thaw_notify` explicitly but use :meth:`freeze_notify` together with the *with* statement.
it: Si raccomanda di non chiamare :meth:`thaw_notify` esplicitamente ma usare :meth:`freeze_notify` insieme allo statement *with*.
ja: 明示的な :meth:`GObject.GObject.thaw_notify` の呼び出しは推奨していませんが、使用する時は :meth:`GObject.GObject.freeze_notify` を呼び出した回数と同じだけ呼び出して下さい。

source: Blocks a handler of an instance so it will not be called during any signal emissions unless :meth:`handler_unblock` is called for that *handler_id*. Thus "blocking" a signal handler means to temporarily deactivate it, a signal handler has to be unblocked exactly the same amount of times it has been blocked before to become active again.
it: Bloccare un gestore di una istanza così non sarà chiamato durante qualsiasi emissione di segnale finché :meth:`handler_unblock` è chiamato per quel *handler_id*. Così "bloccando" un gestore di segnale significa temporaneamente disattivarlo, un gestore di segnale deve essere sbloccato esattamente tante volte quanti sono i blocchi per riattivarlo nuovamente.
ja: インスタンス上でシグナル・ハンドラの呼び出しをブロックするので、 :meth:`GObject.GObject.handler_unblock` がその *handler_id* に対して呼び出されるまで、全てのシグナルのハンドラは呼び出されなくなります。このように「ブロック中」のシグナル・ハンドラは一時的にハンドラの呼び出しを無効にするので、再び有効にするにはブロックした回数と同じ回数だけ実際にブロックを解除する必要があります。

source: It is recommended to use :meth:`handler_block` in conjunction with the *with* statement which will call :meth:`handler_unblock` implicitly at the end of the block::
it: Si raccomanda di usare :meth:`handler_block` in congiunzione con lo statement *with* che chiamerà :meth:`handler_unblock` implicitamente alla fine del blocco::
ja: ブロックの最後で明示的に :meth:`GObject.GObject.handler_unblock` を呼び出すようなコードと「一緒に」 :meth:`GObject.GObject.handler_block` を呼び出すことを推奨します。

source: Undoes the effect of :meth:`handler_block`. A blocked handler is skipped during signal emissions and will not be invoked until it has been unblocked exactly the amount of times it has been blocked before.
it: Annulla l'effetto di :meth:`handler_block`. Un gestore bloccato viene saltato durante le emissioni di segnale e non verrà richiamato fino a quando non è stato sbloccato esattamente quante volte è stato bloccato prima.
ja: :meth:`handler_block` を呼び出す前の状態に戻します。シグナルが発行されている間、ブロックされていたハンドラの呼び出しはスキップされ、ブロックした回数を同じだけブロックを解除するまで呼び出されません。

source: It is recommended to not call :meth:`handler_unblock` explicitly but use :meth:`handler_block` together with the *with* statement.
it: Si raccomanda di non chiamare :meth:`handler_unblock` esplicitamente ma usare :meth:`handler_block` insieme allo statement *with*.
ja: 明示的な :meth:`GObject.GObject.handler_unblock` の呼び出しは推奨していませんが、使用する時は :meth:`GObject.GObject.handler_block` を呼び出した回数と同じだけ呼び出して下さい。

source: A dictionary where inherited class can define new signals.
it: Un dizionario dove la classe ereditata può definire nuovi segnali.
ja: 派生したクラスが新しいシグナルを定義することができるディクショナリです。

source: Each element in the dictionary is a new signal. The key is the signal name. The value is a tuple, with the form::
it: Ogni elemento nel dizionario è un nuovo segnale. La chiave è il nome del segnale. Il valore è una tupla con la forma ::
ja: ディクショナリの要素はそれぞれ新しいシグナルです。ディクショナリのキーがシグナルの名前になります。ディクショナリの値は一個のタプルで、次のような形式になります::

source: :const:`GObject.SIGNAL_RUN_FIRST` can be replaced with :const:`GObject.SIGNAL_RUN_LAST` or :const:`GObject.SIGNAL_RUN_CLEANUP`. ``None`` is the return type of the signal. ``(int,)`` is the list of the parameters of the signal, it must end with a comma.
it: :const:`GObject.SIGNAL_RUN_FIRST` può essere sostituito con :const:`GObject.SIGNAL_RUN_LAST` o :const:`GObject.SIGNAL_RUN_CLEANUP`. ``None`` è il tipo restituito dal segnale. ``(int,) `` è la lista dei parametri del segnale e deve terminare con una virgola.
ja: :const:`GObject.SIGNAL_RUN_FIRST` は :const:`GObject.SIGNAL_RUN_LAST` または :const:`GObject.SIGNAL_RUN_CLEANUP` で置き換えることが可能です。 ``None`` はシグナルの返り値の型です。 ``(int,)`` はシグナルの引数を要素とするリストで、終端はカンマにして下さい。

source: The :attr:`__gproperties__` dictionary is a class property where you define the properties of your object. This is not the recommend way to define new properties, the method written above is much less verbose. The benefits of this method is that a property can be defined with more settings, like the minimum or the maximum for numbers.
it: Il dizionario :attr:`__gproperties__` è una proprietà di classe in cui si definiscono le proprietà del vostro oggetto. Questo non è il modo raccomandato per definire nuove proprietà, il metodo scritto sopra è molto meno dettagliato. I vantaggi di quest'ultimo sono che una proprietà può essere definita con più impostazioni, come il minimo o il massimo per i numeri.
ja: :attr:`__gproperties__` というディクショナリは、オブジェクトが持ついろいろなプロパティを格納しているクラス・プロパティです。これは新しいプロパティを定義する方法としては推奨していない方法であり、上記の例はそれほど冗長なものではありません。このメソッドの利点は、プロパティをたくさんの設定値と一緒に定義できることです (例えば数値の最大値や最小値も一緒に定義する場合)。

source: The key is the name of the property
it: La chiave è il nome della proprietà
ja: このディクショナリのキーはプロパティの名前です。

source: The value is a tuple which describe the property. The number of elements of this tuple depends on its first element but the tuple will always contain at least the following items:
it: Il valore è una tupla che descrive la proprietà. Il numero di elementi di questa tupla dipende dal suo primo elemento, ma la tupla conterrà sempre almeno i seguenti elementi:
ja: このディクショナリの値はプロパティの詳細を記述した一個のタプルです。このタプルの要素の数は一番先頭のプロパティに依存しますが、少なくとも次のようなアイテムが常に含まれています:

source: The first element is the property's type (e.g. ``int``, ``float``...).
it: Il primo elemento è il tipo di proprietà (es. ``int``, ``float``...).
ja: 最初の要素はプロパティの型 (例 ``int``, ``float``...) です。

source: The second element is the property's nick name, which is a string with a short description of the property. This is generally used by programs with strong introspection capabilities, like the graphical user interface builder `Glade`_.
it: Il secondo elemento è il nome nick della proprietà, che è una stringa con una breve descrizione della stessa. Questo è generalmente utilizzato da programmi con forti capacità di introspezione, come il costruttore di interfacce grafiche `Glade`_.
ja: 二番目の要素はプロパティのニックネームで、プロパティの内容を短く説明した文字列です。この要素は通常は強力なイントロスペクションの機能を持ったプログラム (例えばグラフィカル・ユーザ・インタフェース・ビルダの `Glade <http://glade.gnome.org/>`_) が利用します。

source: The third one is the property's description or blurb, which is another string with a longer description of the property. Also used by `Glade`_ and similar programs.
it: Il terzo è la descrizione della proprietà o blurb, che è un'altra stringa con una descrizione più lunga della proprietà. Anch'esso usato da `Glade`_ e programmi simili.
ja: 三番目の要素はプロパティの説明または内容紹介で、プロパティの内容を長い文字列で記述したものです。これも `Glade <http://glade.gnome.org/>`_ やそれに類するプログラムが使用します。

source: The last one (which is not necessarily the forth one as we will see later) is the property's flags: :const:`GObject.PARAM_READABLE`, :const:`GObject.PARAM_WRITABLE`, :const:`GObject.PARAM_READWRITE`.
it: L'ultimo (che non è necessariamente il quarto come vedremo in seguito) è il flag della proprietà: :const:`GObject.PARAM_READABLE`, :const:`GObject.PARAM_WRITABLE`, :const:`GObject.PARAM_READWRITE`.
ja: 最後の要素はプロパティのフラグです (これ以降の要素は後述します): :const:`GObject.PARAM_READABLE`, :const:`GObject.PARAM_WRITABLE`, :const:`GObject.PARAM_READWRITE`

source: The absolute length of the tuple depends on the property type (the first element of the tuple). Thus we have the following situations:
it: La lunghezza assoluta della tupla dipende dal tipo di proprietà (il primo elemento della tupla). Così abbiamo le seguenti situazioni:
ja: タプルの長さはプロパティの型 (このタプルの先頭の要素) に依存します。そのため次のような状態が考えられます:

source: If the type is ``bool`` or ``str``, the forth element is the default value of the property.
it: Se il tipo è ``bool`` o ``str``, il quarto elemento è il valore predefinito della proprietà.
ja: プロパティの型が ``bool`` または ``str`` の場合、四番目の要素はプロパティのデフォルト値になります。

source: If the type is ``int`` or ``float``, the forth element is the minimum accepted value, the fifth element is the maximum accepted value and the sixth element is the default value.
it: Se il tipo è ``int`` o ``float``, il quarto elemento è il valore minimo accettato, il quinto elemento è il valore massimo accettato e il sesto elemento è il valore predefinito.
ja: プロパティの型が ``int`` または ``float`` の場合、四番目の要素は最小値を、五番目の要素は最大値を、そして六番目の要素はデフォルト値をそれぞれ表します。

source: If the type is not one of these, there is no extra element.
it: Se il tipo non è uno di questi, non c'è alcun elemento aggiuntivo.
ja: プロパティの型がそれ以外の場合、追加の要素はありません。

source: Invoke the object method handler in the first emission stage.
it: Richiama il gestore del metodo per l'oggetto nella prima fase di emissione.
ja: 一番最初のシグナル発行ステージでハンドラを呼び出します。

source: Invoke the object method handler in the third emission stage.
it: Richiama il gestore del metodo per l'oggetto nella terza fase di emissione.
ja: 三番目のシグナル発行ステージでハンドラを呼び出します。

source: Invoke the object method handler in the last emission stage.
it: Richiama il gestore del metodo oggetto nell'ultima fase di emissione.
ja: 最後のシグナル発行ステージでハンドラを呼び出します。

source: The property is readable.
it: La proprietà è leggibile.
ja: プロパティは読み込み専用です。

source: The property is writable.
it: La proprietà è modificabile.
ja: プロパティは書き込み専用です。

source: The property is readable and writable.
it: La proprietà è leggibile e modificabile.
ja: プロパティは読み込みと書き込みが可能です。
