Repository: sebp/PyGObject-Tutorial
Catalog: translations/locale/*/LC_MESSAGES/unicode.po
Languages: it, ja

source: How to Deal With Strings
it: Come gestire le stringhe
ja: 文字列の取り扱い

source: This section explains how strings are represented in Python 2.x, Python 3.x and GTK+ and discusses common errors that arise when working with strings.
it: Questa sezione spiega come le stringhe sono rappresentate in Python 2.x, Python 3.x e GTK+ e discute i principali errori che si riscontrano quando si lavora con le stringhe.
ja: このセクションでは Python の 2 系と 3 系、そして GTK+ における文字列 (型) の表現方法について説明し、文字列を使った処理で遭遇する一般的なエラーについて考察します。

source: Definitions
it: Definizioni
ja: 定義

source: Conceptionally, a string is a list of characters such as 'A', 'B', 'C' or 'É'. **Characters** are abstract representations and their meaning depends on the language and context they are used in. The Unicode standard describes how characters are represented by **code points**. For example the characters above are represented with the code points U+0041, U+0042, U+0043, and U+00C9, respectively. Basically, code points are numbers in the range from 0 to 0x10FFFF.
it: Concettualmente, una stringa è un elenco di caratteri come 'A', 'B', 'C' o 'É'. I *caratteri* sono rappresentazioni astratte e il loro significato dipende dal linguaggio e dal contesto in cui vengono utilizzati. Lo standard Unicode descrive come i caratteri sono rappresentati da **code point**. Per esempio i caratteri precedenti sono rappresentati rispettivamente dai code point U + 0041, U + 0042, U + 0043 e U + 00C9. In sostanza, i code point sono numeri nell'intervallo che va da 0 a 0x10FFFF.
ja: 概念上、一個の文字列は 'A' とか 'B' とか 'C' とか 'É' といった文字の並びです。 ``文字`` は抽象的な表現で、その意味はその文字を使用する言語と文脈によって決まります。Unicode の標準には ``コード・ポイント`` (*code points*) による文字の表し方が記載されています。例えば、先ほどの文字をコード・ポイントで表すとそれぞれ U+0041 とか U+0042 とか U+0043 とか U+00C9 になります。原則的にコード・ポイントは 0 から 0x10FFFF までの数値になります。

source: As mentioned earlier, the representation of a string as a list of code points is abstract. In order to convert this abstract representation into a sequence of bytes the Unicode string must be **encoded**. The simplest from of encoding is ASCII and is performed as follows:
ja: 前述の通り、コード・ポイントの並びによる文字列の表現は難解です。この難解な表現を Unicode 文字列のバイトの並びに変換するには ``エンコーディング`` (*encoding*) する必要があります。一番簡単なエンコーディングは ASCII で、次のようになります:

source: If the code point is < 128, each byte is the same as the value of the code point.
it: Se il code point è <128, ogni byte è uguale al valore del code point.
ja: 変換するコード・ポイントが 128 より小さい場合、それに対応するバイトはコード・ポイントと同じ値にする

source: If the code point is 128 or greater, the Unicode string can't be represented in this encoding. (Python raises a :exc:`UnicodeEncodeError` exception in this case.)
it: Se il code point è 128 o superiore, la stringa Unicode non può essere rappresentata in questa codifica. (Python mostra un'eccezione :exc:`UnicodeEncodeError` in questo caso.)
ja: 変換するコード・ポイントが 128 かまたはそれより大きい場合、Unicode の文字列では表現できない (この際 Python は :exc:`UnicodeEncodeError` という例外を発生させる)

source: Although ASCII encoding is simple to apply it can only encode for 128 different characters which is hardly enough. One of the most commonly used encodings that addresses this problem is UTF-8 (it can handle any Unicode code point). UTF stands for "Unicode Transformation Format", and the '8' means that 8-bit numbers are used in the encoding.
it: Sebbene la codifica ASCII sia semplice da applicare, è appena sufficiente per codificare 128 diversi caratteri. Una delle codifiche più comunemente usate in grado di risolvere questo problema è UTF-8 (in grado di gestire qualsiasi code point Unicode). UTF sta per "Unicode Transformation Format", e '8' significa che vengono utilizzati numeri a 8 bit per la codifica.
ja: ASCII のエンコーディングは簡単ですが、128 個の文字しかエンコーディングできません。これは十分ではありません。この問題に対処するために、最も一般的に使用されているエンコーディングの一つが UTF-8 です (これは Unicode のコード・ポイントを扱うものです)。UTF は "Unicode Transformation Format" の略で、'8' はエンコーディングする際に使用する 8 ビットの数値を表しています。

source: Python 2.x’s Unicode Support
it: Supporto Unicode per Python 2.x
ja: Python 2 系での Unicode のサポート

source: Python 2 comes with two different kinds of objects that can be used to represent strings, :class:`str` and :class:`unicode`. Instances of the latter are used to express Unicode strings, whereas instances of the :class:`str` type are byte representations (the encoded string). Under the hood, Python represents Unicode strings as either 16- or 32-bit integers, depending on how the Python interpreter was compiled. Unicode strings can be converted to 8-bit strings with :meth:`unicode.encode`::
it: Python 2 è dotato di due diversi tipi di oggetti che possono essere utilizzati per rappresentare le stringhe, :class:`str` e :class:`unicode`. Le istanze di questi ultimi sono utilizzate per esprimere stringhe Unicode, mentre le istanze del tipo :class:`str` sono rappresentazioni di byte (la stringa codificata). Al proprio interno, Python rappresenta stringhe Unicode come interi a 16 o 32 bit, a seconda di come l'interprete Python è stato compilato. Le stringhe Unicode possono essere convertite in stringhe a 8-bit con :meth:`unicode.encode`::
ja: Python の 2 系では、文字列を表現する際に使用するオブジェクトを二つ提供しています。それは :class:`str` と :class:`unicode` です。後者のインスタンスは Unicode の文字列を表す際に使用するのに対し、前者の str 型のインスタンスはバイト形式のデータ (エンコードした文字列) です。詳細にいうと、Python は Unicode の文字列を、Python のインタプリタのコンパイル方式に応じて 16 ビットないし 32 ビットの整数値として表現します。Unicode の文字列は :meth:`unicode.encode` メソッドを使って 8 ビットの文字列に変換することができます::

source: Python’s 8-bit strings have a :meth:`str.decode` method that interprets the string using the given encoding::
it: Le stringhe a 8-bit di Python hanno un metodo :meth:`str.decode` che interpreta la stringa utilizzando la codifica data::
ja: Python の 8 ビットの文字列に対しては :meth:`str.decode` というメソッドで、指定したエンコーディングを用いて文字列を解釈します::

source: Unfortunately, Python 2.x allows you to mix :class:`unicode` and :class:`str` if the 8-bit string happened to contain only 7-bit (ASCII) bytes, but would get :exc:`UnicodeDecodeError` if it contained non-ASCII values::
it: Purtroppo, Python 2.x permette di mischiare :class:`unicode` e :class:`str` se la stringa a 8-bit contiene solo 7-bit byte (ASCII), ma riceverebbe un :exc:`UnicodeDecodeError` se contenesse valori non ASCII::
ja: あいにく、Python の 2 系では 8 ビットの文字列に 7 ビットの文字 (ASCII) しか含まれていない場合、 :class:`unicode` と :class:`str` のオブジェクトを混ぜ合わせることが可能ですが、ASCII 以外の文字が含まれていると :exc:`UnicodeDecodeError` の例外を受け取ります::

source: Unicode in GTK+
ja: GTK+ での Unicode のサポート

source: GTK+ uses UTF-8 encoded strings for all text. This means that if you call a method that returns a string you will always obtain an instance of the :class:`str` type. The same applies to methods that expect one or more strings as parameter, they must be UTF-8 encoded. However, for convenience PyGObject will automatically convert any :class:`unicode` instance to :class:`str` if supplied as argument::
it: GTK+ utilizza stringhe UTF-8 codificate per il testo. Questo significa che se si chiama un metodo che restituisce una stringa si otterrà sempre un'istanza di :class:`str`. Lo stesso vale per i metodi che prevedono una o più stringhe come parametro, devono essere codificate UTF-8. Tuttavia, per comodità, PyGObject convertirà automaticamente qualsiasi istanza :class:`unicode` a :class:`str` se passato come argomento::
ja: GTK+ は全ての文字列に対し UTF-8 でエンコーディングした文字の並びを使用します。これは、一個の文字列を返すメソッドを呼び出すと、常に :class:`str` 型のインスタンスが得られるという意味です。同様に、一個以上の文字列を引数として受け取るメソッドの場合も、それらの文字列は UTF-8 でエンコーディングされている必要があります。但し、便宜上 PyGObject は引数として扱う場合、自動的に全ての :class:`unicode` のインスタンスを :class:`str` 型に変換するようになっています:

source: Note the warning at the end. Although we called :meth:`Gtk.Label.set_text` with a :class:`unicode` instance as argument, :meth:`Gtk.Label.get_text` will always return a :class:`str` instance. Accordingly, ``txt`` and ``unicode_string`` are *not* equal.
it: Si noti l'avviso alla fine. Anche se abbiamo chiamato :meth:`Gtk.Label.set_text` con un'istanza :class:`unicode` come argomento, :meth:`Gtk.Label.get_text` restituirà sempre un'istanza :class:`str`. Di conseguenza, ``txt`` e ``unicode_string`` *non* sono uguali.
ja: 上の例の最後に警告が表示されている点に注意して下さい。 :meth:`Gtk.Label.set_text` メソッドに :class:`unicode` 型のインスタンスを引数にして呼び出していますが、 :meth:`Gtk.Label.get_text` メソッドは常に :class:`str` 型のインスタンスを返します。そのため ``txt`` と ``unicode_string`` は同じにはなりません。

source: This is especially important if you want to internationalize your program using `gettext <http://docs.python.org/library/gettext.html>`_. You have to make sure that gettext will return UTF-8 encoded 8-bit strings for all languages. In general it is recommended to not use :class:`unicode` objects in GTK+ applications at all and only use UTF-8 encoded :class:`str` objects since GTK+ does not fully integrate with :class:`unicode` objects. Otherwise, you would have to decode the return values to Unicode strings each time you call a GTK+ method::
ja: これは、何かプログラムを作成する際に `gettext <http://docs.python.org/library/gettext.html>`_ を使って国際化するような場合は特に重要になってきます。gettext が全ての言語に対して UTF-8 でエンコーディングした 8 ビットの文字列を返すかどうかを確認しておく必要があります。一般的に、GTK+ のアプリケーションで :class:`unicode` 型のオブジェクトの使用は推奨されていません。GTK+ では :class:`unicode` 型のオブジェクトを完全にサポートしていないため、UTF-8 でエンコーディングされた :class:`str` 型のオブジェクトだけを使用することが推奨されています。さもなくば、GTK+ のメソッドを呼び出すたびに返り値を Unicode の文字列にデコーディングしなければならなくなります::

source: Python 3.x's Unicode support
it: Supporto Unicode per Python 3.x
ja: Python 3 系での Unicode のサポート

source: Since Python 3.0, all strings are stored as Unicode in an instance of the :class:`str` type. *Encoded* strings on the other hand are represented as binary data in the form of instances of the :class:`bytes` type. Conceptionally, :class:`str` refers to *text*, whereas :class:`bytes` refers to *data*. Use :meth:`str.encode` to go from :class:`str` to :class:`bytes`, and :meth:`bytes.decode` to go from :class:`bytes` to :class:`str`.
it: Con Python 3.0, tutte le stringhe vengono memorizzati come Unicode in un'istanza di tipo :class:`str`. Le stringhe *codificate* invece sono rappresentate come dati binari sotto forma di istanze del tipo :class:`bytes`. Concettualmente, :class:`str` fa riferimento a *testo*, mentre :class:`bytes` fa riferimento a *dati*. Utilizzate :meth:`str.encode` per convertire :class:`str` in :class:`bytes` e :meth:`bytes.decode` per passare da :class:`bytes` a :class:`str`.
ja: Python 3.0 から、全ての文字列は Unicode として :class:`str` 型のインスタンスの中に格納される用になりました。その一方で、 *エンコーディング* された文字列は :class:`bytes` 型のインスタンスの中にバイナリ・データとして格納されます。概念として :class:`str` 型は *文字列* を参照するのに対し、 :class:`bytes` 型は *データ* を参照します。 :meth:`str.encode` メソッドを使うと、 :class:`str` 型から :class:`bytes` 型に変換できます。またその逆の変換は :meth:`bytes.decode` メソッドを使います。

source: In addition, it is no longer possible to mix Unicode strings with encoded strings, because it will result in a :exc:`TypeError`::
it: In aggiunta, non è più possibile unire stringhe Unicode con stringhe non codificate, perché ne conseguerà :exc:`TypeError`::
ja: さらに、エンコーディングした文字列と Unicode の文字列を混在させることができなくなりました。そのような状態になると :exc:`TypeError` という例外が発行されます::

source: As a consequence, things are much cleaner and consistent with Python 3.x, because PyGObject will automatically encode/decode to/from UTF-8 if you pass a string to a method or a method returns a string. Strings, or *text*, will always be represented as instances of :class:`str` only::
it: Come conseguenza, le cose sono molto più semplici e coerenti con Python 3.x, perché PyGObject codificherà/decodificherà automaticamente a/da UTF-8 se si passa una stringa in un metodo oppure un metodo restituisce una stringa. Le stringhe, o * testo*, saranno sempre rappresentate come istanze di :class:`str`::
ja: 結果として、Python 3 系になってサポートの内容はかなり明確で一貫性のあるものになりました。その理由は、PyGObject がメソッドに引き渡される文字列やメソッドから返される文字列を自動的に UTF-8 でエンコーディングまたはデコーディングするようになったからです。文字列または *文章* といったものは、常に :class:`str` 型でのみ表現されるようになります:

source: References
it: Riferimenti
ja: 参考情報

source: `What's new in Python 3.0 <http://docs.python.org/py3k/whatsnew/3.0.html#text-vs-data-instead-of-unicode-vs-8-bit>`_ describes the new concepts that clearly distinguish between text and data.
ja: `Python 3.0 で新しくなったこと <http://docs.python.org/py3k/whatsnew/3.0.html#text-vs-data-instead-of-unicode-vs-8-bit>`_ の項には、文字列とデータを明確に区別する旨の概念が説明されています。

source: The `Unicode HOWTO <http://docs.python.org/howto/unicode.html>`_ discusses Python 2.x’s support for Unicode, and explains various problems that people commonly encounter when trying to work with Unicode.
ja: `Unicode HOWTO <http://docs.python.org/howto/unicode.html>`_ には、Python 2 系での Unicode のサポートに関する情報と、ユーザが Unicode を使って何か処理しようとする際によく遭遇する問題点についていろいろ説明があります。

source: The `Unicode HOWTO for Python 3.x <http://docs.python.org/dev/howto/unicode.html>`_ discusses Unicode support in Python 3.x.
ja: `Unicode HOWTO for Python 3.x <http://docs.python.org/dev/howto/unicode.html>`_ には Python 3 系での Unicode のサポートに関する情報があります。

source: `UTF-8 encoding table and Unicode characters <http://www.utf8-chartable.de>`_ contains a list of Unicode code points and their respective UTF-8 encoding.
it: La `tabella di codifica UTF-8 e i caratteri Unicode <http://www.utf8-chartable.de>`_ contengono una lista di codici Unicode e la rispettiva codifica UTF-8.
ja: `UTF-8 encoding table and Unicode characters <http://www.utf8-chartable.de>`_ には Unicode のコード・ポイントとそれらに対応する UTF-8 エンコーディングの一覧があります。

source: As mentioned earlier, the representation of a string as a list of code points is abstract. In order to convert this abstract representation into a sequence of bytes the Unicode string must be **encoded**. The simplest form of encoding is ASCII and is performed as follows:
it: Come accennato in precedenza, la rappresentazione di una stringa come lista di code point è astratta. Per convertire questa rappresentazione in una sequenza di byte, la stringa Unicode deve essere **encoded**, codificata. La codifica più semplice è ASCII e viene eseguita come segue:

source: This is especially important if you want to internationalize your program using `gettext <https://docs.python.org/library/gettext.html>`_. You have to make sure that gettext will return UTF-8 encoded 8-bit strings for all languages. In general it is recommended to not use :class:`unicode` objects in GTK+ applications at all and only use UTF-8 encoded :class:`str` objects since GTK+ does not fully integrate with :class:`unicode` objects. Otherwise, you would have to decode the return values to Unicode strings each time you call a GTK+ method::
it: Ciò è particolarmente importante se si vuole internazionalizzare il programma utilizzando `gettext <https://docs.python.org/library/gettext.html>`_. Bisogna fare in modo che gettext restituisca stringhe UTF-8 codificate a 8 bit per tutte le lingue. In generale si raccomanda di non utilizzare oggetti :class:`unicode` e oggetti :class:`str` codificati UTF-8 in applicazioni GTK+ perché queste ultime non si integrano pienamente con oggetti :class:`unicode`. In caso contrario, si dovrà decodificare i valori restituiti in stringhe Unicode ogni volta che si chiama un metodo GTK+::

source: `What's new in Python 3.0 <https://docs.python.org/py3k/whatsnew/3.0.html#text-vs-data-instead-of-unicode-vs-8-bit>`_ describes the new concepts that clearly distinguish between text and data.
it: `Novità in Python 3.0 <http://docs.python.org/py3k/whatsnew/3.0.html#text-vs-data-instead-of-unicode-vs-8-bit>`_ descrive i nuovi concetti che distinguono chiaramente tra testo e dati.

source: The `Unicode HOWTO <https://docs.python.org/howto/unicode.html>`_ discusses Python 2.x’s support for Unicode, and explains various problems that people commonly encounter when trying to work with Unicode.
it: Il manuale `Unicode HOWTO <http://docs.python.org/howto/unicode.html>`_ discute del supporto Unicode in Python 2.x, ed elenca i vari problemi che le persone hanno riscontrato lavorando con questo standard.

source: The `Unicode HOWTO for Python 3.x <https://docs.python.org/dev/howto/unicode.html>`_ discusses Unicode support in Python 3.x.
it: Il manuale `Unicode HOWTO per Python 3.x <http://docs.python.org/dev/howto/unicode.html>`_ discute del supporto Unicode in Python 3.x.
