Repository: sebp/PyGObject-Tutorial
Catalog: translations/po/*.po
Languages: pt_br, sv

source: Conceptional, a string is a list of characters such as 'A', 'B', 'C' or 'É'. **Characters** are abstract representations and their meaning depends on the language and context they are used in. The Unicode standard describes how characters are represented by **code points**. For example the characters above are represented with the code points U+0041, U+0042, U+0043, and U+00C9, respectively. Basically, code points are numbers in the range from 0 to 0x10FFFF.
pt_br: Conceitual, uma string é uma lista de caracteres como 'A', 'B', 'C' ou 'É'. **Caracteres** são representações abstratas e seu significado depende do idioma e do contexto em que são usados. O padrão Unicode descreve como os caracteres são representados por **pontos de código**. Por exemplo, os caracteres acima são representados com os pontos de código U+0041, U+0042, U+0043 e U+00C9, respectivamente. Basicamente, os pontos de código são números no intervalo de 0 a 0x10FFFF.

source: As mentioned earlier, the representation of a string as a list of code points is abstract. In order to convert this abstract representation into a sequence of bytes the Unicode string must be **encoded**. The simplest form of encoding is ASCII and is performed as follows:
pt_br: Como mencionado anteriormente, a representação de uma string como uma lista de pontos de código é abstrata. Para converter essa representação abstrata em uma sequência de bytes, a cadeia Unicode deve ser **codificada**. A forma mais simples de codificação é ASCII e é executada da seguinte maneira:

source: This is especially important if you want to internationalize your program using `gettext <https://docs.python.org/library/gettext.html>`_. You have to make sure that gettext will return UTF-8 encoded 8-bit strings for all languages. In general it is recommended to not use :class:`unicode` objects in GTK+ applications at all and only use UTF-8 encoded :class:`str` objects since GTK+ does not fully integrate with :class:`unicode` objects. Otherwise, you would have to decode the return values to Unicode strings each time you call a GTK+ method::
pt_br: Isto é especialmente importante se você quiser internacionalizar seu programa usando `gettext <https://docs.python.org/library/gettext.html>`_. Você precisa ter certeza de que gettext retornará sequências de 8 bits codificadas em UTF-8 para todos os idiomas. Em geral, recomenda-se não usar objetos :class:`unicode` em aplicações GTK+ e usar somente objetos codificados em UTF-8 :class:`str`, já que o GTK+ não se integra totalmente a objetos :class:`unicode`. Caso contrário, você teria que decodificar os valores de retorno para cadeias de caracteres Unicode cada vez que você chamar um método GTK+::

source: Since Python 3.0, all strings are stored as Unicode in an instance of the :class:`str` type. *Encoded* strings on the other hand are represented as binary data in the form of instances of the :class:`bytes` type. Conceptional, :class:`str` refers to *text*, whereas :class:`bytes` refers to *data*. Use :meth:`str.encode` to go from :class:`str` to :class:`bytes`, and :meth:`bytes.decode` to go from :class:`bytes` to :class:`str`.
pt_br: Desde o Python 3.0, todas as strings são armazenadas como Unicode em uma instância do tipo :class:`str`. *Codificado* strings, por outro lado, são representados como dados binários na forma de instâncias do tipo :class:`bytes`. Conceitualmente, :class:`str` refere-se a *texto*, enquanto :class:`bytes` refere-se a *dados*. Use :meth:`str.encode` para ir de :class:`str` para :class:`bytes` e :meth:`bytes.decode` para ir de :class:`bytes` para :class:`str`.

source: `What's new in Python 3.0 <https://docs.python.org/py3k/whatsnew/3.0.html#text-vs-data-instead-of-unicode-vs-8-bit>`_ describes the new concepts that clearly distinguish between text and data.
pt_br: `O que há de novo no Python 3.0 <https://docs.python.org/py3k/whatsnew/3.0.html#text-vs-data-instead-of-unicode-vs-8-bit>`_ descreve os novos conceitos que distinguir claramente entre texto e dados.

source: The `Unicode HOWTO <https://docs.python.org/howto/unicode.html>`_ discusses Python 2.x’s support for Unicode, and explains various problems that people commonly encounter when trying to work with Unicode.
pt_br: O `Unicode HOWTO <https://docs.python.org/howto/unicode.html>`_ aborda o suporte do Python 2.x para Unicode e explica vários problemas que as pessoas comumente encontram ao tentar trabalhar com o Unicode.

source: `UTF-8 encoding table and Unicode characters <http://www.utf8-chartable.de>`_ contains a list of Unicode code points and their respective UTF-8 encoding.
pt_br: `A tabela de codificação UTF-8 e os caracteres Unicode <http://www.utf8-chartable.de>`_ contém uma lista de pontos de código Unicode e sua respectiva codificação UTF-8.
