Repository: sebp/PyGObject-Tutorial
Catalog: translations/po/*.po
Languages: pt_br, sv

source: :class:`Gtk.CellRendererToggle` renders a toggle button in a cell. The button is drawn as a radio- or checkbutton, depending on the "radio" property. When activated, it emits the "toggled" signal.
pt_br: :class:`Gtk.CellRendererToggle` renderiza um botão de alternância em uma célula. O botão é desenhado como um botão de rádio ou de verificação, dependendo da propriedade "radio". Quando ativado, emite o sinal "alternado".
sv: :class:`Gtk.CellRendererToggle` renderar en växlingsknapp i en cell. Knappen ritas som en radioknapp eller en kryssruta, beroende på egenskapen ”radio”. Då den aktiveras sänder den signalen ”toggled”.

source: As a :class:`Gtk.CellRendererToggle` can have two states, active and not active, you most likely want to bind the "active" property on the cell renderer to a boolean value in the model, thus causing the check button to reflect the state of the model.
pt_br: Como um :class:`Gtk.CellRendererToggle` pode ter dois estados, ativos e não ativos, você provavelmente deseja vincular a propriedade "active" no renderizador de célula a um valor booleano no modelo, fazendo com que o botão de verificação reflita o estado do modelo.
sv: Då en :class:`Gtk.CellRendererToggle` kan ha två tillstånd, aktiv och inte aktiv, så kommer du mest troligt vilja binda egenskapen ”active” på cellrenderaren till ett booleskt värde i modellen, och därigenom få kryssrutan att motsvara tillståndet för modellen.

source: A :class:`Gtk.CellRendererPixbuf` can be used to render an image in a cell. It allows to render either a given :class:`Gdk.Pixbuf` (set via the "pixbuf" property) or a named icon (set via the "icon-name" property).
pt_br: A :class:`Gtk.CellRendererPixbuf` pode ser usado para renderizar uma imagem em uma célula. Ele permite renderizar um dado :class:`Gdk.Pixbuf` (definido através da propriedade "pixbuf") ou um ícone nomeado (configurado através da propriedade "icon-name").
sv: En :class:`Gtk.CellRendererPixbuf` kan användas för att rendera en bild i en cell. Den tillåter att rendera antingen en given :class:`Gdk.Pixbuf` (satt via egenskapen ”pixbuf”) eller en namngiven ikon (satt via egenskapen ”icon-name”).

source: :class:`Gtk.CellRendererCombo` renders text in a cell like :class:`Gtk.CellRendererText` from which it is derived. But while the latter offers a simple entry to edit the text, :class:`Gtk.CellRendererCombo` offers a :class:`Gtk.ComboBox` widget to edit the text. The values to display in the combo box are taken from the :class:`Gtk.TreeModel` specified in the "model" property.
pt_br: :class:`Gtk.CellRendererCombo` processa texto em uma célula como :class:`Gtk.CellRendererText` do qual é derivado. Mas enquanto o último oferece uma entrada simples para editar o texto, :class:`Gtk.CellRendererCombo` oferece um widget :class:`Gtk.ComboBox` para editar o texto. Os valores a serem exibidos na caixa de combinação são obtidos de :class:`Gtk.TreeModel` especificado na propriedade "model".
sv: :class:`Gtk.CellRendererCombo` renderar text i en cell som :class:`Gtk.CellRendererText` från vilken den härletts. Men medan den senare erbjuder ett enkelt inmatningsfält för att redigera texten så erbjuder :class:`Gtk.CellRendererCombo` en :class:`Gtk.ComboBox`-komponent för att redigera texten. Värdena att visa i kombinationsrutan tas från den :class:`Gtk.TreeModel` som anges i egenskapen ”model”.

source: The combo cell renderer takes care of adding a text cell renderer to the combo box and sets it to display the column specified by its "text-column" property.
pt_br: O renderizador de célula de combinação toma o cuidado de adicionar um renderizador de célula de texto à caixa de combinação e o configura para exibir a coluna especificada por sua propriedade "text-column".
sv: Kombinationscellrenderaren tar hand om att lägga till en textcellrenderare till kombinationsrutan och ställer in den att visa kolumnen som anges av dess egenskap ”text-column”.

source: A :class:`Gtk.CellRendererCombo` can operate in two modes. It can be used with and without an associated :class:`Gtk.Entry` widget, depending on the value of the "has-entry" property.
pt_br: A :class:`Gtk.CellRendererCombo` pode operar em dois modos. Ele pode ser usado com e sem um widget associado :class:`Gtk.Entry`, dependendo do valor da propriedade "has-entry".
sv: En :class:`Gtk.CellRendererCombo` kan arbeta i två lägen. Den kan användas med eller utan en associerad :class:`Gtk.Entry`-komponent, beroende på värdet på egenskapen ”has-entry”.

source: :class:`Gtk.CellRendererProgress` renders a numeric value as a progress bar in a cell. Additionally, it can display a text on top of the progress bar.
pt_br: :class:`Gtk.CellRendererProgress` renderiza um valor numérico como uma barra de progresso em uma célula. Além disso, pode exibir um texto na parte superior da barra de progresso.
sv: :class:`Gtk.CellRendererProgress` renderar ett numeriskt värde som en förloppsindikator i en cell. Vidare kan den visa en text ovanpå förloppsindikatorn.

source: The percentage value of the progress bar can be modified by changing the "value" property. Similar to :class:`Gtk.ProgressBar`, you can enable the *activity mode* by incrementing the "pulse" property instead of the "value" property.
pt_br: O valor percentual da barra de progresso pode ser modificado alterando a propriedade "value". Semelhante a :class:`Gtk.ProgressBar`, você pode ativar o *modo de atividade* incrementando a propriedade "pulse" em vez da propriedade "value".
sv: Procentvärdet för förloppsindikatorn kan ändras genom att ändra egenskapen ”value”. Liknande :class:`Gtk.ProgressBar` så kan du aktivera *aktivitetsläget* genom att öka ”pulse”-egenskapen istället för ”value”-egenskapen.

source: :class:`Gtk.CellRendererSpin` renders text in a cell like :class:`Gtk.CellRendererText` from which it is derived. But while the latter offers a simple entry to edit the text, :class:`Gtk.CellRendererSpin` offers a :class:`Gtk.SpinButton` widget. Of course, that means that the text has to be parseable as a floating point number.
pt_br: :class:`Gtk.CellRendererSpin` processa o texto em uma célula como :class:`Gtk.CellRendererText` do qual é derivado. Mas enquanto o último oferece uma entrada simples para editar o texto, :class:`Gtk.CellRendererSpin` oferece um widget :class:`Gtk.SpinButton`. Claro, isso significa que o texto deve ser analisado como um número de ponto flutuante.
sv: :class:`Gtk.CellRendererSpin` renderar text i en cell som :class:`Gtk.CellRendererText` från vilken den härletts. Men medan den senare erbjuder ett enkelt inmatningsfält för att redigera texten så erbjuder :class:`Gtk.CellRendererSpin` en :class:`Gtk.SpinButton`-komponent. Detta betyder förstås att texten måste gå att tolka som ett flyttal.

source: The range of the spinbutton is taken from the adjustment property of the cell renderer, which can be set explicitly or mapped to a column in the tree model, like all properties of cell renders. :class:`Gtk.CellRendererSpin` also has properties for the climb rate and the number of digits to display.
pt_br: O intervalo do botão de rotação é obtido da propriedade de ajuste do renderizador de célula, que pode ser definido explicitamente ou mapeado para uma coluna no modelo de árvore, como todas as propriedades dos renderizadores de célula. :class:`Gtk.CellRendererSpin` também possui propriedades para a taxa de subida e o número de dígitos a serem exibidos.
sv: Intervallet för stegningsrutan tas från justeringsegenskapen för cellrenderaren, vilken kan ställas in explicit eller mappas till en kolumn i trädmodellen, som alla egenskaper för cellrenderare. :class:`Gtk.CellRendererSpin` har också egenskaper för steghöjden och antalet siffror att visa.

source: :class:`Gtk.Clipboard` provides a storage area for a variety of data, including text and images. Using a clipboard allows this data to be shared between applications through actions such as copying, cutting, and pasting. These actions are usually done in three ways: using keyboard shortcuts, using a :class:`Gtk.MenuItem`, and connecting the functions to :class:`Gtk.Button` widgets.
pt_br: :class:`Gtk.Clipboard` fornece uma área de armazenamento para uma variedade de dados, incluindo texto e imagens. O uso de uma área de transferência permite que esses dados sejam compartilhados entre aplicativos por meio de ações como copiar, cortar e colar. Essas ações geralmente são feitas de três maneiras: usando atalhos de teclado, usando um :class:`Gtk.MenuItem` e conectando as funções aos widgets :class:`Gtk.Button`.
sv: :class:`Gtk.Clipboard` tillhandahåller ett lagringsutrymme för en mängd data, inklusive text och bilder. Att använda urklipp låter dessa data delas mellan program genom åtgärder så som kopiering, utklippning och inklistring. Dessa åtgärder utförs vanligen på tre sätt: med tangentbordsgenvägar, med ett :class:`Gtk.MenuItem` och att ansluta funktionerna till :class:`Gtk.Button`-komponenter.

source: There are multiple clipboard selections for different purposes. In most circumstances, the selection named ``CLIPBOARD`` is used for everyday copying and pasting. ``PRIMARY`` is another common selection which stores text selected by the user with the cursor.
pt_br: Existem várias seleções da área de transferência para finalidades diferentes. Na maioria das circunstâncias, a seleção chamada ``CLIPBOARD`` é usada para copiar e colar todos os dias. ``PRIMARY`` é outra seleção comum que armazena texto selecionado pelo usuário com o cursor.
sv: Det finns flera urklippsmarkeringar för olika syften. I de flesta omständigheter används markeringen med namn ``CLIPBOARD`` för vardaglig kopiering och inklistring. ``PRIMARY`` är en annan vanlig markering som lagrar text som markerats av användaren med markören.

source: A :class:`Gtk.ComboBox` allows for the selection of an item from a dropdown menu. They are preferable to having many radio buttons on screen as they take up less room. If appropriate, it can show extra information about each item, such as text, a picture, a checkbox, or a progress bar.
pt_br: A :class:`Gtk.ComboBox` permite a seleção de um item em um menu suspenso. Eles são preferíveis a ter muitos botões de rádio na tela, pois ocupam menos espaço. Se apropriado, ele pode mostrar informações extras sobre cada item, como texto, uma imagem, uma caixa de seleção ou uma barra de progresso.
sv: En :class:`Gtk.ComboBox` möjliggör val av ett objekt från en rullgardinsmeny. De föredras över att ha många radioknappar på skärmen då de tar upp mindre utrymme. Om lämpligt kan den visa extra information om varje objekt, så som text, en bild, en kryssruta eller en förloppsindikator.

source: :class:`Gtk.ComboBox` is very similar to :class:`Gtk.TreeView`, as both use the model-view pattern; the list of valid choices is specified in the form of a tree model, and the display of the choices can be adapted to the data in the model by using :ref:`cell renderers <cellrenderers>`. If the combo box contains a large number of items, it may be better to display them in a grid rather than a list. This can be done by calling :meth:`Gtk.ComboBox.set_wrap_width`.
pt_br: :class:`Gtk.ComboBox` é muito similar a :class:`Gtk.TreeView`, já que ambos usam o padrão model-view; A lista de opções válidas é especificada na forma de um modelo de árvore, e a exibição das opções pode ser adaptada aos dados no modelo usando :ref:`renderizadores de célula <cellrenderers>`. Se a caixa de combinação contiver um grande número de itens, talvez seja melhor exibi-los em uma grade em vez de em uma lista. Isso pode ser feito chamando :meth:`Gtk.ComboBox.set_wrap_width`.
sv: :class:`Gtk.ComboBox`` är väldigt lik :class:`Gtk.TreeView`, då de båda använder model-view-mönstret; listan över giltiga val anges i formen av en trädmodell, och visningen av valen kan anpassas till data i modellen genom att använda :ref:`cellrenderare <cellrenderers>`. Om kombinationsrutan innehåller ett stort antal objekt kan det vara bättre att visa dem i ett rutnät snarare än i en lista. Detta kan göras genom att anropa :meth:`Gtk.ComboBox.set_wrap_width`.

source: A default value can be set by calling :meth:`Gtk.ComboBox.set_active` with the index of the desired value.
sv: Ett standardvärde kan ställas in genom att anropa :meth:`Gtk.ComboBox.set_active` med index för det önskade värdet.

source: The :class:`Gtk.ComboBox` widget usually restricts the user to the available choices, but it can optionally have an :class:`Gtk.Entry`, allowing the user to enter arbitrary text if none of the available choices are suitable. To do this, use one of the static methods :meth:`Gtk.ComboBox.new_with_entry` or :meth:`Gtk.ComboBox.new_with_model_and_entry` to create an :class:`Gtk.ComboBox` instance.
pt_br: O widget :class:`Gtk.ComboBox` geralmente restringe o usuário às opções disponíveis, mas ele pode opcionalmente ter um :class:`Gtk.Entry`, permitindo que o usuário insira texto arbitrário se nenhuma das opções disponíveis for adequada. Para fazer isso, use um dos métodos estáticos :meth:`Gtk.ComboBox.new_with_entry` ou :meth:`Gtk.ComboBox.new_with_model_and_entry` para criar uma instância :class:`Gtk.ComboBox`.
sv: :class:`Gtk.ComboBox`-komponenten begränsar vanligen användaren till de tillgängliga valen, men den kan valfritt ha ett :class:`Gtk.Entry`, vilket låter användaren ange godtycklig text om inget av de tillgängliga valen är lämpligt. För att göra detta, använd en av de statiska metoderna :meth:`Gtk.ComboBox.new_with_entry` eller :meth:`Gtk.ComboBox.new_with_model_and_entry` för att skapa en :class:`Gtk.ComboBox`-instans.

source: For a simple list of textual choices, the model-view API of :class:`Gtk.ComboBox` can be a bit overwhelming. In this case, :class:`Gtk.ComboBoxText` offers a simple alternative. Both :class:`Gtk.ComboBox` and :class:`Gtk.ComboBoxText` can contain an entry.
pt_br: Para uma lista simples de escolhas textuais, a API de visão de modelo de :class:`Gtk.ComboBox` pode ser um pouco avassaladora. Neste caso, :class:`Gtk.ComboBoxText` oferece uma alternativa simples. Ambos :class:`Gtk.ComboBox` e :class:`Gtk.ComboBoxText` podem conter uma entrada.
sv: För en enkel lista över textval kan model-view-API:t för :class:`Gtk.ComboBox` vara lite överväldigande. I detta fall är :class:`Gtk.ComboBoxText` ett enkelt alternativ. Både :class:`Gtk.ComboBox` och :class:`Gtk.ComboBoxText` kan innehålla ett inmatningsfält.

source: Dialogs
sv: Dialoger

source: Dialog windows are very similar to standard windows, and are used to provide or retrieve information from the user. They are often used to provide a preferences window, for example. The major difference a dialog has is some prepacked widgets which layout the dialog automatically. From there, we can simply add labels, buttons, check buttons, etc. Another big difference is the handling of responses to control how the application should behave after the dialog has been interacted with.
pt_br: As janelas de caixa de diálogo são muito semelhantes às janelas padrão e são usadas para fornecer ou recuperar informações do usuário. Eles são frequentemente usados para fornecer uma janela de preferências, por exemplo. A principal diferença que uma caixa de diálogo tem é alguns widgets pré-empacotados que organizam a caixa de diálogo automaticamente. A partir daí, podemos simplesmente adicionar rótulos, botões, botões de verificação, etc. Outra grande diferença é o tratamento de respostas para controlar como o aplicativo deve se comportar após a interação com a caixa de diálogo.
sv: Dialogfönster liknar väldigt mycket standardfönster, och används för att tillhandahålla eller erhålla information från användaren. De används ofta för att exempelvis tillhandahålla ett inställningsfönster. Den stora skillnaden som en dialog har är några i förväg packade komponenter som automatiskt gör en layout för dialogen. Därifrån kan vi enkelt lägga till etiketter, knappar, kryssrutor o.s.v. En annan stor skillnad är hanteringen av svar för att styra hur programmet ska bete sig efter interaktion med dialogen.

source: There are several derived Dialog classes which you might find useful. :class:`Gtk.MessageDialog` is used for most simple notifications. But at other times you might need to derive your own dialog class to provide more complex functionality.
pt_br: Existem várias classes de diálogo derivadas que você pode achar útil. :class:`Gtk.MessageDialog` é usado para notificações mais simples. Porém, em outras ocasiões, você pode precisar derivar sua própria classe de diálogo para fornecer uma funcionalidade mais complexa.
sv: Det finns flera härledda Dialog-klasser som du kan finna användbara. :class:`Gtk.MessageDialog` används för de flesta enkla aviseringar. Men vid andra tillfällen kan du behöva härleda din egen dialogklass för att tillhandahålla mer komplex funktionalitet.

source: Custom Dialogs
pt_br: Dialogs Personalizados
sv: Anpassade dialoger

source: To pack widgets into a custom dialog, you should pack them into the :class:`Gtk.Box`, available via :meth:`Gtk.Dialog.get_content_area`. To just add a :class:`Gtk.Button` to the bottom of the dialog, you could use the :meth:`Gtk.Dialog.add_button` method.
pt_br: Para empacotar widgets em um diálogo customizado, você deve empacotá-los no :class:`Gtk.Box`, disponível via :meth:`Gtk.Dialog.get_content_area`. Para adicionar apenas um :class:`Gtk.Button` ao final do diálogo, você poderia usar o método :meth:`Gtk.Dialog.add_button`.
sv: För att packa komponenter i en anpassad dialog bör du packa dem i din :class:`Gtk.Box`, tillgänglig via :meth:`Gtk.Dialog.get_content_area`. För att bara lägga till en :class:`Gtk.Button` längst ner i dialogen kan du använda metoden :meth:`Gtk.Dialog.add_button`.

source: A 'modal' dialog (that is, one which freezes the rest of the application from user input), can be created by calling :class:`Gtk.Dialog.set_modal` on the dialog or set the ``flags`` argument of the :class:`Gtk.Dialog` constructor to include the :attr:`Gtk.DialogFlags.MODAL` flag.
pt_br: Um diálogo 'modal' (isto é, um que congela o resto do aplicativo da entrada do usuário), pode ser criado chamando :class:`Gtk.Dialog.set_modal` no diálogo ou setando o argumento ``flags`` do o construtor :class:`Gtk.Dialog` para incluir o sinalizador :attr:`Gtk.DialogFlags.MODAL`.
sv: En ”modal” dialog (det vill säga en som fryser resten av programmet från användarinmatning) kan skapas genom att anropa :class:`Gtk.Dialog.set_modal` på dialogen eller ställa in argumentet ``flags`` för konstruktorn :class:`Gtk.Dialog` att inkludera flaggan :attr:`Gtk.DialogFlags.MODAL`.

source: Clicking a button will emit a signal called "response". If you want to block waiting for a dialog to return before returning control flow to your code, you can call :meth:`Gtk.Dialog.run`. This method returns an int which may be a value from the :class:`Gtk.ResponseType` or it could be the custom response value that you specified in the :class:`Gtk.Dialog` constructor or :meth:`Gtk.Dialog.add_button`.
pt_br: Clicar em um botão irá emitir um sinal chamado "response". Se você quiser bloquear a espera de um diálogo para retornar antes do retorno do fluxo de controle para o seu código, você pode chamar :meth:`Gtk.Dialog.run`. Este método retorna um int que pode ser um valor de :class:`Gtk.ResponseType` ou pode ser o valor de resposta customizado que você especificou no construtor :class:`Gtk.Dialog` ou :meth:`Gtk.Dialog .add_button`.
sv: Att klicka på en knapp kommer sända ut en signal kallad ”response”. Om du vill blockera och vänta på att en dialog ska returnera innan du returnerar kontrollflödet till din kod kan du anropa :meth:`Gtk.Dialog.run`. Denna metod returnerar en int som kan vara ett värde från :class:`Gtk.ResponseType` eller så kan den vara det anpassade svarsvärdet som du angav i :class:`Gtk.Dialog`-konstruktorn eller :meth:`Gtk.Dialog.add_button`.

source: Finally, there are two ways to remove a dialog. The :meth:`Gtk.Widget.hide` method removes the dialog from view, however keeps it stored in memory. This is useful to prevent having to construct the dialog again if it needs to be accessed at a later time. Alternatively, the :meth:`Gtk.Widget.destroy` method can be used to delete the dialog from memory once it is no longer needed. It should be noted that if the dialog needs to be accessed after it has been destroyed, it will need to be constructed again otherwise the dialog window will be empty.
pt_br: Finalmente, existem duas maneiras de remover um diálogo. O método :meth:`Gtk.Widget.hide` remove a caixa de diálogo da visualização, mas mantém armazenada na memória. Isso é útil para evitar a necessidade de construir a caixa de diálogo novamente se precisar ser acessada posteriormente. Alternativamente, o método :meth:`Gtk.Widget.destroy` pode ser usado para excluir o diálogo da memória, uma vez que não é mais necessário. Deve ser notado que se o diálogo precisar ser acessado depois de ter sido destruído, ele precisará ser construído novamente, caso contrário a janela de diálogo estará vazia.
sv: Slutligen finns det två sätt att ta bort en dialog. Metoden :meth:`Gtk.Widget.hide` får dialogen att sluta visas, men behåller den i minnet. Detta är användbart för att slippa behöva konstruera dialogen igen om den behöver kommas åt vid ett senare tillfälle. Alternativt kan metoden :meth:`Gtk.Widget.destroy` användas för att ta bort dialogen från minnet då den inte längre behövs. Det bör noteras att om dialogen behöver kommas åt efter att den förstörts så kommer den behöva konstrueras igen, annars kommer dialogfönstret vara tomt.

source: :class:`Gtk.MessageDialog` is a convenience class, used to create simple, standard message dialogs, with a message, an icon, and buttons for user response You can specify the type of message and the text in the :class:`Gtk.MessageDialog` constructor, as well as specifying standard buttons.
pt_br: :class:`Gtk.MessageDialog` é uma classe de conveniência, usada para criar diálogos de mensagem simples e padrão, com uma mensagem, um ícone e botões para resposta do usuário. Você pode especificar o tipo de mensagem e o texto no construtor :class:`Gtk.MessageDialog`, além de especificar botões padrão.
sv: :class:`Gtk.MessageDialog` är en bekvämlighetsklass, använd för att skapa enkla standardmeddelandedialoger, med ett meddelande, en ikon och knappar för användarsvar. Du kan ange meddelandetypen och texten i :class:`Gtk.MessageDialog`-konstruktorn, såväl som att ange standardknappar.

source: In some dialogs which require some further explanation of what has happened, a secondary text can be added. In this case, the primary message entered when creating the message dialog is made bigger and set to bold text. The secondary message can be set by calling :meth:`Gtk.MessageDialog.format_secondary_text`.
pt_br: Em alguns diálogos que requerem alguma explicação adicional do que aconteceu, um texto secundário pode ser adicionado. Nesse caso, a mensagem principal inserida ao criar a caixa de diálogo da mensagem é maior e definida como texto em negrito. A mensagem secundária pode ser definida chamando :meth:`Gtk.MessageDialog.format_secondary_text`.
sv: I några dialoger som kräver vidare förklaring av vad som har hänt kan en sekundär text läggas till. I detta fall görs det primära meddelandet som matats in då meddelandedialogen skapades större och ställs in till fetstil. Det sekundära meddelandet kan ställas in genom att anropa :meth:`Gtk.MessageDialog.format_secondary_text`.
