Repository: sebp/PyGObject-Tutorial
Catalog: translations/po/*.po
Languages: pt_br, sv

source: The :class:`Gtk.FileChooserDialog` is suitable for use with "File/Open" or "File/Save" menu items. You can use all of the :class:`Gtk.FileChooser` methods on the file chooser dialog as well as those for :class:`Gtk.Dialog`.
pt_br: O :class:`Gtk.FileChooserDialog` é adequado para uso com itens de menu "Arquivo/Abrir" ou "Arquivo/Salvar". Você pode usar todos os métodos :class:`Gtk.FileChooser` no diálogo do seletor de arquivos, assim como aqueles para :class:`Gtk.Dialog`.
sv: :class:`Gtk.FileChooserDialog` är lämplig för användning med menyobjekten ”Arkiv/Öppna” eller ”Arkiv/Spara”. Du kan använda alla metoder för :class:`Gtk.FileChooser` på filväljardialogen såväl som de för :class:`Gtk.Dialog`.

source: When creating a :class:`Gtk.FileChooserDialog` you have to define the dialog's purpose:
pt_br: Ao criar um :class:`Gtk.FileChooserDialog` você precisa definir o propósito do diálogo:
sv: När du skapar en :class:`Gtk.FileChooserDialog` måste du definiera dialogens syfte:

source: To select a file for opening, as for a File/Open command, use :attr:`Gtk.FileChooserAction.OPEN`
pt_br: Para selecionar um arquivo para abertura, como para um comando Arquivo/Abrir, use :attr:`Gtk.FileChooserAction.OPEN`
sv: För att välja en fil att öppna, som för ett Arkiv/Öppna-kommando, använd :attr:`Gtk.FileChooserAction.OPEN`

source: To save a file for the first time, as for a File/Save command, use :attr:`Gtk.FileChooserAction.SAVE`, and suggest a name such as "Untitled" with :meth:`Gtk.FileChooser.set_current_name`.
pt_br: Para salvar um arquivo pela primeira vez, como para um comando Arquivo/Salvar, use :attr:`Gtk.FileChooserAction.SAVE` e sugira um nome como "Untitled"com :meth:`Gtk.FileChooser.set_current_name`.
sv: För att spara en fil för första gången, som för ett Arkiv/Spara-kommando, använd :attr:`Gtk.FileChooserAction.SAVE`, och föreslå ett namn som ”Namnlös” med :meth:`Gtk.FileChooser.set_current_name`.

source: To save a file under a different name, as for a File/Save As command, use :attr:`Gtk.FileChooserAction.SAVE`, and set the existing filename with :meth:`Gtk.FileChooser.set_filename`.
pt_br: Para salvar um arquivo com um nome diferente, como para um comando Arquivo/Salvar como, use :attr:`Gtk.FileChooserAction.SAVE` e defina o nome do arquivo existente como :meth:`Gtk.FileChooser.set_filename`.
sv: För att spara en fil under ett annat namn, som för ett Arkiv/Spara som-kommando, använd :attr:`Gtk.FileChooserAction.SAVE`, och ställ in det befintliga filnamnet med :meth:`Gtk.FileChooser.set_filename`.

source: To choose a folder instead of a file, use :attr:`Gtk.FileChooserAction.SELECT_FOLDER`.
pt_br: Para escolher uma pasta em vez de um arquivo, use :attr:`Gtk.FileChooserAction.SELECT_FOLDER`.
sv: För att välja en mapp istället för en fil, använd :attr:`Gtk.FileChooserAction.SELECT_FOLDER`.

source: :class:`Gtk.FileChooserDialog` inherits from :class:`Gtk.Dialog`, so buttons have response IDs such as :attr:`Gtk.ResponseType.ACCEPT` and :attr:`Gtk.ResponseType.CANCEL` which can be specified in the :class:`Gtk.FileChooserDialog` constructor. In contrast to :class:`Gtk.Dialog`, you can not use custom response codes with :class:`Gtk.FileChooserDialog`. It expects that at least one button will have of the following response IDs:
pt_br: :class:`Gtk.FileChooserDialog` herda de :class:`Gtk.Dialog`, então os botões possuem IDs de resposta como :attr:`Gtk.ResponseType.ACCEPT` e :attr:`Gtk.ResponseType.CANCEL`, que pode ser especificado no construtor :class:`Gtk.FileChooserDialog`. Em contraste com :class:`Gtk.Dialog`, você não pode usar códigos de resposta customizados com :class:`Gtk.FileChooserDialog`. Espera que pelo menos um botão tenha os seguintes IDs de resposta:
sv: :class:`Gtk.FileChooserDialog` ärver från :class:`Gtk.Dialog`, så knappar har svars-ID:n så som :attr:`Gtk.ResponseType.ACCEPT` och :attr:`Gtk.ResponseType.CANCEL` vilka kan anges i konstruktorn för :class:`Gtk.FileChooserDialog`. I kontrast till :class:`Gtk.Dialog` så kan du inte använda anpassade svarskoder med :class:`Gtk.FileChooserDialog`. Den förväntar sig att åtminstone en knapp kommer ha följande svars-ID:n:

source: When the user is finished selecting files, your program can get the selected names either as filenames (:meth:`Gtk.FileChooser.get_filename`) or as URIs (:meth:`Gtk.FileChooser.get_uri`).
pt_br: Quando o usuário terminar de selecionar arquivos, seu programa pode obter os nomes selecionados como nomes de arquivos (:meth:`Gtk.FileChooser.get_filename`) ou como URIs (:meth:`Gtk.FileChooser.get_uri`).
sv: När användaren är klar med att välja filer kan ditt program få de valda namnen antingen som filnamn (:meth:`Gtk.FileChooser.get_filename`) eller som URI:er (:meth:`Gtk.FileChooser.get_uri`).

source: By default, :class:`Gtk.FileChooser` only allows a single file to be selected at a time. To enable multiple files to be selected, use :meth:`Gtk.FileChooser.set_select_multiple`. Retrieving a list of selected files is possible with either :meth:`Gtk.FileChooser.get_filenames` or :meth:`Gtk.FileChooser.get_uris`.
pt_br: Por padrão, :class:`Gtk.FileChooser` permite apenas que um único arquivo seja selecionado por vez. Para permitir que vários arquivos sejam selecionados, use :meth:`Gtk.FileChooser.set_select_multiple`. Recuperar uma lista de arquivos selecionados é possível com :meth:`Gtk.FileChooser.get_filenames` ou :meth:`Gtk.FileChooser.get_uris`.
sv: Som standard tillåter :class:`Gtk.FileChooser` endast att en fil väljs åt gången. För att aktivera val av flera filer, använd :meth:`Gtk.FileChooser.set_select_multiple`. Att erhålla en lista över valda filer är möjligt med antingen :meth:`Gtk.FileChooser.get_filenames` eller :meth:`Gtk.FileChooser.get_uris`.

source: :class:`Gtk.FileChooser` also supports a variety of options which make the files and folders more configurable and accessible.
pt_br: :class:`Gtk.FileChooser` também suporta uma variedade de opções que tornam os arquivos e pastas mais configuráveis e acessíveis.
sv: :class:`Gtk.FileChooser` stöder också ett antal alternativ som gör filerna och mapparna mer konfigurerbara och åtkomliga.

source: :meth:`Gtk.FileChooser.set_local_only`: Only local files can be selected.
pt_br: :meth:`Gtk.FileChooser.set_local_only`: Somente arquivos locais podem ser selecionados.
sv: :meth:`Gtk.FileChooser.set_local_only`: Endast lokala filer kan väljas.

source: :meth:`Gtk.FileChooser.show_hidden`: Hidden files and folders are displayed.
pt_br: :meth:`Gtk.FileChooser.show_hidden`: arquivos e pastas ocultos são exibidos.
sv: :meth:`Gtk.FileChooser.show_hidden`: Dolda filer och mappar visas.

source: :meth:`Gtk.FileChooser.set_do_overwrite_confirmation`: If the file chooser was configured in :attr:`Gtk.FileChooserAction.SAVE` mode, it will present a confirmation dialog if the user types a file name that already exists.
pt_br: :meth:`Gtk.FileChooser.set_do_overwrite_confirmation`: Se o seletor de arquivos foi configurado no modo :attr:`Gtk.FileChooserAction.SAVE`, ele apresentará um diálogo de confirmação se o usuário digitar um nome de arquivo que já existe.
sv: :meth:`Gtk.FileChooser.set_do_overwrite_confirmation`: Om filväljaren konfigurerades i läget :attr:`Gtk.FileChooserAction.SAVE`, kommer den presentera en bekräftelsedialog om användaren skriver in ett filnamn som redan finns.

source: Furthermore, you can specify which kind of files are displayed by creating :class:`Gtk.FileFilter` objects and calling :meth:`Gtk.FileChooser.add_filter`. The user can then select one of the added filters from a combo box at the bottom of the file chooser.
pt_br: Além disso, você pode especificar quais tipos de arquivos são exibidos criando objetos :class:`Gtk.FileFilter` e chamando :meth:`Gtk.FileChooser.add_filter`. O usuário pode selecionar um dos filtros adicionados em uma caixa de combinação na parte inferior do seletor de arquivos.
sv: Vidare kan du ange vilka typer av filer som visas genom att skapa :class:`Gtk.FileFilter`-objekt och anropa :meth:`Gtk.FileChooser.add_filter`. Användaren kan sedan välja ett av de tillagda filtren från en kombinationsruta längst ner i filväljaren.

source: Drag and Drop
pt_br: Arraste e solte
sv: Dra-och-släpp

source: Versions of PyGObject < 3.0.3 contain a bug which does not allow drag and drop to function correctly. Therefore a version of PyGObject >= 3.0.3 is required for the following examples to work.
pt_br: As versões do PyGObject < 3.0.3 contêm um bug que não permite arrastar e soltar para funcionar corretamente. Portanto, uma versão do PyGObject >= 3.0.3 é necessária para os exemplos a seguir funcionarem.
sv: Versioner av PyGObject < 3.0.3 innehåller ett fel som inte låter dra-och-släpp fungera korrekt. Därför krävs en version av PyGObject >= 3.0.3 för att följande exempel ska fungera.

source: Setting up drag and drop between widgets consists of selecting a drag source (the widget which the user starts the drag from) with the :meth:`Gtk.Widget.drag_source_set` method, selecting a drag destination (the widget which the user drops onto) with the :meth:`Gtk.Widget.drag_dest_set` method and then handling the relevant signals on both widgets.
pt_br: Configurar arrastar e soltar entre widgets consiste em selecionar uma fonte de arrasto (o widget do qual o usuário começa a arrastar) com o método :meth:`Gtk.Widget.drag_source_set`, selecionando um destino de arrasto (o widget que o usuário coloca em) com o método :meth:`Gtk.Widget.drag_dest_set` e depois manipular os sinais relevantes em ambos os widgets.
sv: Att konfigurera dra-och-släpp mellan komponenter består i att välja en dragkälla (komponenten som användaren startar dragningen från) med metoden :meth:`Gtk.Widget.drag_source_set`, välja ett dragmål (komponenten som användaren släpper på) med metoden :meth:`Gtk.Widget.drag_dest_set` och sedan hantera de relevanta signalerna för båda komponenterna.

source: Instead of using :meth:`Gtk.Widget.drag_source_set` and :meth:`Gtk.Widget.drag_dest_set` some specialised widgets require the use of specific functions (such as :class:`Gtk.TreeView` and :class:`Gtk.IconView`).
pt_br: Em vez de usar :meth:`Gtk.Widget.drag_source_set` e :meth:`Gtk.Widget.drag_dest_set` alguns widgets especializados requerem o uso de funções específicas (como :class:`Gtk.TreeView` e :class:`Gtk.IconView`).
sv: Istället för att använda :meth:`Gtk.Widget.drag_source_set` och :meth:`Gtk.Widget.drag_dest_set` så kräver vissa specialiserade komponenter användningen av specifika funktioner (så som :class:`Gtk.TreeView` och :class:`Gtk.IconView`).

source: A basic drag and drop only requires the source to connect to the "drag-data-get" signal and the destination to connect to the "drag-data-received" signal. More complex things such as specific drop areas and custom drag icons will require you to connect to :ref:`additional signals <drag-signals>` and interact with the :class:`Gdk.DragContext` object it supplies.
pt_br: Um arrastar e soltar básico requer apenas que a fonte se conecte ao sinal "drag-data-get" e que o destino se conecte ao sinal "drag-data-received". Coisas mais complexas, como áreas de queda específicas e ícones de arrastar personalizados, exigirão que você se conecte a :ref:`sinais adicionais <drag-signals>` e interaja com o objeto :class:`Gdk.DragContext` que fornece.
sv: Ett enkelt dra-och-släpp kräver bara att källan ansluter till signalen ”drag-data-get” och att målet ansluter till signalen ”drag-data-received”. Mer komplexa saker som specifika släppområden och anpassade dragikoner kommer kräva att du ansluter till :ref:`ytterligare signaler <drag-signals>` och interagerar med :class:`Gdk.DragContext`-objektet det tillhandahåller.

source: In order to transfer data between the source and destination, you must interact with the :class:`Gtk.SelectionData` variable supplied in the :ref:`"drag-data-get" <drag-signals>` and :ref:`"drag-data-received" <drag-signals>` signals using the :class:`Gtk.SelectionData` get and set methods.
pt_br: Para transferir dados entre a origem e o destino, você deve interagir com a variável :class:`Gtk.SelectionData` fornecida no :ref:`"drag-data-get" <drag-signals>` e sinais de :ref:`"drag-data-received" <drag-signals>` usando os métodos get e set :class:`Gtk.SelectionData`.
sv: För att överföra data mellan källan och målet behöver du interagera med variabeln :class:`Gtk.SelectionData` som tillhandahålls i signalerna :ref:`”drag-data-get” <drag-signals>` och :ref:`”drag-data-received” <drag-signals>` med get- och set-metoderna för :class:`Gtk.SelectionData`.

source: Target Entries
pt_br: Alvos de Entrada
sv: Målfält

source: To allow the drag source and destination to know what data they are receiving and sending, a common list of :class:`Gtk.TargetEntry's <Gtk.TargetEntry>` are required. A :class:`Gtk.TargetEntry` describes a piece of data that will be sent by the drag source and received by the drag destination.
pt_br: Para permitir que a fonte de arrastar e o destino saibam quais dados estão recebendo e enviando, uma lista comum de :class:`Gtk.TargetEntry's <Gtk.TargetEntry>` é necessária. A :class:`Gtk.TargetEntry` descreve um dado que será enviado pela fonte de arrasto e recebido pelo destino do arrasto.
sv: För att dragningens källa och mål ska få veta vilka data de tar emot och skickar krävs en gemensam lista över :class:`Gtk.TargetEntry <Gtk.TargetEntry>`. Ett :class:`Gtk.TargetEntry` beskriver ett datastycke som kommer sändas av dragkällan och tas emot av dragmålet.

source: There are two ways of adding :class:`Gtk.TargetEntry's <Gtk.TargetEntry>` to a source and destination. If the drag and drop is simple and each target entry is of a different type, you can use the group of methods :meth:`mentioned here <Gtk.Widget.drag_source_add_text_targets>`.
pt_br: Existem duas maneiras de adicionar :class:`Gtk.TargetEntry's <Gtk.TargetEntry>` a uma origem e destino. Se o arrastar e soltar for simples e cada entrada de destino for de um tipo diferente, você pode usar o grupo de métodos mencionado aqui :meth:`<Gtk.Widget.drag_source_add_text_targets>`.
sv: Det finns två sätt att lägga till :class:`Gtk.TargetEntry <Gtk.TargetEntry>` till en källa och ett mål. Om dra-och-släppet är enkelt och varje målfält är av olika typ så kan du använda gruppen av metoder :meth:`omnämnda här <Gtk.Widget.drag_source_add_text_targets>`.

source: If you require more than one type of data or wish to do more complex things with the data, you will need to create the :class:`Gtk.TargetEntry's <Gtk.TargetEntry>` using the :meth:`Gtk.TargetEntry.new` method.
pt_br: Se você precisar de mais de um tipo de dados ou quiser fazer coisas mais complexas com os dados, você precisará criar o :class:`Gtk.TargetEntry's <Gtk.TargetEntry>` usando o método :meth:`Gtk.TargetEntry.new`.
sv: Om du behöver mer än en typ av data eller vill göra mer komplexa saker med dessa data kommer du behöva skapa ditt :class:`Gtk.TargetEntry <Gtk.TargetEntry>` med metoden :meth:`Gtk.TargetEntry.new`.

source: Drag Source Signals
pt_br: Sinais de Origem do Arrasto
sv: Dragkällsignaler

source: Name
pt_br: Nome
sv: Namn

source: When it is emitted
pt_br: Quando é emitido
sv: När den sänds ut

source: Common Purpose
pt_br: Propósito comum
sv: Vanligt syfte

source: User starts a drag
pt_br: Usuário inicia um arrasto
sv: Användaren startar en dragning

source: Set-up drag icon
pt_br: Configurar ícone de arrastar
sv: Konfigurera dragikon

source: When drag data is requested by the destination
pt_br: Quando dados arrastados são solicitados pelo destino
sv: Då dragningsdata begärs av målet

source: Transfer drag data from source to destination
pt_br: Transferir dados de arrastar da origem para o destino
sv: Överför dragningsdata från källan till målet

source: When a drag with the action Gdk.DragAction.MOVE is completed
pt_br: Quando um arrasto com a ação Gdk.DragAction.MOVE é concluído
sv: Då en dragning med åtgärden Gdk.DragAction.MOVE slutförts

source: Delete data from the source to complete the 'move'
pt_br: Excluir dados da fonte para completar o 'movimento'
sv: Ta bort data från källan för att slutföra ”flytten”

source: When the drag is complete
pt_br: Quando o arrasto estiver completo
sv: Då dragningen slutförts

source: Undo anything done in drag-begin
pt_br: Desfazer qualquer coisa feita no drag-begin
sv: Gör allt som gjorts i drag-begin ogjort

source: Drag Destination Signals
pt_br: Sinais de Destino do Arrasto
sv: Dragmålsignaler

source: Drag icon moves over a drop area
pt_br: O ícone de arrasto se move sobre uma área de soltar
sv: Dragikon flyttar över ett släppområde

source: Allow only certain areas to be dropped onto
pt_br: Permitir que apenas algumas áreas sejam soltas
sv: Tillåt endast vissa områden att släppas till

source: Icon is dropped onto a drag area
pt_br: O ícone é solto em uma área de arrasto
sv: Ikon släpps på ett dragområde

source: When drag data is received by the destination
pt_br: Quando dados arrastados são recebidos pelo destino
sv: När dragningsdata tas emot av målet

source: Entry widgets allow the user to enter text. You can change the contents with the :meth:`Gtk.Entry.set_text` method, and read the current contents with the :meth:`Gtk.Entry.get_text` method. You can also limit the number of characters the Entry can take by calling :meth:`Gtk.Entry.set_max_length`.
pt_br: Widgets de entrada permitem que o usuário insira texto. Você pode alterar o conteúdo com o método :meth:`Gtk.Entry.set_text` e ler o conteúdo atual com o método :meth:`Gtk.Entry.get_text`. Você também pode limitar o número de caracteres que a Entrada pode receber chamando :meth:`Gtk.Entry.set_max_length`.
sv: Entry-komponenter låter användaren mata in text. Du kan ändra innehållet med metoden :meth:`Gtk.Entry.set_text`, och läsa det aktuella innehållet med metoden :meth:`Gtk.Entry.get_text`. Du kan också begränsa antalet tecken ditt Entry kan innehålla genom att anropa :meth:`Gtk.Entry.set_max_length`.

source: Occasionally you might want to make an Entry widget read-only. This can be done by passing ``False`` to the :meth:`Gtk.Entry.set_editable` method.
pt_br: Ocasionalmente, você pode querer tornar um widget de Entrada somente leitura. Isto pode ser feito passando ``False`` para o método :meth:`Gtk.Entry.set_editable`.
sv: Emellanåt kan du vilja göra en Entry-komponent skrivskyddad. Detta kan göras genom att skicka ``False`` till metoden :meth:`Gtk.Entry.set_editable`.

source: Entry widgets can also be used to retrieve passwords from the user. It is common practice to hide the characters typed into the entry to prevent revealing the password to a third party. Calling :meth:`Gtk.Entry.set_visibility` with ``False`` will cause the text to be hidden.
pt_br: Os widgets de entrada também podem ser usados para recuperar senhas do usuário. É uma prática comum ocultar os caracteres digitados na entrada para evitar revelar a senha a terceiros. Chamando :meth:`Gtk.Entry.set_visibility` com ``False`` fará com que o texto fique oculto.
sv: Entry-komponenter kan också användas för att ta emot lösenord från användaren. Det är praxis att dölja tecknen som skrivs in i fältet för att undvika att avslöja lösenordet till en tredje part. Att anropa :meth:`Gtk.Entry.set_visibility` med ``False`` får texten att döljas.

source: :class:`Gtk.Entry` has the ability to display progress or activity information behind the text. This is similar to :class:`Gtk.ProgressBar` widget and is commonly found in web browsers to indicate how much of a page download has been completed. To make an entry display such information, use :meth:`Gtk.Entry.set_progress_fraction`, :meth:`Gtk.Entry.set_progress_pulse_step`, or :meth:`Gtk.Entry.progress_pulse`.
pt_br: :class:`Gtk.Entry` tem a capacidade de exibir informações de progresso ou atividade por trás do texto. Isso é semelhante ao widget :class:`Gtk.ProgressBar` e é comumente encontrado em navegadores da Web para indicar quanto de um download de página foi concluído. Para fazer uma entrada exibir tais informações, use :meth:`Gtk.Entry.set_progress_fraction`, :meth:`Gtk.Entry.set_progress_pulse_step` ou :meth:`Gtk.Entry.progress_pulse`.
sv: :class:`Gtk.Entry` har förmågan att visa förlopps- eller aktivitetsinformation bakom texten. Detta liknar :class:`Gtk.ProgressBar`-komponenten och hittas vanligen i webbläsare för att indikera hur mycket av en sidhämtning som har slutförts. För att få ett inmatningsfält att visa sådan information, använd :meth:`Gtk.Entry.set_progress_fraction`, :meth:`Gtk.Entry.set_progress_pulse_step` eller :meth:`Gtk.Entry.progress_pulse`.

source: Additionally, an Entry can show icons at either side of the entry. These icons can be activatable by clicking, can be set up as drag source and can have tooltips. To add an icon, use :meth:`Gtk.Entry.set_icon_from_icon_name` or one of the various other functions that set an icon from an icon name, a pixbuf, or icon theme. To set a tooltip on an icon, use :meth:`Gtk.Entry.set_icon_tooltip_text` or the corresponding function for markup.
pt_br: Além disso, uma entrada pode mostrar ícones em ambos os lados da entrada. Esses ícones podem ser ativados clicando, podem ser configurados como fonte de arrastar e podem ter dicas de ferramentas. Para adicionar um ícone, use :meth:`Gtk.Entry.set_icon_from_icon_name` ou uma das várias outras funções que definem um ícone a partir de um nome de ícone, um pixbuf ou tema de ícone. Para definir uma dica de ferramenta em um ícone, use :meth:`Gtk.Entry.set_icon_tooltip_text` ou a função correspondente para marcação.
sv: Vidare kan ett Entry visa ikoner på endera sida av fältet. Dessa ikoner kan vara aktiverbara genom klick, kan ställas in som en dragkälla och kan ha inforutor. För att lägga till en ikon, använd :meth:`Gtk.Entry.set_icon_from_icon_name` eller en av de andra funktionerna som ställer in en ikon från ett ikonnamn, en pixbuf eller ett ikontema. För att ställa in en inforuta på en ikon, använd :meth:`Gtk.Entry.set_icon_tooltip_text` eller motsvarande funktion för markup.

source: Expanders allow to dynamically hide or show information within a window or dialog. An expander can take a single widget that will be displayed when expanded.
sv: Expanderare låter dig dynamiskt dölja eller visa information i ett fönster eller en dialog. En expanderare kan ta en ensam komponent som kommer att visas när den expanderas.

source: Expanders remain expanded until clicked again. When the state of an expander is changed, the "activate" signal is emitted.
sv: Expanderare förblir expanderade tills de klickas på igen. När tillståndet för en expanderare ändras sänds signalen ”activate” ut.

source: An expander can be programmatically expanded or collapsed by passing `True` or `False` to :meth:`Gtk.Expander.set_expanded`. Note that doing so causes the "activate" signal to be emitted.
sv: En expanderare kan programmatiskt expanderas eller fällas ihop genom skicka `True` eller `False` till :meth:`Gtk.Expander.set_expanded`. Observera att göra så får signalen ”activate” att sändas ut.

source: More than one widget, such as a :class:`Gtk.Label` and :class:`Gtk.Button`, can be added by appending them to a :class:`Gtk.Box`.
sv: Mer än en komponent, så som en :class:`Gtk.Label` och :class:`Gtk.Button`, kan läggas till genom att lägga till dem till en :class:`Gtk.Box`.

source: Widget Gallery
sv: Komponentgalleri
