Repository: sebp/PyGObject-Tutorial
Catalog: translations/po/*.po
Languages: pt_br, sv

source: Signals can be emitted using :meth:`GObject.GObject.emit`:
pt_br: Os sinais podem ser emitidos usando :meth:`GObject.GObject.emit`:
sv: Signaler kan sändas ut med :meth:`GObject.GObject.emit`:

source: One of GObject's nice features is its generic get/set mechanism for object properties. Each class inherited from :class:`GObject.GObject` can define new properties. Each property has a type which never changes (e.g. str, float, int...). For instance, they are used for :class:`Gtk.Button` where there is a "label" property which contains the text of the button.
pt_br: Um dos ótimos recursos do GObject é seu mecanismo get/set genérico para propriedades de objetos. Cada classe herdada de :class:`GObject.GObject` pode definir novas propriedades. Cada propriedade tem um tipo que nunca muda (por exemplo, str, float, int ...). Por exemplo, eles são usados para :class:`Gtk.Button` onde existe uma propriedade "label" que contém o texto do botão.
sv: En av de trevliga funktionerna med GObject är dess allmäna get/set-mekanism för objektegenskaper. Varje klass som ärver från :class:`GObject.GObject` kan definiera nya egenskaper. Varje egenskap har en typ som aldrig ändras (t.ex. str, float, int…). De används exempelvis för :class:`Gtk.Button` där det finns en egenskap ”label” som innehåller knappens text.

source: Use existing properties
pt_br: Use propriedades existentes
sv: Använd befintliga egenskaper

source: The class :class:`GObject.GObject` provides several useful functions to manage existing properties, :func:`GObject.GObject.get_property` and :func:`GObject.GObject.set_property`.
pt_br: A classe :class:`GObject.GObject` fornece várias funções úteis para gerenciar propriedades existentes, :func:`GObject.GObject.get_property` e :func:`GObject.GObject.set_property`.
sv: Klassen :class:`GObject.GObject` tillhandahåller flera användbara funktioner för att hantera befintliga egenskaper, :func:`GObject.GObject.get_property` och :func:`GObject.GObject.set_property`.

source: Some properties also have functions dedicated to them, called getter and setter. For the property "label" of a button, there are two functions to get and set them, :func:`Gtk.Button.get_label` and :func:`Gtk.Button.set_label`.
pt_br: Algumas propriedades também possuem funções dedicadas a elas, chamadas de getter e setter. Para a propriedade "label" de um botão, existem duas funções para obter e configurá-las, :func:`Gtk.Button.get_label` e :func:`Gtk.Button.set_label`.
sv: Vissa egenskaper har också avsedda get- och set-funktioner. För egenskapen ”label” för en knapp finns det två funktioner för att erhålla och ställa in den, :func:`Gtk.Button.get_label` och :func:`Gtk.Button.set_label`.

source: Create new properties
pt_br: Crie novas propriedades
sv: Skapa nya egenskaper

source: A property is defined with a name and a type. Even if Python itself is dynamically typed, you can't change the type of a property once it is defined. A property can be created using :class:`GObject.Property`.
pt_br: Uma propriedade é definida com um nome e um tipo. Mesmo se o próprio Python for digitado dinamicamente, você não poderá alterar o tipo de uma propriedade depois que ela for definida. Uma propriedade pode ser criada usando :class:`GObject.Property`.
sv: En egenskap definieras med ett namn och en typ. Även om Python i sig är dynamiskt typat så kan du inte ändra typen för en egenskap efter att den definierats. En egenskap kan skapas med :class:`GObject.Property`.

source: Properties can also be read-only, if you want some properties to be readable but not writable. To do so, you can add some flags to the property definition, to control read/write access. Flags are :const:`GObject.ParamFlags.READABLE` (only read access for external code), :const:`GObject.ParamFlags.WRITABLE` (only write access), :const:`GObject.ParamFlags.READWRITE` (public):
pt_br: As propriedades também podem ser somente leitura, se você quiser que algumas propriedades sejam legíveis, mas não graváveis. Para fazer isso, você pode adicionar alguns sinalizadores à definição da propriedade, para controlar o acesso de leitura/gravação. Sinalizadores são :const:`GObject.ParamFlags.READABLE` (somente acesso de leitura para código externo), :const:`GObject.ParamFlags.WRITABLE` (somente acesso de gravação), :const:`GObject.ParamFlags.READWRITE` (publico):
sv: Egenskaper kan också vara skrivskyddade om du vill att några egenskaper ska vara läsbara men inte skrivbara. För att göra detta kan du lägga till några flaggor till egenskapsdefinitionen för att styra läs/skriv-åtkomst. Flaggor är :const:`GObject.ParamFlags.READABLE` (endast läsåtkomst för extern kod), :const:`GObject.ParamFlags.WRITABLE` (endast skrivåtkomst), :const:`GObject.ParamFlags.READWRITE` (öppen):

source: You can also define new read-only properties with a new method decorated with :class:`GObject.Property`:
pt_br: Você também pode definir novas propriedades somente leitura com um novo método decorado com :class:`GObject.Property`:
sv: Du kan också definiera nya skrivskyddade egenskaper med en ny metod dekorerad med :class:`GObject.Property`:

source: You can get this property using:
pt_br: Você pode obter essa propriedade usando:
sv: Du kan få denna egenskap med:

source: The API of :class:`GObject.Property` is similar to the builtin :py:func:`property`. You can create property setter in a way similar to Python property:
pt_br: A API de :class:`GObject.Property` é semelhante ao construído em :py:func:`property`. Você pode criar o setter de propriedades de maneira semelhante à propriedade Python:
sv: API:t för :class:`GObject.Property` liknar den inbyggda :py:func:`property`. Du kan skapa egenskapsinställare på ett sätt liknande Python-egenskaper:

source: There is also a way to define minimum and maximum values for numbers, using a more verbose form:
pt_br: Há também uma maneira de definir valores mínimos e máximos para números, usando um formulário mais detalhado:
sv: Det finns också ett sätt att definiera minsta och största värden för tal, med en mer utförlig form:

source: Properties must be defined in :attr:`GObject.GObject.__gproperties__`, a dictionary, and handled in do_get_property and do_set_property.
pt_br: As propriedades devem ser definidas em :attr:`GObject.GObject.__gproperties__`, um dicionário e manipulado em do_get_property e do_set_property.
sv: Egenskaper måste definieras i :attr:`GObject.GObject.__gproperties__`, en ordbok, och hanteras i do_get_property och do_set_property.

source: Watch properties
pt_br: Veja as propriedades
sv: Bevaka egenskaper

source: When a property is modified, a signal is emitted, whose name is "notify::property-name":
pt_br: Quando uma propriedade é modificada, um sinal é emitido, cujo nome é "notify::property-name":
sv: När en egenskap ändras sänds en signal ut, vars namn är ”notify::egenskapsnamn”:

source: Note that you have to use the canonical property name when connecting to the notify signals, as explained in :func:`GObject.Object.signals.notify`. For instance, for a Python property `foo_bar_baz` you would connect to the signal `notify::foo-bar-baz` using
pt_br: Note que você tem que usar o nome da propriedade canônica ao se conectar aos sinais de notificação, como explicado em :func:`GObject.Object.signals.notify`. Por exemplo, para uma propriedade Python `foo_bar_baz` você conectaria ao sinal `notify::foo-bar-baz` usando
sv: Observera att du måste använda det kanoniska egenskapsnamnet då du ansluter till notify-signalerna, som förklaras i :func:`GObject.Object.signals.notify`. För en Python-egenskap `foo_bar_baz` skulle du exempelvis ansluta till signalen `notify::foo-bar-baz` med

source: Retrieves a property value.
pt_br: Recupera um valor de propriedade.
sv: Erhåller ett egenskapsvärde.

source: Set property *property_name* to *value*.
pt_br: Configure a propriedade *property_name* para *valor*.
sv: Ställer in egenskapen *property_name* till *value*.

source: Emit signal *signal_name*. Signal arguments must follow, e.g. if your signal is of type ``(int,)``, it must be emitted with::
pt_br: Emitir sinal *signal_name*. Argumentos de sinal devem seguir, por ex. se o seu sinal é do tipo ``(int,)``, deve ser emitido com::
sv: Sänd ut signalen *signal_name*. Signalargument måste följa, t.ex. om din signal är av typen ``(int,)`` så måste den sändas ut med::

source: This method freezes all the "notify::" signals (which are emitted when any property is changed) until the :meth:`thaw_notify` method is called.
pt_br: Este método congela todos os sinais "notify::" (que são emitidos quando qualquer propriedade é alterada) até que o método :meth:`thaw_notify` seja chamado.
sv: Denna metod fryser alla ”notify::”-signalerna (som sänds ut då någon egenskap ändras) till metoden :meth:`thaw_notify` anropas.

source: It recommended to use the *with* statement when calling :meth:`freeze_notify`, that way it is ensured that :meth:`thaw_notify` is called implicitly at the end of the block::
pt_br: Recomenda-se usar a instrução *with* ao chamar :meth:`freeze_notify`, dessa forma é assegurado que :meth:`thaw_notify` é chamado implicitamente no final do bloco::
sv: Det rekommenderas att använda *with*-satsen vid anrop av :meth:`freeze_notify`, på det viset säkerställs att :meth:`thaw_notify` anropas implicit i slutet på blocket::

source: Thaw all the "notify::" signals which were thawed by :meth:`freeze_notify`.
pt_br: Descongele todos os sinais "notify::" que foram descongelados por :meth:`freeze_notify`.
sv: Tina alla ”notify::”-signalerna som frystes av :meth:`freeze_notify`.

source: It is recommended to not call :meth:`thaw_notify` explicitly but use :meth:`freeze_notify` together with the *with* statement.
pt_br: Recomenda-se não chamar :meth:`thaw_notify` explicitamente mas use :meth:`freeze_notify` juntamente com a instrução *with*.
sv: Det rekommenderas att inte anropa :meth:`thaw_notify` explicit utan anropa :meth:`freeze_notify` tillsammans med *with*-satsen.

source: Blocks a handler of an instance so it will not be called during any signal emissions unless :meth:`handler_unblock` is called for that *handler_id*. Thus "blocking" a signal handler means to temporarily deactivate it, a signal handler has to be unblocked exactly the same amount of times it has been blocked before to become active again.
pt_br: Bloqueia um manipulador de uma instância para que ele não seja chamado durante qualquer emissão de sinal, a menos que :meth:`handler_unblock` seja chamado para aquele *handler_id*. Assim, "bloqueando" um manipulador de sinal significa desativá-lo temporariamente, um manipulador de sinal precisa ser desbloqueado exatamente na mesma quantidade de vezes que foi bloqueado antes de se tornar ativo novamente.
sv: Blockerar en hanterare av en instans så att den inte kommer att anropas under några signalutsändningar om inte :meth:`handler_unblock` anropas för detta *handler_id*. Att ”blockera” en signalhanterare betyder därmed att tillfälligt inaktivera den, en signalhanterare behöver avblockeras exakt det antal gånger som den har blockerats innan den blir aktiv igen.

source: It is recommended to use :meth:`handler_block` in conjunction with the *with* statement which will call :meth:`handler_unblock` implicitly at the end of the block::
pt_br: Recomenda-se usar :meth:`handler_block` em conjunto com a instrução *with* que irá chamar :meth:`handler_unblock` implicitamente no final do bloco::
sv: Det rekommenderas att använda :meth:`handler_block` tillsammans med *with*-satsen som kommer anropa :meth:`handler_unblock` implicit i slutet på blocket::

source: Undoes the effect of :meth:`handler_block`. A blocked handler is skipped during signal emissions and will not be invoked until it has been unblocked exactly the amount of times it has been blocked before.
pt_br: Desfaz o efeito de :meth:`handler_block`. Um manipulador bloqueado é ignorado durante as emissões do sinal e não será chamado até que tenha sido desbloqueado exatamente a quantidade de vezes que foi bloqueado antes.
sv: Gör effekten av :meth:`handler_block` ogjord. En blockerad hanterare hoppas över under signalutsändningar och kommer inte anropas förrän den har avblockerats exakt det antal gånger som den tidigare blockerats.

source: It is recommended to not call :meth:`handler_unblock` explicitly but use :meth:`handler_block` together with the *with* statement.
pt_br: É recomendado não chamar explicitamente :meth:`handler_unblock` mas use :meth:`handler_block` junto com a instrução *with*.
sv: Det rekommenderas att inte anropa :meth:`handler_unblock` explicit utan anropa :meth:`handler_block` tillsammans med *with*-satsen.

source: A dictionary where inherited class can define new signals.
pt_br: Um dicionário onde a classe herdada pode definir novos sinais.
sv: En ordbok där en ärvd klass kan definiera nya signaler.

source: Each element in the dictionary is a new signal. The key is the signal name. The value is a tuple, with the form::
pt_br: Cada elemento no dicionário é um novo sinal. A chave é o nome do sinal. O valor é uma tupla, com o formato:
sv: Varje element i ordboken är en ny signal. Nyckeln är signalnamnet. Värdet är en tupel med formen::

source: :const:`GObject.SIGNAL_RUN_FIRST` can be replaced with :const:`GObject.SIGNAL_RUN_LAST` or :const:`GObject.SIGNAL_RUN_CLEANUP`. ``None`` is the return type of the signal. ``(int,)`` is the tuple of the parameters of the signal.
sv: :const:`GObject.SIGNAL_RUN_FIRST` kan ersättas med :const:`GObject.SIGNAL_RUN_LAST` eller :const:`GObject.SIGNAL_RUN_CLEANUP`. ``None`` är returtypen för signalen. ``(int,)`` är parametertupeln för signalen.

source: The :attr:`__gproperties__` dictionary is a class property where you define the properties of your object. This is not the recommend way to define new properties, the method written above is much less verbose. The benefits of this method is that a property can be defined with more settings, like the minimum or the maximum for numbers.
pt_br: O dicionário :attr:`__gproperties__` é uma propriedade de classe onde você define as propriedades do seu objeto. Esta não é a maneira recomendada de definir novas propriedades, o método escrito acima é muito menos detalhado. Os benefícios desse método é que uma propriedade pode ser definida com mais configurações, como o mínimo ou o máximo para números.
sv: Ordboken :attr:`__gproperties__` är en klassegenskap där du definierar ditt objekts egenskaper. Detta är inte det rekommenderade sättet att skapa nya egenskaper, metoden ovan är mycket kortare. Fördelarna med denna metod är att en egenskap kan definieras med fler inställningar, som minsta eller största värde för tal.

source: The key is the name of the property
pt_br: A chave é o nome da propriedade
sv: Nyckeln är namnet på egenskapen

source: The value is a tuple which describe the property. The number of elements of this tuple depends on its first element but the tuple will always contain at least the following items:
pt_br: O valor é uma tupla que descreve a propriedade. O número de elementos dessa tupla depende de seu primeiro elemento, mas a tupla sempre conterá pelo menos os seguintes itens:
sv: Värdet är en tupel som beskriver egenskapen. Antalet element i denna tupel beror på dess första element, men tupeln kommer alltid innehålla åtminstone följande objekt:

source: The first element is the property's type (e.g. ``int``, ``float``...).
pt_br: O primeiro elemento é o tipo da propriedade (por exemplo, ``int``, ``float``...).
sv: Det första elementet är egenskapens typ (t.ex. ``int``, ``float``…).

source: The second element is the property's nick name, which is a string with a short description of the property. This is generally used by programs with strong introspection capabilities, like the graphical user interface builder `Glade`_.
pt_br: O segundo elemento é o apelido da propriedade, que é uma string com uma breve descrição da propriedade. Isso geralmente é usado por programas com fortes recursos de introspecção, como o construtor de interface gráfica de usuário `Glade`_.
sv: Det andra elementet är egenskapens smeknamn, vilket är en sträng med en kort beskrivning av egenskapen. Detta används vanligen av program med starka introspektionsförmågor, som den grafiska användargränssnittsbyggaren `Glade`_.

source: The third one is the property's description or blurb, which is another string with a longer description of the property. Also used by `Glade`_ and similar programs.
pt_br: A terceira é a descrição da propriedade ou sinopse, que é outra string com uma descrição mais longa da propriedade. Também usado pelo `Glade`_ e programas similares.
sv: Det tredje är egenskapens beskrivning eller blurb, vilket är en annan sträng med en längre beskrivning av egenskapen. Används också av `Glade`_ och liknande program.

source: The last one (which is not necessarily the forth one as we will see later) is the property's flags: :const:`GObject.PARAM_READABLE`, :const:`GObject.PARAM_WRITABLE`, :const:`GObject.PARAM_READWRITE`.
pt_br: O último (que não é necessariamente o último, como veremos mais adiante) é o sinalizador da propriedade :const:`GObject.PARAM_READABLE`, :const:`GObject.PARAM_WRITABLE`, :const:`GObject.PARAM_READWRITE`.
sv: Det sista (vilket inte nödvändigtvis är det fjärde som vi kommer se senare) är egenskapens flaggor: :const:`GObject.PARAM_READABLE`, :const:`GObject.PARAM_WRITABLE`, :const:`GObject.PARAM_READWRITE`.

source: The absolute length of the tuple depends on the property type (the first element of the tuple). Thus we have the following situations:
pt_br: O comprimento absoluto da tupla depende do tipo de propriedade (o primeiro elemento da tupla). Assim, temos as seguintes situações:
sv: Den absoluta längden på tupeln beror på egenskapstypen (tupelns första element). Därmed har vi följande situationer:

source: If the type is ``bool`` or ``str``, the forth element is the default value of the property.
pt_br: Se o tipo for ``bool`` ou ``str``, o quarto elemento é o valor padrão da propriedade.
sv: Om typen är ``bool`` eller ``str`` så är det fjärde elementet standardvärdet för egenskapen.

source: If the type is ``int`` or ``float``, the forth element is the minimum accepted value, the fifth element is the maximum accepted value and the sixth element is the default value.
pt_br: Se o tipo for ``int`` ou ``float``, o quarto elemento é o valor mínimo aceito, o quinto elemento é o valor máximo aceito e o sexto elemento é o valor padrão.
sv: Om typen är ``int`` eller ``float`` så är det fjärde elementet det minsta accepterade värdet, det femte elementet det största accepterade värdet, och det sjätte elementet är standardvärdet.

source: If the type is not one of these, there is no extra element.
pt_br: Se o tipo não for um desses, não há elemento extra.
sv: Om typen inte är någon av dessa så finns det inget extra element.

source: Invoke the object method handler in the first emission stage.
pt_br: Invoque o manipulador de método de objeto no primeiro estágio de emissão.
sv: Anropa objektets metodhanterare i det första utsändningssteget.

source: Invoke the object method handler in the third emission stage.
pt_br: Invoque o manipulador de método de objeto no terceiro estágio de emissão.
sv: Anropa objektets metodhanterare i det tredje utsändningssteget.

source: Invoke the object method handler in the last emission stage.
pt_br: Invoque o manipulador do método de objeto no último estágio de emissão.
sv: Anropa objektets metodhanterare i det sista utsändningssteget.

source: The property is readable.
pt_br: A propriedade é legível.
sv: Egenskapen är läsbar.

source: The property is writable.
pt_br: A propriedade é gravável.
sv: Egenskapen är skrivbar.

source: The property is readable and writable.
pt_br: A propriedade é legível e gravável.
sv: Egenskapen är läsbar och skrivbar.

source: Popovers
sv: Kontextfönster

source: The :class:`Gtk.Popover` is a separate window used for displaying additional information and is often used with button menus and context menus. Popovers are visually connected to a related widget with a small triangle. Their uses are similar to those of dialog windows with the advantage of being less disruptive and having a connection with the widget the popover is pointing to.
sv: :class:`Gtk.Popover` är ett separat fönster som används för att visa ytterligare information och ofta används som en del av knappmenyer och snabbvalsmenyer. Kontextfönster är visuellt anslutna till en relaterad komponent med en liten triangel. Deras användning liknar de hos dialogfönster med fördelen att de är mindre störande och har en anslutning till komponenten som kontextfönstret pekar på.

source: A Popover can be created with :class:`Gtk.Popover`; for opening the popover use :meth:`Gtk.Popover.popup`.
sv: Ett kontextfönster kan skapas med :class:`Gtk.Popover`; använd :meth:`Gtk.Popover.popup` för att öppna kontextfönstret.

source: Custom Popover
pt_br: Popover Personalizado
sv: Anpassat kontextfönster

source: A widget can be added to a popover using :meth:`Gtk.Container.add`.
sv: En komponent kan läggas till ett kontextfönster med :meth:`Gtk.Container.add`.

source: Menu Popover
sv: Menykontextfönster

source: A popover can be created from a :class:`Gio.MenuModel` using :meth:`Gtk.Popover.new_from_model` and can be changed after creation with :meth:`Gtk.Popover.bind_model`.
pt_br: Um popover pode ser criado a partir de :class:`Gio.MenuModel` usando :meth:`Gtk.Popover.new_from_model` e pode ser alterado após a criação com :meth:`Gtk.Popover.bind_model`.
sv: Ett kontextfönster kan skapas från en :class:`Gio.MenuModel` med :meth:`Gtk.Popover.new_from_model` och kan ändras efter att det skapats med :meth:`Gtk.Popover.bind_model`.

source: Passing a :class:`Gio.MenuModel` as a :data:`menu_model <Gtk.MenuButton.props.menu_model>` argument to the :class:`Gtk.MenuButton` constructor implicitly creates a popover.
sv: Att skicka en :class:`Gio.MenuModel` som ett :data:`menu_model <Gtk.MenuButton.props.menu_model>`-argument till :class:`Gtk.MenuButton`-konstruktorn skapar implicit ett kontextfönster.

source: https://developer.gnome.org/hig/stable/popovers.html.en
sv: https://developer.gnome.org/hig/stable/popovers.html.sv

source: The :class:`Gtk.ProgressBar` is typically used to display the progress of a long running operation. It provides a visual clue that processing is underway. The :class:`Gtk.ProgressBar` can be used in two different modes: *percentage mode* and *activity mode*.
pt_br: O :class:`Gtk.ProgressBar` é normalmente usado para exibir o progresso de uma operação longa. Ele fornece uma pista visual de que o processamento está em andamento. O :class:`Gtk.ProgressBar` pode ser usado em dois modos diferentes: *modo de porcentagem* e *modo de atividade*.
sv: :class:`Gtk.ProgressBar` används typiskt för att visa förloppet för en operation som pågår länge. Den tillhandahåller en visuell ledtråd om att bearbetning pågår. :class:`Gtk.ProgressBar` kan användas i två olika lägen: *procentläge* och *aktivitetsläge*.
