Repository: sebp/PyGObject-Tutorial
Catalog: translations/po/*.po
Languages: pt_br, sv

source: There are many configuration options for GtkNotebook. Among other things, you can choose on which edge the tabs appear (see :meth:`Gtk.Notebook.set_tab_pos`), whether, if there are too many tabs to fit the notebook should be made bigger or scrolling arrows added (see :meth:`Gtk.Notebook.set_scrollable`, and whether there will be a popup menu allowing the users to switch pages (see :meth:`Gtk.Notebook.popup_enable`, :meth:`Gtk.Notebook.popup_disable`).
pt_br: Existem muitas opções de configuração para o GtkNotebook. Entre outras coisas, você pode escolher em qual borda as abas aparecem (veja :meth:`Gtk.Notebook.set_tab_pos`), se houver muitas abas para caber no notebook, elas devem ser maiores ou setas de rolagem serão adicionadas (veja :meth:`Gtk.Notebook.set_scrollable`, e se haverá um menu pop-up que permita aos usuários trocar de página (veja :meth:`Gtk.Notebook.popup_enable`, :meth:`Gtk.Notebook.popup_disable`).
sv: Det finns många konfigurationsalternativ för GtkNotebook. Bland annat kan du välja på vilken kant flikarna visas (se :meth:`Gtk.Notebook.set_tab_pos`), huruvida anteckningsboken ska göras större eller om rullningspilar ska läggas till då det finns för många flikar för att rymmas (se :meth:`Gtk.Notebook.set_scrollable`), och huruvida det ska finnas en poppuppmeny som låter användarna växla sidor (se :meth:`Gtk.Notebook.popup_enable`, :meth:`Gtk.Notebook.popup_disable`).

source: :class:`Gtk.Table` has been deprecated since GTK+ version 3.4 and should not be used in newly-written code. Use the :ref:`layout-grid` class instead.
pt_br: :class:`Gtk.Table` foi descontinuado desde o GTK+ versão 3.4 e não deve ser usado em código recém-escrito. Use a classe :ref:`layout-grid`.
sv: :class:`Gtk.Table` är föråldrat sedan GTK+ version 3.4 och bör inte användas i nyskriven kod. Använd klassen :ref:`layout-grid` istället.

source: Tables allows us to place widgets in a grid similar to :class:`Gtk.Grid`.
pt_br: Tabelas nos permite colocar widgets em uma grade similar a :class:`Gtk.Grid`.
sv: Tabeller låter oss placera komponenter i ett rutnät liknande :class:`Gtk.Grid`.

source: The grid's dimensions need to be specified in the :class:`Gtk.Table` constructor. To place a widget into a box, use :meth:`Gtk.Table.attach`.
pt_br: As dimensões da grade precisam ser especificadas no construtor :class:`Gtk.Table`. Para colocar um widget em uma caixa, use :meth:`Gtk.Table.attach`.
sv: Rutnätets dimensioner behöver anges i :class:`Gtk.Table`-konstruktorn. För att placera en komponent i en ruta, använd :meth:`Gtk.Table.attach`.

source: :meth:`Gtk.Table.set_row_spacing` and :meth:`Gtk.Table.set_col_spacing` set the spacing between the rows at the specified row or column. Note that for columns, the space goes to the right of the column, and for rows, the space goes below the row.
pt_br: :meth:`Gtk.Table.set_row_spacing` e :meth:`Gtk.Table.set_col_spacing` definem o espaçamento entre as linhas na linha ou coluna especificada. Observe que, para colunas, o espaço vai para a direita da coluna e, para linhas, o espaço fica abaixo da linha.
sv: :meth:`Gtk.Table.set_row_spacing` och :meth:`Gtk.Table.set_col_spacing` ställer in utrymmet mellan raderna vid den angivna raden eller kolumnen. Observera att för kolumner hamnar utrymmet till höger om kolumnen, och för rader hamnar utrymmet under raden.

source: You can also set a consistent spacing for all rows and/or columns with :meth:`Gtk.Table.set_row_spacings` and :meth:`Gtk.Table.set_col_spacings`. Note that with these calls, the last row and last column do not get any spacing.
pt_br: Você também pode definir um espaçamento consistente para todas as linhas e/ou colunas com :meth:`Gtk.Table.set_row_spacings` e :meth:`Gtk.Table.set_col_spacings`. Observe que, com essas chamadas, a última linha e a última coluna não recebem espaçamento.
sv: Du kan också ställa in ett enhetligt avstånd för alla rader och/eller kolumner med :meth:`Gtk.Table.set_row_spacings` och :meth:`Gtk.Table.set_col_spacings`. Observera att med dessa anrop placeras inget utrymme efter den sista raden och sista kolumnen.

source: It is reccomened that you use the :class:`Gtk.Grid` for new code.
pt_br: É recomendado que você use o :class:`Gtk.Grid` para o novo código.
sv: Du rekommenderas använda :class:`Gtk.Grid` för ny kod.

source: :class:`Gtk.UIManager`, :class:`Gtk.Action`, and :class:`Gtk.ActionGroup` have been deprecated since GTK+ version 3.10 and should not be used in newly-written code. Use the :ref:`application` framework instead.
pt_br: :class:`Gtk.UIManager`, :class:`Gtk.Action` e :class:`Gtk.ActionGroup` foram descontinuados desde o GTK+ versão 3.10 e não devem ser usados em código recém-escrito. Use o framework :ref:`application`.
sv: :class:`Gtk.UIManager`, :class:`Gtk.Action` och :class:`Gtk.ActionGroup` är föråldrade sedan GTK+ version 3.4 och bör inte användas i nyskriven kod. Använd ramverket :ref:`application` istället.

source: GTK+ comes with two different types of menus, :class:`Gtk.MenuBar` and :class:`Gtk.Toolbar`. :class:`Gtk.MenuBar` is a standard menu bar which contains one or more :class:`Gtk.MenuItem` instances or one of its subclasses. :class:`Gtk.Toolbar` widgets are used for quick accessibility to commonly used functions of an application. Examples include creating a new document, printing a page or undoing an operation. It contains one or more instances of :class:`Gtk.ToolItem` or one of its subclasses.
pt_br: O GTK+ vem com dois tipos diferentes de menus :class:`Gtk.MenuBar` e :class:`Gtk.Toolbar`. :class:`Gtk.MenuBar` é uma barra de menus padrão que contém uma ou mais instâncias :class:`Gtk.MenuItem` ou uma de suas subclasses. Os widgets :class:`Gtk.Toolbar` são usados para acessibilidade rápida às funções comumente usadas de um aplicativo. Exemplos incluem criar um novo documento, imprimir uma página ou desfazer uma operação. Ele contém uma ou mais instâncias de :class:`Gtk.ToolItem` ou uma de suas subclasses.
sv: GTK+ kommer med två olika sorters menyer, :class:`Gtk.MenuBar` och :class:`Gtk.Toolbar`. :class:`Gtk.MenuBar` är en standardmenyrad vilken innehåller en eller flera instanser av :class:`Gtk.MenuItem` eller en av dess underklasser. :class:`Gtk.Toolbar`-komponenter används för snabb åtkomst till vanligen använda funktioner för ett program. Exempel inkluderar att skapa ett nytt dokument, skriva ut en sida eller ångra en operation. Den innehåller en eller flera instanser av :class:`Gtk.ToolItem` eller en av dess underklasser.

source: Although, there are specific APIs to create menus and toolbars, you should use :class:`Gtk.UIManager` and create :class:`Gtk.Action` instances. Actions are organised into groups. A :class:`Gtk.ActionGroup` is essentially a map from names to :class:`Gtk.Action` objects. All actions that would make sense to use in a particular context should be in a single group. Multiple action groups may be used for a particular user interface. In fact, it is expected that most non-trivial applications will make use of multiple groups. For example, in an application that can edit multiple documents, one group holding global actions (e.g. quit, about, new), and one group per document holding actions that act on that document (eg. save, cut/copy/paste, etc). Each window's menus would be constructed from a combination of two action groups.
pt_br: Embora existam APIs específicas para criar menus e barras de ferramentas, você deve usar :class:`Gtk.UIManager` e criar instâncias :class:`Gtk.Action`. As ações são organizadas em grupos. A :class:`Gtk.ActionGroup` é essencialmente um mapa de nomes para objetos :class:`Gtk.Action`. Todas as ações que fazem sentido usar em um contexto particular devem estar em um único grupo. Vários grupos de ação podem ser usados para uma interface de usuário específica. Na verdade, espera-se que a maioria dos aplicativos não triviais faça uso de vários grupos. Por exemplo, em um aplicativo que pode editar vários documentos, um grupo mantém ações globais (por exemplo, sair, sobre, novo) e um grupo por documento que contém ações que atuam nesse documento (por exemplo, salvar, recortar/copiar/colar etc. ). Os menus de cada janela seriam construídos a partir de uma combinação de dois grupos de ação.
sv: Även om det finns specifika API:er för att skapa menyer och verktygsfält så bör du använda :class:`Gtk.UIManager` och skapa :class:`Gtk.Action`-instanser. Åtgärder organiseras i grupper. En :class:`Gtk.ActionGroup` är i huvudsak en avbildning från namn till :class:`Gtk.Action`-objekt. Alla åtgärder som skulle vara rimliga att använda i ett visst sammanhang bör vara i en enskild grupp. Flera åtgärdsgrupper kan användas för ett specifikt användargränssnitt. Det förväntas faktiskt att de flesta icke-triviala programmen använder flera grupper. Exempelvis ett program som kan redigera flera dokument, med en grupp som innehåller globala åtgärder (t.ex. avsluta, om, nytt), och en grupp per dokument som innehåller åtgärder som agerar på det dokumentet (t.ex. spara, klipp ut/kopiera/klistra in o.s.v.). Varje fönsters menyer skulle då konstrueras från en kombination av två åtgärdsgrupper.

source: Different classes representing different types of actions exist:
pt_br: Existem classes diferentes representando diferentes tipos de ações:
sv: Det finns olika klasser som representerar olika typer av åtgärd:

source: :class:`Gtk.Action`: An action which can be triggered by a menu or toolbar item
pt_br: :class:`Gtk.Action`: Uma ação que pode ser acionada por um item de menu ou barra de ferramentas
sv: :class:`Gtk.Action`: En åtgärd som kan utlösas genom ett meny- eller verktygsfältsobjekt

source: :class:`Gtk.ToggleAction`: An action which can be toggled between two states
pt_br: :class:`Gtk.ToggleAction`: Uma ação que pode ser alternada entre dois estados
sv: :class:`Gtk.ToggleAction`: En åtgärd som kan växlas mellan två tillstånd

source: :class:`Gtk.RadioAction`: An action of which only one in a group can be active
pt_br: :class:`Gtk.RadioAction`: Uma ação da qual apenas um em um grupo pode estar ativo
sv: :class:`Gtk.RadioAction`: En åtgärd för vilken endast en i en grupp kan vara aktiv

source: :class:`Gtk.RecentAction`: An action of which represents a list of recently used files
pt_br: :class:`Gtk.RecentAction`: Uma ação que representa uma lista de arquivos usados recentemente
sv: :class:`Gtk.RecentAction`: En åtgärd som representerar en lista över senast använda filer

source: Actions represent operations that the user can be perform, along with some information how it should be presented in the interface, including its name (not for display), its label (for display), an accelerator, whether a label indicates a tooltip as well as the callback that is called when the action gets activated.
pt_br: Ações representam operações que o usuário pode executar, juntamente com algumas informações sobre como ele deve ser apresentado na interface, incluindo seu nome (não para exibição), seu rótulo (para exibição), um acelerador, se um rótulo também indica uma dica de ferramenta como o retorno que é chamado quando a ação é ativada.
sv: Åtgärder representerar operationer som användaren kan utföra, tillsammans med lite information om hur det ska visas i gränssnittet, inklusive dess namn (ej för visning), dess etikett (för visning), en snabbtangent, huruvida en etikett indikerar en inforuta såväl som återanropet som anropas när åtgärden aktiveras.

source: You can create actions by either calling one of the constructors directly and adding them to a :class:`Gtk.ActionGroup` by calling :meth:`Gtk.ActionGroup.add_action` or :meth:`Gtk.ActionGroup.add_action_with_accel`, or by calling one of the convenience functions:
pt_br: Você pode criar ações chamando um dos construtores diretamente e adicionando-os a um :class:`Gtk.ActionGroup` chamando :meth:`Gtk.ActionGroup.add_action` ou :meth:`Gtk.ActionGroup.add_action_with_accel`, ou chamando uma das funções de conveniência:
sv: Du kan skapa åtgärder antingen genom att anropa en av konstruktorerna direkt och lägga till dem till en :class:`Gtk.ActionGroup` genom att anropa :meth:`Gtk.ActionGroup.add_action` eller :meth:`Gtk.ActionGroup.add_action_with_accel`, eller genom att anropa en av bekvämlighetsfunktionerna:

source: Note that you must specify actions for sub menus as well as menu items.
pt_br: Observe que você deve especificar ações para submenus e itens de menu.
sv: Observera att du måste ange åtgärder för undermenyer såväl som för menyobjekt.

source: UI Manager
pt_br: Gerenciador de IU
sv: Användargränssnittshanterare

source: :class:`Gtk.UIManager` provides an easy way of creating menus and toolbars using an `XML-like description <https://developer.gnome.org/gtk3/stable/GtkUIManager.html#XML-UI>`_.
sv: :class:`Gtk.UIManager` tillhandahåller ett enkelt sätt att skapa menyer och verktygsfält med en `XML-liknande beskrivning <https://developer.gnome.org/gtk3/stable/GtkUIManager.html#XML-UI>`_.

source: First of all, you should add the :class:`Gtk.ActionGroup` to the UI Manager with :meth:`Gtk.UIManager.insert_action_group`. At this point is also a good idea to tell the parent window to respond to the specified keyboard shortcuts, by using :meth:`Gtk.UIManager.get_accel_group` and :meth:`Gtk.Window.add_accel_group`.
pt_br: Primeiro de tudo, você deve adicionar o :class:`Gtk.ActionGroup` ao UI Manager com :meth:`Gtk.UIManager.insert_action_group`. Neste ponto também é uma boa idéia dizer à janela pai para responder aos atalhos de teclado especificados, usando :meth:`Gtk.UIManager.get_accel_group` e :meth:`Gtk.Window.add_accel_group`.
sv: Först bör du lägga till :class:`Gtk.ActionGroup` till användargränssnittshanteraren med :meth:`Gtk.UIManager.insert_action_group`. Vid denna punkt är det också god idé att säga till föräldrafönstret att svara på de angivna tangentbordsgenvägarna genom att använda :meth:`Gtk.UIManager.get_accel_group` och :meth:`Gtk.Window.add_accel_group`.

source: Then, you can define the actual visible layout of the menus and toolbars, and add the UI layout. This "ui string" uses an XML format, in which you should mention the names of the actions that you have already created. Remember that these names are just the identifiers that we used when creating the actions. They are not the text that the user will see in the menus and toolbars. We provided those human-readable names when we created the actions.
pt_br: Em seguida, você pode definir o layout visível real dos menus e barras de ferramentas e adicionar o layout da interface do usuário. Essa "string ui" usa um formato XML, no qual você deve mencionar os nomes das ações que você já criou. Lembre-se de que esses nomes são apenas os identificadores que usamos ao criar as ações. Eles não são o texto que o usuário verá nos menus e nas barras de ferramentas. Fornecemos esses nomes legíveis quando criamos as ações.
sv: Sedan kan du definiera den faktiska synliga layouten för menyerna och verktygsfälten, och lägga till användargränssnittslayouten. Denna ”ui-sträng” använder ett XML-format, i vilket du bör nämna namnen på åtgärderna som du redan skapat. Kom ihåg att dessa namn bara är identifierarna som vi använde då vi skapade åtgärderna. De är inte texten som användaren kommer se i menyerna och verktygsfälten. Vi tillhandahöll dessa mänskligt läsbara namn då vi skapade åtgärderna.

source: Finally, you retrieve the root widget with :meth:`Gtk.UIManager.get_widget` and add the widget to a container such as :class:`Gtk.Box`.
pt_br: Finalmente, você recupera o widget raiz com :meth:`Gtk.UIManager.get_widget` e adiciona o widget a um container como :class:`Gtk.Box`.
sv: Slutligen erhåller du rotkomponenten med :meth:`Gtk.UIManager.get_widget` och lägger till komponenten till en behållare så som :class:`Gtk.Box`.

source: Objects
sv: Objekt

source: GObject is the fundamental type providing the common attributes and methods for all object types in GTK+, Pango and other libraries based on GObject. The :class:`GObject.GObject` class provides methods for object construction and destruction, property access methods, and signal support.
pt_br: O GObject é o tipo fundamental que fornece os atributos e métodos comuns para todos os tipos de objeto no GTK+, no Pango e em outras bibliotecas baseadas no GObject. A classe :class:`GObject.GObject` fornece métodos para construção e destruição de objetos, métodos de acesso a propriedades e suporte a sinais.
sv: GObject är den grundläggande typen som tillhandahåller de gemensamma attributen och metoderna för alla objekttyper i GTK+, Pango och andra bibliotek baserade på GObject. Klassen :class:`GObject.GObject` tillhandahåller metoder för skapande och förstörande av objekt, åtkomstmetoder för egenskaper samt stöd för signaler.

source: This section will introduce some important aspects about the GObject implementation in Python.
pt_br: Esta seção apresentará alguns aspectos importantes sobre a implementação do GObject no Python.
sv: Detta avsnitt kommer introducera några viktiga aspekter om GObject-implementationen i Python.

source: Inherit from GObject.GObject
pt_br: Herdar de GObject.GObject
sv: Ärv från GObject.GObject

source: A native GObject is accessible via :class:`GObject.GObject`. It is rarely instantiated directly, we generally use inherited class. A :class:`Gtk.Widget` is an inherited class of a :class:`GObject.GObject`. It may be interesting to make an inherited class to create a new widget, like a settings dialog.
pt_br: Um GObject nativo é acessível via :class:`GObject.GObject`. É raramente instanciado diretamente, geralmente usamos classes herdadas. A :class:`Gtk.Widget` é uma classe herdada de um :class:`GObject.GObject`. Pode ser interessante criar uma classe herdada para criar um novo widget, como uma caixa de diálogo de configurações.
sv: Ett inhemskt GObject är åtkomligt via :class:`GObject.GObject`. Det instansieras sällan direkt, vi använder i allmänhet ärvda klasser. En :class:`Gtk.Widget` är en ärvd klass av ett :class:`GObject.GObject`. Det kan vara intressant att göra en ärvd klass för att skapa en ny komponent, exempelvis en inställningsdialog.

source: To inherit from :class:`GObject.GObject`, you must call :meth:`GObject.GObject.__init__` in your constructor (if the class inherits from :class:`Gtk.Button`, it must call :func:`Gtk.Button.__init__` for instance), like in the example below:
pt_br: Para herdar de :class:`GObject.GObject`, você deve chamar :meth:`GObject.GObject.__init__` em seu construtor (se a classe herdar de :class:`Gtk.Button`, deve chamar :func:`Gtk.Button.__init__` por exemplo), como no exemplo abaixo:
sv: För att ärva från :class:`GObject.GObject` måste du anropa :meth:`GObject.GObject.__init__` i din konstruktor (om klassen exempelvis ärver från :class:`Gtk.Button` så måste den anropa :func:`Gtk.Button.__init__`), som i exemplet nedan:

source: Signals
pt_br: Sinais
sv: Signaler

source: Signals connect arbitrary application-specific events with any number of listeners. For example, in GTK+, every user event (keystroke or mouse move) is received from the X server and generates a GTK+ event under the form of a signal emission on a given object instance.
pt_br: Os sinais conectam eventos específicos de aplicativos arbitrários com qualquer número de ouvintes. Por exemplo, no GTK+, cada evento de usuário (pressionamento de tecla ou mouse) é recebido do servidor X e gera um evento GTK+ sob a forma de uma emissão de sinal em uma determinada instância de objeto.
sv: Signaler ansluter godtyckliga programspecifika händelser till ett valfritt antal lyssnare. Till exempel så tas i GTK+ varje användarhändelse (tangenttryckning eller musrörelse) emot från X-servern och genererar en GTK+-händelse i form av en signalutsändning på en given objektinstans.

source: Each signal is registered in the type system together with the type on which it can be emitted: users of the type are said to connect to the signal on a given type instance when they register a function to be invoked upon the signal emission. Users can also emit the signal by themselves or stop the emission of the signal from within one of the functions connected to the signal.
pt_br: Cada sinal é registrado no sistema de tipos junto com o tipo no qual ele pode ser emitido: os usuários do tipo são conectados ao sinal em uma determinada instância de tipo quando registram uma função a ser invocada na emissão do sinal. Os usuários também podem emitir o sinal sozinhos ou interromper a emissão do sinal de dentro de uma das funções conectadas ao sinal.
sv: Varje signal registreras i typsystemet tillsammans med typen på vilken den kan sändas ut: användare av typen sägs ansluta till signalen på en given typinstans när de registrerar en funktion som ska anropas vid signalutsändning. Användare kan också sända ut signalen själva eller stoppa utsändningen av signalen inifrån en av funktionerna som är anslutna till signalen.

source: Receive signals
pt_br: Receba sinais
sv: Ta emot signaler

source: See :ref:`signals`
pt_br: Veja :ref:`signals`
sv: Se :ref:`signals`

source: Create new signals
pt_br: Crie novos sinais
sv: Skapa nya signaler

source: New signals can be created by adding them to :attr:`GObject.GObject.__gsignals__`, a dictionary:
pt_br: Novos sinais podem ser criados adicionando-os a :attr:`GObject.GObject.__gsignals__`, um dicionário:
sv: Nya signaler kan skapas genom att lägga till dem till :attr:`GObject.GObject.__gsignals__`, en ordbok:

source: When a new signal is created, a method handler can also be defined, it will be called each time the signal is emitted. It is called do_signal_name.
pt_br: Quando um novo sinal é criado, um manipulador de método também pode ser definido, ele será chamado toda vez que o sinal for emitido. É chamado do_signal_name.
sv: Då en ny signal skapas kan en metodhanterare också definieras, den kommer anropas varje gång signalen sänds ut. Den kallas do_signalnamn.

source: :const:`GObject.SIGNAL_RUN_FIRST` indicates that this signal will invoke the object method handler (:meth:`do_my_signal` here) in the first emission stage. Alternatives are :const:`GObject.SIGNAL_RUN_LAST` (the method handler will be invoked in the third emission stage) and :const:`GObject.SIGNAL_RUN_CLEANUP` (invoke the method handler in the last emission stage).
pt_br: :const:`GObject.SIGNAL_RUN_FIRST` indica que este sinal invocará o manipulador do método de objeto (:meth:`do_my_signal` aqui) no primeiro estágio de emissão. As alternativas são :const:`GObject.SIGNAL_RUN_LAST` (o manipulador de método será invocado no terceiro estágio de emissão) e :const:`GObject.SIGNAL_RUN_CLEANUP` (invoca o manipulador de método no último estágio de emissão).
sv: :const:`GObject.SIGNAL_RUN_FIRST` indikerar att denna signal kommer anropa objektets metodhanterare (här :meth:`do_my_signal`) i det första utsändningssteget. Alternativ är :const:`GObject.SIGNAL_RUN_LAST` (metodhanteraren kommer anropas i det tredje utsändningssteget) och :const:`GObject.SIGNAL_RUN_CLEANUP` (anropa metodhanteraren i det sista utsändningssteget).

source: The second part, ``None``, indicates the return type of the signal, usually ``None``.
pt_br: A segunda parte, ``None``, indica o tipo de retorno do sinal, geralmente ``None``.
sv: Den andra delen, ``None``, indikerar returtypen för signalen, vanligen ``None``.

source: ``(int,)`` indicates the signal arguments, here, the signal will only take one argument, whose type is int. Types of arguments required by signal are declared as a sequence, here it is a one-element tuple.
sv: ``(int,)`` indikerar signalargumenten, här kommer signalen bara ta ett argument, vars typ är int. Typer av argument som krävs av signalen deklareras som en sekvens, här är det en tupel med ett argument.
