Repository: sebp/PyGObject-Tutorial
Catalog: translations/po/*.po
Languages: pt_br, sv

source: It is also possible to load only some of the objects. The following line would add only the objects (and their child objects) given in the tuple.
pt_br: Também é possível carregar apenas alguns dos objetos. A linha a seguir adicionaria apenas os objetos (e seus objetos filhos) fornecidos na tupla.
sv: Det är också möjligt att bara läsa in några av objekten. Följande rad skulle bara lägga till de objekt (och deras barnobjekt) som anges i tupeln.

source: These two methods exist also for loading from a string rather than a file. Their corresponding names are :meth:`Gtk.Builder.add_from_string` and :meth:`Gtk.Builder.add_objects_from_string` and they simply take a XML string instead of a file name.
pt_br: Esses dois métodos também existem para o carregamento de uma string, em vez de um arquivo. Seus nomes correspondentes são :meth:`Gtk.Builder.add_from_string` e :meth:`Gtk.Builder.add_objects_from_string` e eles simplesmente pegam uma string XML em vez de um nome de arquivo.
sv: Dessa två metoder finns också för att läsa från en sträng snarare än en fil. Deras motsvarande namn är :meth:`Gtk.Builder.add_from_string` och :meth:`Gtk.Builder.add_objects_from_string` och de tar helt enkelt en XML-sträng istället för ett filnamn.

source: Accessing widgets
pt_br: Acessando Widgets
sv: Komma åt komponenter

source: Now that the window and the button are loaded we also want to show them. Therefore the :meth:`Gtk.Window.show_all` method has to be called on the window. But how do we access the associated object?
pt_br: Agora que a janela e o botão estão carregados, também queremos mostrá-los. Portanto, o método :meth:`Gtk.Window.show_all` deve ser chamado na janela. Mas como acessamos o objeto associado?
sv: Nu när fönstret och knappen har lästs in vill vi också visa dem. Därför behöver metoden :meth:`Gtk.Window.show_all` anropas på fönstret. Men hur kommer vi åt det associerade objektet?

source: Every widget can be retrieved from the builder by the :meth:`Gtk.Builder.get_object` method and the widget's *id*. It is really *that* simple.
pt_br: Cada widget pode ser recuperado do construtor pelo método :meth:`Gtk.Builder.get_object` e pelo *id* do widget. É realmente *isso* simples.
sv: Varje komponent kan erhållas från byggaren genom metoden :meth:`Gtk.Builder.get_object` och komponentens *id*. Det är precis *så* lätt.

source: It is also possible to get a list of all objects with
pt_br: Também é possível obter uma lista de todos os objetos com
sv: Det är också möjligt att få en lista över alla objekt med

source: Connecting Signals
pt_br: Conectando Sinais
sv: Ansluta signaler

source: Glade also makes it possible to define signals which you can connect to handlers in your code without extracting every object from the builder and connecting to the signals manually. The first thing to do is to declare the signal names in Glade. For this example we will act when the window is closed and when the button was pressed, so we give the name "onDestroy" to the callback handling the "destroy" signal of the window and "onButtonPressed" to the callback handling the "pressed" signal of the button. Now the XML file should look like this.
pt_br: O Glade também permite definir sinais que você pode conectar a manipuladores em seu código sem extrair todos os objetos do construtor e conectar-se aos sinais manualmente. A primeira coisa a fazer é declarar os nomes dos sinais no Glade. Para este exemplo, vamos agir quando a janela é fechada e quando o botão foi pressionado, então damos o nome "onDestroy" para o retorno de chamada manipulando o sinal "destroy" da janela e "onButtonPressed" para o retorno de chamada manipulando o "pressionado" sinal do botão. Agora o arquivo XML deve ficar assim.
sv: Glade möjliggör också att definiera signaler som du kan ansluta till hanterare i din kod utan att extrahera varje objekt från byggaren och ansluta till signalerna manuellt. Den första saken att göra är att deklarera signalnamnen i Glade. För detta exempel kommer vi agera när fönstret stängs och när knappen trycktes ned, så vi ger namnet ”onDestroy” till återanropet som hanterar fönstrets ”destroy”-signal och ”onButtonPressed” till återanropet som hanterar knappens ”pressed”-signal. Nu bör XML-filen se ut så här.

source: Now we have to define the handler functions in our code. The *onDestroy* should simply result in a call to :meth:`Gtk.main_quit`. When the button is pressed we would like to print the string "Hello World!", so we define the handler as follows
pt_br: Agora temos que definir as funções do manipulador em nosso código. O *onDestroy* deve simplesmente resultar em uma chamada para :meth:`Gtk.main_quit`. Quando o botão é pressionado, gostaríamos de imprimir a string "Hello World!", Então definimos o manipulador da seguinte maneira
sv: Nu behöver vi definiera hanterarfunktionerna i vår kod. *onDestroy* bör helt enkelt resultera i ett anrop till :meth:`Gtk.main_quit`. När knappen trycks ned skulle vi vilja skriva ut strängen ”Hello World!”, så vi definierar hanteraren enligt följande

source: Next, we have to connect the signals and the handler functions. The easiest way to do this is to define a *dict* with a mapping from the names to the handlers and then pass it to the :meth:`Gtk.Builder.connect_signals` method.
pt_br: Em seguida, temos que conectar os sinais e as funções do manipulador. A maneira mais fácil de fazer isso é definir um *dict* com um mapeamento dos nomes para os manipuladores e então passá-lo para o método :meth:`Gtk.Builder.connect_signals`.
sv: Härnäst behöver vi ansluta signalerna och hanterarfunktionerna. Det lättaste sättet att göra det är att definiera en *dict* med en mappning från namnen till hanterarna och sedan skicka den till metoden :meth:`Gtk.Builder.connect_signals`.

source: An alternative approach is to create a class which has methods that are called like the signals. In our example the last code snippet could be rewritten as:
pt_br: Uma abordagem alternativa é criar uma classe que tenha métodos que sejam chamados como os sinais. Em nosso exemplo, o último snippet de código pode ser reescrito como:
sv: Ett alternativt tillvägagångssätt är att skapa en klass som har metoder som anropas som signalerna. I vårt exempel skulle den sista kodsnutten kunna skrivas om som:

source: The final code of the example
pt_br: O código final do exemplo
sv: Exemplets slutgiltiga kod

source: Button Widgets
pt_br: Widgets de Botão
sv: Knappkomponenter

source: The Button widget is another commonly used widget. It is generally used to attach a function that is called when the button is pressed.
pt_br: O widget Button é outro widget comumente usado. Geralmente é usado para anexar uma função que é chamada quando o botão é pressionado.
sv: Komponenten Button är en annan ofta använd komponent. Den används vanligen för att ansluta en funktion som anropas när knappen trycks ned.

source: The :class:`Gtk.Button` widget can hold any valid child widget. That is it can hold most any other standard :class:`Gtk.Widget`. The most commonly used child is the :class:`Gtk.Label`.
pt_br: O widget :class:`Gtk.Button` pode conter qualquer widget filho válido. Isto é, ele pode conter praticamente qualquer outro padrão :class:`Gtk.Widget`. Um filho mais comumente usado é a :class:`Gtk.Label`.
sv: Komponenten :class:`Gtk.Button` kan innehålla alla giltiga barnkomponenter. Det vill säga att den kan innehålla de flesta andra vanliga :class:`Gtk.Widget`. Det oftast använda barnet är :class:`Gtk.Label`.

source: Usually, you want to connect to the button's "clicked" signal which is emitted when the button has been pressed and released.
pt_br: Normalmente, você quer se conectar ao sinal "clicado" do botão que é emitido quando o botão foi pressionado e liberado.
sv: Vanligen vill du ansluta till knappens ”clicked”-signal som sänds ut när knappen har tryckts ned och släppts.

source: A :class:`Gtk.ToggleButton` is very similar to a normal :class:`Gtk.Button`, but when clicked they remain activated, or pressed, until clicked again. When the state of the button is changed, the "toggled" signal is emitted.
pt_br: A :class:`Gtk.ToggleButton` é muito semelhante a um normal :class:`Gtk.Button`, mas quando clicados eles permanecem ativados, ou pressionados, até serem clicados novamente. Quando o estado do botão é alterado, o sinal "toggled" (alternado) é emitido.
sv: En :class:`Gtk.ToggleButton` är väldigt lik en vanlig :class:`Gtk.Button`, men när de klickats så förbli de aktiverade, eller nedtryckta, tills de klickas på igen. När tillståndet för knappen ändras sänder den ut signalen ”toggled”.

source: To retrieve the state of the :class:`Gtk.ToggleButton`, you can use the :meth:`Gtk.ToggleButton.get_active` method. This returns ``True`` if the button is "down". You can also set the toggle button's state, with :meth:`Gtk.ToggleButton.set_active`. Note that, if you do this, and the state actually changes, it causes the "toggled" signal to be emitted.
pt_br: Para recuperar o estado da :class:`Gtk.ToggleButton`, você pode usar o método :meth:`Gtk.ToggleButton.get_active`. Isso retorna ``True`` se o botão estiver "inativo". Você também pode definir o estado do botão de alternância, com :meth:`Gtk.ToggleButton.set_active`. Observe que, se você fizer isso e o estado realmente mudar, isso fará com que o sinal "alternado" seja emitido.
sv: För att erhålla tillståndet för :class:`Gtk.ToggleButton` kan du använda metoden :meth:`Gtk.ToggleButton.get_active`. Denna returnerar ``True`` om knappen är ”nere”. Du kan också ställa in växlingsknappens tillstånd med :meth:`Gtk.ToggleButton.set_active`. Observera att om du gör detta och tillståndet faktiskt ändras så får det signalen ”toggled” att sändas ut.

source: :class:`Gtk.CheckButton` inherits from :class:`Gtk.ToggleButton`. The only real difference between the two is :class:`Gtk.CheckButton`'s appearance. A :class:`Gtk.CheckButton` places a discrete :class:`Gtk.ToggleButton` next to a widget, (usually a :class:`Gtk.Label`). The "toggled" signal, :meth:`Gtk.ToggleButton.set_active` and :meth:`Gtk.ToggleButton.get_active` are inherited.
pt_br: :class:`Gtk.CheckButton` herda de :class:`Gtk.ToggleButton`. A única diferença real entre os dois é como :class:`Gtk.CheckButton` é apresentado. A :class:`Gtk.CheckButton` coloca um discreto :class:`Gtk.ToggleButton` ao lado de um widget, (geralmente um :class:`Gtk.Label`). O sinal "toggled", :meth:`Gtk.ToggleButton.set_active` e :meth:`Gtk.ToggleButton.get_active` são herdados.
sv: :class:`Gtk.CheckButton` ärver från :class:`Gtk.ToggleButton`. Den enda reella skillnaden mellan dem är utseendet för :class:`Gtk.CheckButton`. En :class:`Gtk.CheckButton` placerar en diskret :class:`Gtk.ToggleButton` intill en komponent (vanligen en :class:`Gtk.Label`). Signalen ”toggled”, :meth:`Gtk.ToggleButton.set_active` och :meth:`Gtk.ToggleButton.get_active` ärvs.

source: Like checkboxes, radio buttons also inherit from :class:`Gtk.ToggleButton`, but these work in groups, and only one :class:`Gtk.RadioButton` in a group can be selected at any one time. Therefore, a :class:`Gtk.RadioButton` is one way of giving the user a choice from many options.
pt_br: Como os checkboxes, os radio buttons também herdam de :class:`Gtk.ToggleButton`, mas estes funcionam em grupos, e apenas um :class:`Gtk.RadioButton` em um grupo pode ser selecionado a qualquer momento. Portanto, um :class:`Gtk.RadioButton` é uma maneira de dar ao usuário uma escolha entre várias opções.
sv: Liksom kryssrutor så ärver även radioknappar från :class:`Gtk.ToggleButton`, men dessa fungerar i grupp, och endast en :class:`Gtk.RadioButton` i en grupp kan väljas vid varje givet tillfälle. Därigenom är en :class:`Gtk.RadioButton` ett sätt att ge användaren ett val bland många alternativ.

source: Radio buttons can be created with one of the static methods :meth:`Gtk.RadioButton.new_from_widget`, :meth:`Gtk.RadioButton.new_with_label_from_widget` or :meth:`Gtk.RadioButton.new_with_mnemonic_from_widget`. The first radio button in a group will be created passing ``None`` as the *group* argument. In subsequent calls, the group you wish to add this button to should be passed as an argument.
pt_br: Botões de rádio podem ser criados com um dos métodos estáticos :meth:`Gtk.RadioButton.new_from_widget`, :meth:`Gtk.RadioButton.new_with_label_from_widget` ou :meth:`Gtk.RadioButton.new_with_mnemonic_from_widget`. O primeiro botão de rádio de um grupo será criado passando o ``None`` como o argumento *group*. Nas chamadas subsequentes, o grupo ao qual você deseja adicionar esse botão deve ser passado como um argumento.
sv: Radioknappar kan skapas med en av de statiska metoderna :meth:`Gtk.RadioButton.new_from_widget`, :meth:`Gtk.RadioButton.new_with_label_from_widget` eller :meth:`Gtk.RadioButton.new_with_mnemonic_from_widget`. Den första radioknappen i en grupp kommer skicka ``None`` som *group*-argument då den skapas. I följande anrop ska gruppen som du vill lägga till denna knapp till skickas med som ett argument.

source: When first run, the first radio button in the group will be active. This can be changed by calling :meth:`Gtk.ToggleButton.set_active` with ``True`` as first argument.
pt_br: Quando executado pela primeira vez, o primeiro botão de rádio do grupo estará ativo. Isto pode ser alterado chamando :meth:`Gtk.ToggleButton.set_active` com ``True`` como primeiro argumento.
sv: Då den först körs kommer den första radioknappen vara aktiv. Detta kan ändras genom att anropa :meth:`Gtk.ToggleButton.set_active` med ``True`` som första argument.

source: Changing a :class:`Gtk.RadioButton`'s widget group after its creation can be achieved by calling :meth:`Gtk.RadioButton.join_group`.
pt_br: Alterar o grupo de widgets :class:`Gtk.RadioButton` após sua criação pode ser feito chamando :meth:`Gtk.RadioButton.join_group`.
sv: Att ändra komponentgrupp för en :class:`Gtk.RadioButton` efter att den skapats kan göras genom att anropa :meth:`Gtk.RadioButton.join_group`.

source: A :class:`Gtk.LinkButton` is a :class:`Gtk.Button` with a hyperlink, similar to the one used by web browsers, which triggers an action when clicked. It is useful to show quick links to resources.
pt_br: A :class:`Gtk.LinkButton` é um :class:`Gtk.Button` com um hiperlink, similar ao usado pelos navegadores da web, que aciona uma ação quando clicado. É útil mostrar links rápidos para recursos.
sv: En :class:`Gtk.LinkButton` är en :class:`Gtk.Button` med en hyperlänk, liknande den som används av webbläsare, vilken utlöser en åtgärd då den klickas på. Den är användbar för att visa snabblänkar till resurser.

source: The URI bound to a :class:`Gtk.LinkButton` can be set specifically using :meth:`Gtk.LinkButton.set_uri`, and retrieved using :meth:`Gtk.LinkButton.get_uri`.
pt_br: O URI ligado a um :class:`Gtk.LinkButton` pode ser configurado especificamente usando :meth:`Gtk.LinkButton.set_uri` e recuperado usando :meth:`Gtk.LinkButton.get_uri`.
sv: Den URI som är bunden till en :class:`Gtk.LinkButton` kan specifikt ställas in med :meth:`Gtk.LinkButton.set_uri`, och erhållas med :meth:`Gtk.LinkButton.get_uri`.

source: A :class:`Gtk.SpinButton` is an ideal way to allow the user to set the value of some attribute. Rather than having to directly type a number into a :class:`Gtk.Entry`, :class:`Gtk.SpinButton` allows the user to click on one of two arrows to increment or decrement the displayed value. A value can still be typed in, with the bonus that it can be checked to ensure it is in a given range. The main properties of a :class:`Gtk.SpinButton` are set through :class:`Gtk.Adjustment`.
pt_br: A :class:`Gtk.SpinButton` é uma maneira ideal de permitir que o usuário defina o valor de algum atributo. Em vez de digitar diretamente um número em :class:`Gtk.Entry`, :class:`Gtk.SpinButton` permite que o usuário clique em uma das duas setas para incrementar ou decrementar o valor exibido. Um valor ainda pode ser digitado, com o bônus que pode ser verificado para garantir que esteja em um determinado intervalo. As propriedades principais de um :class:`Gtk.SpinButton` são definidas através de :class:`Gtk.Adjustment`.
sv: En :class:`Gtk.SpinButton` är ett idealiskt sätt att låta användaren ställa in värdet för något attribut. Snarare än att direkt behöva skriva in ett tal i ett :class:`Gtk.Entry`, så låter :class:`Gtk.SpinButton` användaren klicka på en av två pilar för att öka eller minska det visade värdet. Ett värde kan fortfarande skrivas in, med bonusen att det kan kontrolleras för att säkerställa att det är i ett givet intervall. Huvudegenskaperna för en :class:`Gtk.SpinButton` ställs in genom :class:`Gtk.Adjustment`.

source: To change the value that :class:`Gtk.SpinButton` is showing, use :meth:`Gtk.SpinButton.set_value`. The value entered can either be an integer or float, depending on your requirements, use :meth:`Gtk.SpinButton.get_value` or :meth:`Gtk.SpinButton.get_value_as_int`, respectively.
pt_br: Para alterar o valor que :class:`Gtk.SpinButton` está mostrando, use :meth:`Gtk.SpinButton.set_value`. O valor digitado pode ser um número inteiro ou float, dependendo de seus requisitos, use :meth:`Gtk.SpinButton.get_value` ou :meth:`Gtk.SpinButton.get_value_as_int`, respectivamente.
sv: För att ändra värdet som :class:`Gtk.SpinButton` visar, använd :meth:`Gtk.SpinButton.set_value`. Värdet som matas in kan antingen vara ett hel- eller flyttal, beroende på dina krav. Använd :meth:`Gtk.SpinButton.get_value_as_int` respektive :meth:`Gtk.SpinButton.get_value`.

source: When you allow the displaying of float values in the spin button, you may wish to adjust the number of decimal spaces displayed by calling :meth:`Gtk.SpinButton.set_digits`.
pt_br: Quando você permite a exibição de valores flutuantes no botão de rotação, você pode querer ajustar o número de espaços decimais exibidos chamando :meth:`Gtk.SpinButton.set_digits`.
sv: När du tillåter visning av flyttalsvärden i stegningsrutan kan du vilja justera antalet decimaler som visas genom att anropa :meth:`Gtk.SpinButton.set_digits`.

source: By default, :class:`Gtk.SpinButton` accepts textual data. If you wish to limit this to numerical values only, call :meth:`Gtk.SpinButton.set_numeric` with ``True`` as argument.
pt_br: Por padrão, :class:`Gtk.SpinButton` aceita dados textuais. Se você deseja limitar isso apenas a valores numéricos, chame :meth:`Gtk.SpinButton.set_numeric` com ``True`` como argumento.
sv: Som standard accepterar :class:`Gtk.SpinButton` textdata. Om du vill begränsa detta till endast numeriska värden anropar du :meth:`Gtk.SpinButton.set_numeric` med ``True`` som argument.

source: We can also adjust the update policy of :class:`Gtk.SpinButton`. There are two options here; by default the spin button updates the value even if the data entered is invalid. Alternatively, we can set the policy to only update when the value entered is valid by calling :meth:`Gtk.SpinButton.set_update_policy`.
pt_br: Também podemos ajustar a política de atualização de :class:`Gtk.SpinButton`. Existem duas opções aqui; por padrão, o botão de rotação atualiza o valor mesmo se os dados inseridos forem inválidos. Alternativamente, podemos definir a política para apenas atualizar quando o valor inserido é válido chamando :meth:`Gtk.SpinButton.set_update_policy`.
sv: Vi kan även justera uppdateringspolicyn för :class:`Gtk.SpinButton`. Det finns två alternativ här; som standard uppdaterar stegningsrutan värdet även om de data som matas in är ogiltiga. Alternativt kan vi ställa in policyn så att det bara uppdateras när det inmatade värdet är giltigt genom att anropa :meth:`Gtk.SpinButton.set_update_policy`.

source: A :class:`Gtk.Switch` is a widget that has two states: on or off. The user can control which state should be active by clicking the empty area, or by dragging the handle.
pt_br: A :class:`Gtk.Switch` é um widget que possui dois estados: ligado ou desligado. O usuário pode controlar qual estado deve estar ativo clicando na área vazia ou arrastando a alça.
sv: En :class:`Gtk.Switch` är en komponent som har två tillstånd: på eller av. Användaren kan styra vilket tillstånd som ska vara aktivt genom att klicka på den tomma ytan, eller genom att dra handtaget.

source: You shouldn't use the "activate" signal on the Gtk.Switch which is an action signal and emitting it causes the switch to animate. Applications should never connect to this signal, but use the "notify::active" signal, see the example here below.
pt_br: Você não deve usar o sinal "activate" no Gtk.Switch que é um sinal de ação e emiti-lo faz com que o switch anime. As aplicações nunca devem se conectar a este sinal, mas use o sinal "notify::active", veja o exemplo abaixo.
sv: Du bör inte använda ”activate”-signalen vilken är en åtgärdssignal på Gtk.Switch, att sända ut den får brytaren att animeras. Program ska aldrig ansluta till denna signal, utan använda signalen ”notify::active”, se exemplet nedan.

source: CellRenderers
sv: CellRenderer-komponenter

source: :class:`Gtk.CellRenderer` widgets are used to display information within widgets such as the :class:`Gtk.TreeView` or :class:`Gtk.ComboBox`. They work closely with the associated widgets and are very powerful, with lots of configuration options for displaying a large amount of data in different ways. There are seven :class:`Gtk.CellRenderer` widgets which can be used for different purposes:
pt_br: Os widgets :class:`Gtk.CellRenderer` são usados para exibir informações dentro de widgets como :class:`Gtk.TreeView` ou :class:`Gtk.ComboBox`. Eles trabalham de perto com os widgets associados e são muito poderosos, com muitas opções de configuração para exibir uma grande quantidade de dados de diferentes maneiras. Há sete widgets :class:`Gtk.CellRenderer` que podem ser usados para diferentes propósitos:
sv: :class:`Gtk.CellRenderer`-komponenter används för att visa information i komponenter så som :class:`Gtk.TreeView` eller :class:`Gtk.ComboBox`. De arbetar nära med de associerade komponenterna och är väldigt kraftfulla, med många konfigurationsalternativ för att visa en stor mängd data på olika sätt. Det finns sju :class:`Gtk.CellRenderer`-komponenter som kan användas för olika syften:

source: A :class:`Gtk.CellRendererText` renders a given text in its cell, using the font, color and style information provided by its properties. The text will be ellipsized if it is too long and the "ellipsize" property allows it.
pt_br: A :class:`Gtk.CellRendererText` processa um dado texto em sua célula, usando as informações de fonte, cor e estilo fornecidas por suas propriedades. O texto será reticulado se for muito longo e a propriedade "ellipsize" permitir.
sv: En :class:`Gtk.CellRendererText` renderar en given text i en cell, med det typsnitt, färg och stilinformation som ges av dess egenskaper. Texten kommer elliptiseras om den är för lång och egenskapen ”ellipsize” tillåter det.

source: By default, text in :class:`Gtk.CellRendererText` widgets is not editable. This can be changed by setting the value of the "editable" property to ``True``:
pt_br: Por padrão, o texto em :class:`Gtk.CellRendererText` widgets não é editável. Isso pode ser alterado, definindo o valor da propriedade "editable" como ``True``:
sv: Som standard är text i :class:`Gtk.CellRendererText`-komponenter inte redigerbar. Detta kan ändras genom att ställa in värdet för egenskapen ”editable” till ``True``:

source: You can then connect to the "edited" signal and update your :class:`Gtk.TreeModel` accordingly.
pt_br: Você pode então se conectar ao sinal "editado" e atualizar seu :class:`Gtk.TreeModel` de acordo.
sv: Du kan sedan ansluta till ”edited”-signalen och uppdatera din :class:`Gtk.TreeModel` enligt det.
