Repository: sebp/PyGObject-Tutorial
Catalog: translations/po/*.po
Languages: pt_br, sv

source: When an application can determine how much work needs to take place (e.g. read a fixed number of bytes from a file) and can monitor its progress, it can use the :class:`Gtk.ProgressBar` in *percentage mode* and the user sees a growing bar indicating the percentage of the work that has been completed. In this mode, the application is required to call :meth:`Gtk.ProgressBar.set_fraction` periodically to update the progress bar, passing a float between 0 and 1 to provide the new percentage value.
pt_br: Quando uma aplicação pode determinar quanto trabalho precisa ocorrer (por exemplo, ler um número fixo de bytes de um arquivo) e monitorar seu progresso, ela pode usar :class:`Gtk.ProgressBar` no modo *percentage* e o usuário vê uma barra crescente indicando a porcentagem do trabalho que foi concluído. Neste modo, o aplicativo é necessário para chamar :meth:`Gtk.ProgressBar.set_fraction` periodicamente para atualizar a barra de progresso, passando um float entre 0 e 1 para fornecer o novo valor percentual.
sv: Då ett program kan avgöra hur mycket arbete som behöver utföras (t.ex. läsa ett fast antal byte från en fil) och kan övervaka sina framsteg, så kan det använda :class:`Gtk.ProgressBar` i *procentläge*, så ser användaren en växande stapel som indikerar procentdelen av arbetet som har slutförts. I detta läge behöver programmet anropa :meth:`Gtk.ProgressBar.set_fraction` periodiskt för att uppdatera förloppsindikatorn, och skicka med ett flyttal mellan 0 och 1 för att tillhandahålla det nya procentvärdet.

source: When an application has no accurate way of knowing the amount of work to do, it can use *activity mode*, which shows activity by a block moving back and forth within the progress area. In this mode, the application is required to call :meth:`Gtk.ProgressBar.pulse` periodically to update the progress bar. You can also choose the step size, with the :meth:`Gtk.ProgressBar.set_pulse_step` method.
pt_br: Quando um aplicativo não tem uma maneira precisa de saber a quantidade de trabalho a ser feito, ele pode usar o *modo de atividade*, que mostra a atividade de um bloco se movendo para frente e para trás na área de progresso. Neste modo, o aplicativo é necessário para chamar :meth:`Gtk.ProgressBar.pulse` periodicamente para atualizar a barra de progresso. Você também pode escolher o tamanho do passo, com o método :meth:`Gtk.ProgressBar.set_pulse_step`.
sv: Då ett program inte har något exakt sätt att veta mängden arbete det måste utföra, kan det använda *aktivitetsläge*, som visar aktivitet med ett block som rör sig fram och tillbaka i förloppsområdet. I detta läget behöver programmet anropa :meth:`Gtk.ProgressBar.pulse` periodiskt för att uppdatera förloppsindikatorn. Du kan också välja stegstorleken, med metoden :meth:`Gtk.ProgressBar.set_pulse_step`.

source: By default, :class:`Gtk.ProgressBar` is horizontal and left-to-right, but you can change it to a vertical progress bar by using the :meth:`Gtk.ProgressBar.set_orientation` method. Changing the direction the progress bar grows can be done using :meth:`Gtk.ProgressBar.set_inverted`. :class:`Gtk.ProgressBar` can also contain text which can be set by calling :meth:`Gtk.ProgressBar.set_text` and :meth:`Gtk.ProgressBar.set_show_text`.
pt_br: Por padrão, :class:`Gtk.ProgressBar` é horizontal e da esquerda para a direita, mas você pode alterá-lo para uma barra de progresso vertical usando o método :meth:`Gtk.ProgressBar.set_orientation`. Mudar a direção da barra de progresso pode ser feito usando :meth:`Gtk.ProgressBar.set_inverted`. :class:`Gtk.ProgressBar` também pode conter texto que pode ser definido chamando :meth:`Gtk.ProgressBar.set_text` e :meth:`Gtk.ProgressBar.set_show_text`.
sv: Som standard är :class:`Gtk.ProgressBar` horisontell och vänster-till-höger, men du kan ändra den till en vertikal förloppsindikator genom att använda metoden :meth:`Gtk.ProgressBar.set_orientation`. Att ändra riktningen som förloppsindikatorn växer kan göras med :meth:`Gtk.ProgressBar.set_inverted`. :class:`Gtk.ProgressBar` kan också innehålla text som kan ställas in genom att anropa :meth:`Gtk.ProgressBar.set_text` och :meth:`Gtk.ProgressBar.set_show_text`.

source: The :class:`Gtk.Spinner` displays an icon-size spinning animation. It is often used as an alternative to a :class:`GtkProgressBar` for displaying indefinite activity, instead of actual progress.
pt_br: O :class:`Gtk.Spinner` exibe uma animação giratória do tamanho de um ícone. É frequentemente usado como uma alternativa a :class:`GtkProgressBar` para exibir atividade indefinida, em vez de progresso real.
sv: :class:`Gtk.Spinner` visar en snurrande animering av ikonstorlek. Den används ofta som ett alternativ till en :class:`GtkProgressBar` för att visa aktivitet av obestämd längd, istället för det faktiska förloppet.

source: To start the animation, use :meth:`Gtk.Spinner.start`, to stop it use :meth:`Gtk.Spinner.stop`.
pt_br: Para iniciar a animação, use :meth:`Gtk.Spinner.start`, para pará-lo use :meth:`Gtk.Spinner.stop`.
sv: För att starta animeringen, använd :meth:`Gtk.Spinner.start`. För att stoppa den, använd :meth:`Gtk.Spinner.stop`.

source: Extended example
sv: Utökat exempel

source: An extended example that uses a timeout function to start and stop the spinning animation. The :func:`on_timeout` function is called at regular intervals until it returns ``False``, at which point the timeout is automatically destroyed and the function will not be called again.
sv: Ett utökat exempel som använder en tidsgränsfunktion för att starta och stoppa den snurrande animeringen. Funktionen :func:`on_timeout` anropas med regelbundna intervall till den returnerar ``False``, och vid denna tidpunkt förstörs tidsgränsen automatiskt, och funktionen kommer inte anropas igen.

source: Multiline Text Editor
pt_br: Editor de Texto Multilinha
sv: Textredigerare med flera rader

source: The :class:`Gtk.TextView` widget can be used to display and edit large amounts of formatted text. Like the :class:`Gtk.TreeView`, it has a model/view design. In this case the :class:`Gtk.TextBuffer` is the model which represents the text being edited. This allows two or more :class:`Gtk.TextView` widgets to share the same :class:`Gtk.TextBuffer`, and allows those text buffers to be displayed slightly differently. Or you could maintain several text buffers and choose to display each one at different times in the same :class:`Gtk.TextView` widget.
pt_br: O widget :class:`Gtk.TextView` pode ser usado para exibir e editar grandes quantidades de texto formatado. Como o :class:`Gtk.TreeView`, ele possui um design de modelo/visualização. Neste caso, o :class:`Gtk.TextBuffer` é o modelo que representa o texto que está sendo editado. Isto permite que dois ou mais widgets :class:`Gtk.TextView` compartilhem o mesmo :class:`Gtk.TextBuffer`, e permite que os buffers de texto sejam exibidos de forma ligeiramente diferente. Ou você pode manter vários buffers de texto e optar por exibir cada um deles em momentos diferentes no mesmo widget :class:`Gtk.TextView`.
sv: Komponenten :class:`Gtk.TextView` kan användas för att visa och redigera stora mängder av formaterad text. Som :class:`Gtk.TreeView` har den en model/view-design. I detta fall är :class:`Gtk.TextBuffer` modellen som representerar texten som redigeras. Detta låter två eller fler :class:`Gtk.TextView`-komponenter dela på samma :class:`Gtk.TextBuffer`, och låter dessa textbuffrar visas något annorlunda. Eller så kan du underhålla flera textbuffrar och välja att visa var och en vid olika tider i samma :class:`Gtk.TextView`-komponent.

source: The View
sv: Vyn

source: The :class:`Gtk.TextView` is the frontend with which the user can add, edit and delete textual data. They are commonly used to edit multiple lines of text. When creating a :class:`Gtk.TextView` it contains its own default :class:`Gtk.TextBuffer`, which you can access via the :meth:`Gtk.TextView.get_buffer` method.
pt_br: O :class:`Gtk.TextView` é o frontend com o qual o usuário pode adicionar, editar e excluir dados textuais. Eles são comumente usados para editar várias linhas de texto. Ao criar um :class:`Gtk.TextView` ele contém seu próprio padrão :class:`Gtk.TextBuffer`, que você pode acessar através do método :meth:`Gtk.TextView.get_buffer`.
sv: :class:`Gtk.TextView` är framänden med vilken användaren kan lägga till, redigera och ta bort textdata. De används vanligen för att redigera flera rader av text. Då du skapar en :class:`Gtk.TextView` innehåller den sin egen standard-:class:`Gtk.TextBuffer`, vilken du kan komma åt via metoden :meth:`Gtk.TextView.get_buffer`.

source: By default, text can be added, edited and removed from the :class:`Gtk.TextView`. You can disable this by calling :meth:`Gtk.TextView.set_editable`. If the text is not editable, you usually want to hide the text cursor with :meth:`Gtk.TextView.set_cursor_visible` as well. In some cases it may be useful to set the justification of the text with :meth:`Gtk.TextView.set_justification`. The text can be displayed at the left edge, (:attr:`Gtk.Justification.LEFT`), at the right edge (:attr:`Gtk.Justification.RIGHT`), centered (:attr:`Gtk.Justification.CENTER`), or distributed across the complete width (:attr:`Gtk.Justification.FILL`).
pt_br: Por padrão, o texto pode ser adicionado, editado e removido da :class:`Gtk.TextView`. Você pode desabilitar isso chamando :meth:`Gtk.TextView.set_editable`. Se o texto não for editável, você geralmente deseja ocultar o cursor de texto com :meth:`Gtk.TextView.set_cursor_visible` também. Em alguns casos, pode ser útil definir a justificação do texto com :meth:`Gtk.TextView.set_justification`. O texto pode ser exibido na borda esquerda, (:attr:`Gtk.Justification.LEFT`), na extremidade direita (:attr:`Gtk.Justification.RIGHT`), centralizado (:attr:`Gtk.Justification.CENTER`), ou distribuído em toda a largura (:attr:`Gtk.Justification.FILL`).
sv: Som standard kan text läggas till, redigeras och tas bort från :class:`Gtk.TextView`. Du kan inaktivera detta genom att anropa :meth:`Gtk.TextView.set_editable`. Om texten inte är redigerbar vill du vanligen även dölja textmarkören med :meth:`Gtk.TextView.set_cursor_visible`. I vissa fall kan det vara användbart att ställa in justeringen av texten med :meth:`Gtk.TextView.set_justification`. Texten kan visas i vänstra kanten, (:attr:`Gtk.Justification.LEFT`), i högra kanten (:attr:`Gtk.Justification.RIGHT`), centrerad (:attr:`Gtk.Justification.CENTER`) eller jämnt fördelad över hela bredden (:attr:`Gtk.Justification.FILL`).

source: Another default setting of the :class:`Gtk.TextView` widget is long lines of text will continue horizontally until a break is entered. To wrap the text and prevent it going off the edges of the screen call :meth:`Gtk.TextView.set_wrap_mode`.
pt_br: Outra configuração padrão do widget :class:`Gtk.TextView` é que linhas longas de texto continuarão horizontalmente até que uma quebra seja inserida. Para encapsular o texto e impedir que ele saia das bordas da tela, chame :meth:`Gtk.TextView.set_wrap_mode`.
sv: En annan standardinställning för :class:`Gtk.TextView`-komponenten är att långa textrader kommer fortsätta horisontellt till ett avbrott matas in. För att radbryta texten och förhindra den från att försvinna utanför skärmens kanter, anropa :meth:`Gtk.TextView.set_wrap_mode`.

source: The Model
sv: Modellen

source: The :class:`Gtk.TextBuffer` is the core of the :class:`Gtk.TextView` widget, and is used to hold whatever text is being displayed in the :class:`Gtk.TextView`. Setting and retrieving the contents is possible with :meth:`Gtk.TextBuffer.set_text` and :meth:`Gtk.TextBuffer.get_text`. However, most text manipulation is accomplished with *iterators*, represented by a :class:`Gtk.TextIter`. An iterator represents a position between two characters in the text buffer. Iterators are not valid indefinitely; whenever the buffer is modified in a way that affects the contents of the buffer, all outstanding iterators become invalid.
pt_br: O :class:`Gtk.TextBuffer` é o núcleo do widget :class:`Gtk.TextView` e é usado para armazenar qualquer texto que esteja sendo exibido na :class:`Gtk.TextView`. Definir e recuperar o conteúdo é possível com :meth:`Gtk.TextBuffer.set_text` e :meth:`Gtk.TextBuffer.get_text`. No entanto, a maior parte da manipulação de texto é realizada com *iteradores*, representados por um :class:`Gtk.TextIter`. Um iterador representa uma posição entre dois caracteres no buffer de texto. Iteradores não são válidos indefinidamente; sempre que o buffer é modificado de uma maneira que afeta o conteúdo do buffer, todos os iteradores pendentes se tornam inválidos.
sv: :class:`Gtk.TextBuffer` är kärnan av :class:`Gtk.TextView`-komponenten, och används för att hålla vadhelst för text som visas i :class:`Gtk.TextView`. Att ställa in och erhålla innehållet är möjligt med :meth:`Gtk.TextBuffer.set_text` och :meth:`Gtk.TextBuffer.get_text`. Den mesta textmanipuleringen utförs dock med *iteratorer*, representerade av en :class:`Gtk.TextIter`. En iterator representerar en position mellan två tecken i textbufferten. Iteratorer är inte giltiga för alltid, närhelst bufferten ändras på ett sätt som påverkar buffertens innehåll så blir alla tidigare iteratorer ogiltiga.

source: Because of this, iterators can't be used to preserve positions across buffer modifications. To preserve a position, use :class:`Gtk.TextMark`. A text buffer contains two built-in marks; an "insert" mark (which is the position of the cursor) and the "selection_bound" mark. Both of them can be retrieved using :meth:`Gtk.TextBuffer.get_insert` and :meth:`Gtk.TextBuffer.get_selection_bound`, respectively. By default, the location of a :class:`Gtk.TextMark` is not shown. This can be changed by calling :meth:`Gtk.TextMark.set_visible`.
pt_br: Por causa disso, os iteradores não podem ser usados para preservar posições nas modificações do buffer. Para preservar uma posição, use :class:`Gtk.TextMark`. Um buffer de texto contém duas marcas internas; uma marca "insert" (que é a posição do cursor) e a marca "selection_bound". Ambos podem ser recuperados usando :meth:`Gtk.TextBuffer.get_insert` e :meth:`Gtk.TextBuffer.get_selection_bound`, respectivamente. Por padrão, a localização de um :class:`Gtk.TextMark` não é mostrada. Isso pode ser alterado chamando :meth:`Gtk.TextMark.set_visible`.
sv: På grund av detta kan iteratorer inte användas för att bevara positioner över buffertändringar. För att bevara en position, använd :class:`Gtk.TextMark`. En textbuffert innehåller två inbyggda märken; ett ”insert”-märke (som är markörens position) och märket ”selection_bound”. Båda av dem kan erhållas med :meth:`Gtk.TextBuffer.get_insert` respektive :meth:`Gtk.TextBuffer.get_selection_bound`. Som standard visas inte platsen för en :class:`Gtk.TextMark`. Detta kan ändras genom att anropa :meth:`Gtk.TextMark.set_visible`.

source: Many methods exist to retrieve a :class:`Gtk.TextIter`. For instance, :meth:`Gtk.TextBuffer.get_start_iter` returns an iterator pointing to the first position in the text buffer, whereas :meth:`Gtk.TextBuffer.get_end_iter` returns an iterator pointing past the last valid character. Retrieving the bounds of the selected text can be achieved by calling :meth:`Gtk.TextBuffer.get_selection_bounds`.
pt_br: Existem muitos métodos para recuperar um :class:`Gtk.TextIter`. Por exemplo, :meth:`Gtk.TextBuffer.get_start_iter` retorna um iterador apontando para a primeira posição no buffer de texto, enquanto :meth:`Gtk.TextBuffer.get_end_iter` retorna um iterador apontando após o último caractere válido. A recuperação dos limites do texto selecionado pode ser obtida chamando :meth:`Gtk.TextBuffer.get_selection_bounds`.
sv: Många metoder finns för att erhålla en :class:`Gtk.TextIter`. Exempelvis returnerar :meth:`Gtk.TextBuffer.get_start_iter` en iterator som pekar på den första positionen i textbufferten, medan :meth:`Gtk.TextBuffer.get_end_iter` returnerar en iterator som pekar bortom det sista giltiga tecknet. Att erhålla gränserna för den markerade texten kan åstadkommas genom att anropa :meth:`Gtk.TextBuffer.get_selection_bounds`.

source: To insert text at a specific position use :meth:`Gtk.TextBuffer.insert`. Another useful method is :meth:`Gtk.TextBuffer.insert_at_cursor` which inserts text wherever the cursor may be currently positioned. To remove portions of the text buffer use :meth:`Gtk.TextBuffer.delete`.
pt_br: Para inserir texto em uma posição específica use :meth:`Gtk.TextBuffer.insert`. Outro método útil é :meth:`Gtk.TextBuffer.insert_at_cursor` que insere texto onde quer que o cursor esteja posicionado no momento. Para remover partes do buffer de texto, use :meth:`Gtk.TextBuffer.delete`.
sv: För att infoga text på en specifik position, använd :meth:`Gtk.TextBuffer.insert`. En annan användbar metod är :meth:`Gtk.TextBuffer.insert_at_cursor` som infogar text varhelst markören är placerad för tillfället. Använd :meth:`Gtk.TextBuffer.delete` för att ta bort delar av textbufferten.

source: In addition, :class:`Gtk.TextIter` can be used to locate textual matches in the buffer using :meth:`Gtk.TextIter.forward_search` and :meth:`Gtk.TextIter.backward_search`. The start and end iters are used as the starting point of the search and move forwards/backwards depending on requirements.
pt_br: Além disso, :class:`Gtk.TextIter` pode ser usado para localizar correspondências textuais no buffer usando :meth:`Gtk.TextIter.forward_search` e :meth:`Gtk.TextIter.backward_search`. Os iters inicial e final são usados como ponto de partida da pesquisa e avançam/retrocedem dependendo dos requisitos.
sv: Dessutom kan :class:`Gtk.TextIter` användas för att hitta sökträffar på text i bufferten med :meth:`Gtk.TextIter.forward_search` och :meth:`Gtk.TextIter.backward_search`. Start- och slutiteratorerna används som startpunkten för sökningen och går framåt/bakåt beroende på kraven.

source: Tags
sv: Taggar

source: Text in a buffer can be marked with tags. A tag is an attribute that can be applied to some range of text. For example, a tag might be called "bold" and make the text inside the tag bold. However, the tag concept is more general than that; tags don't have to affect appearance. They can instead affect the behaviour of mouse and key presses, "lock" a range of text so the user can't edit it, or countless other things. A tag is represented by a :class:`Gtk.TextTag` object. One :class:`Gtk.TextTag` can be applied to any number of text ranges in any number of buffers.
pt_br: O texto em um buffer pode ser marcado com tags. Uma tag é um atributo que pode ser aplicado a um intervalo de texto. Por exemplo, uma tag pode ser chamada de "negrito" e tornar o texto dentro da tag em negrito. No entanto, o conceito de tag é mais geral do que isso; as tags não precisam afetar a aparência. Eles podem afetar o comportamento de pressionamentos de mouse e de tecla, "bloquear" um intervalo de texto para que o usuário não possa editá-lo ou inúmeras outras coisas. Uma tag é representada por um objeto :class:`Gtk.TextTag`. Um :class:`Gtk.TextTag` pode ser aplicado a qualquer número de intervalos de texto em qualquer número de buffers.
sv: Text i en buffert kan markeras med taggar. En tagg är ett attribut som kan tillämpas på något textintervall. Exempelvis kan en tagg vara kallad ”bold” och få texten i taggen att vara i fetstil. Taggkonceptet är dock mer allmänt än så; taggar behöver inte påverka utseende. De kan istället påverka beteendet för mus- och tangentryck, ”låsa” ett textintervall så att användaren inte kan redigera det samt många andra saker. En tagg representeras av ett :class:`Gtk.TextTag`-objekt. En :class:`Gtk.TextTag` kan tillämpas på ett valfritt antal textintervall i ett valfritt antal buffertar.

source: Each tag is stored in a :class:`Gtk.TextTagTable`. A tag table defines a set of tags that can be used together. Each buffer has one tag table associated with it; only tags from that tag table can be used with the buffer. A single tag table can be shared between multiple buffers, however.
pt_br: Cada tag é armazenada em :class:`Gtk.TextTagTable`. Uma tabela de tags define um conjunto de tags que podem ser usadas juntas. Cada buffer tem uma tabela de tags associada a ele; somente tags dessa tabela de tags podem ser usadas com o buffer. No entanto, uma única tabela de tags pode ser compartilhada entre vários buffers.
sv: Varje tagg lagras i en :class:`Gtk.TextTagTable`. En taggtabell definierar en uppsättning taggar som kan användas tillsammans. Varje buffert har en taggtabell associerad med sig; endast taggar från den taggtabellen kan användas med bufferten. En enda taggtabell kan dock delas mellan flera buffertar.

source: To specify that some text in the buffer should have specific formatting, you must define a tag to hold that formatting information, and then apply that tag to the region of text using :meth:`Gtk.TextBuffer.create_tag` and :meth:`Gtk.TextBuffer.apply_tag`::
pt_br: Para especificar que algum texto no buffer deve ter uma formatação específica, você deve definir uma tag para manter as informações de formatação e, em seguida, aplicar essa tag à região do texto usando :meth:`Gtk.TextBuffer.create_tag` e :meth:`Gtk.TextBuffer.apply_tag`::
sv: För att ange att någon text i bufferten ska ha specifik formatering så måste du definiera en tagg för att hålla den formateringsinformationen, och sedan tillämpa den taggen på textregionen med :meth:`Gtk.TextBuffer.create_tag` och :meth:`Gtk.TextBuffer.apply_tag`::

source: The following are some of the common styles applied to text:
pt_br: A seguir estão alguns dos estilos comuns aplicados ao texto:
sv: Följande är några av de vanliga stilarna som tillämpas på text:

source: Background colour ("foreground" property)
pt_br: Cor de fundo (propriedade "background")
sv: Förgrundsfärg (egenskapen ”foreground”)

source: Foreground colour ("background" property)
pt_br: Cor de primeiro plano (propriedade "foreground")
sv: Bakgrundsfärg (egenskapen ”background”)

source: Underline ("underline" property)
pt_br: Sublinhado (propriedade "underline")
sv: Understruken (egenskapen ”underline”)

source: Bold ("weight" property)
pt_br: Negrito (propriedade "weight")
sv: Fet (egenskapen ”weight”)

source: Italics ("style" property)
pt_br: Itálico (propriedade "style")
sv: Kursiv (egenskapen ”style”)

source: Strikethrough ("strikethrough" property)
pt_br: Tachado (propriedade "strikethrough")
sv: Genomstruken (egenskapen ”strikethrough”)

source: Justification ("justification" property)
pt_br: Justificação (propriedade de "justification")
sv: Justering (egenskapen ”justification”)

source: Size ("size" and "size-points" properties)
pt_br: Tamanho (propriedades "size" e "size-points")
sv: Storlek (egenskaperna ”size” och ”size-points”)

source: Text wrapping ("wrap-mode" property)
pt_br: Quebra automática de texto (propriedade "wrap-mode")
sv: Radbrytning av text (egenskapen ”wrap-mode”)

source: You can also delete particular tags later using :meth:`Gtk.TextBuffer.remove_tag` or delete all tags in a given region by calling :meth:`Gtk.TextBuffer.remove_all_tags`.
pt_br: Você também pode excluir tags particulares posteriormente usando :meth:`Gtk.TextBuffer.remove_tag` ou excluir todas as tags em uma determinada região chamando :meth:`Gtk.TextBuffer.remove_all_tags`.
sv: Du kan också ta bort specifika taggar senare med :meth:`Gtk.TextBuffer.remove_tag` eller ta bort alla taggar i en angiven region genom att anropa :meth:`Gtk.TextBuffer.remove_all_tags`.

source: Tree and List Widgets
pt_br: Widgets de Árvore e Lista
sv: Träd- och listkomponenter
