Repository: sebp/PyGObject-Tutorial
Catalog: translations/po/*.po
Languages: pt_br, sv

source: :class:`Gtk.Application` encompasses many repetitive tasks that a modern application needs such as handling multiple instances, D-Bus activation, opening files, command line parsing, startup/shutdown, menu management, window management, and more.
pt_br: :class:`Gtk.Application` abrange muitas tarefas repetitivas que um aplicativo moderno precisa, como manipular várias instâncias, ativação do D-Bus, abertura de arquivos, análise de linha de comando, inicialização/desligamento, gerenciamento de menus, gerenciamento de janelas e muito mais.
sv: :class:`Gtk.Application` täcker flera upprepande uppgifter som ett modernt program behöver så som att hantera flera instanser, D-Bus-aktivering, öppna filer, kommandoradstolkning, uppstart/nedstängning, menyhantering, fönsterhantering med mera.

source: Actions
sv: Åtgärder

source: :class:`Gio.Action` is a way to expose any single task your application or widget does by a name. These actions can be disabled/enabled at runtime and they can either be activated or have a state changed (if they contain state).
pt_br: :class:`Gio.Action` é uma maneira de expor qualquer tarefa que seu aplicativo ou widget fizer por um nome. Essas ações podem ser desabilitadas/habilitadas no tempo de execução e podem ser ativadas ou ter um estado alterado (se elas contiverem estado).
sv: :class:`Gio.Action` är ett sätt att exponera varje enskild uppgift ditt program eller din komponent gör med ett namn. Dessa åtgärder kan inaktiveras/aktiveras vid körtid och de kan antingen aktiveras eller få ett tillstånd ändrat (om de innehåller tillstånd).

source: The reason to use actions is to separate out the logic from the UI. For example this allows using a menubar on OSX and a gear menu on GNOME both simply referencing the name of an action. The main implementation of this you will be using is :class:`Gio.SimpleAction` which will be demonstrated later.
pt_br: O motivo para usar ações é separar a lógica da interface do usuário. Por exemplo, isso permite usar uma barra de menu no OSX e um menu de engrenagem no GNOME, simplesmente referenciando o nome de uma ação. A principal implementação que você estará usando é :class:`Gio.SimpleAction` que será mostrado mais tarde.
sv: Orsaken för att använda åtgärder är att separera logiken från användargränssnittet. Till exempel så tillåter detta användning av en menyrad i OSX och en kugghjulsmeny i GNOME genom att helt enkelt referera namnet på en åtgärd. Den huvudsakliga implementationen av detta som du kommer att använda är :class:`Gio.SimpleAction` som kommer demonstreras senare.

source: Many classes such as :class:`Gio.MenuItem` and :class:`Gtk.ModelButton` support properties to set an action name.
pt_br: Muitas classes, como :class:`Gio.MenuItem` e :class:`Gtk.ModelButton` suportam propriedades para definir um nome de ação.
sv: Många klasser så som :class:`Gio.MenuItem` och :class:`Gtk.ModelButton` stöder egenskaper för att ställa in ett åtgärdsnamn.

source: These actions can be grouped together into a :class:`Gio.ActionGroup` and when these groups are added to a widget with :meth:`Gtk.Widget.insert_action_group()` they will gain a prefix. Such as "win" when added to a :class:`Gtk.ApplicationWindow`. You will use the full action name when referencing it such as "app.about" but when you create the action it will just be "about" until added to the application.
pt_br: Estas ações podem ser agrupadas em um :class:`Gio.ActionGroup` e quando esses grupos são adicionados a um widget com :meth:`Gtk.Widget.insert_action_group()`, eles ganharão um prefixo. Tal como "win" quando adicionado a um :class:`Gtk.ApplicationWindow`. Você usará o nome completo da ação ao fazer referência a ele, como "app.about", mas ao criar a ação, ela ficará "about" até ser adicionada ao aplicativo.
sv: Dessa åtgärder kan grupperas tillsammans i en :class:`Gio.ActionGroup` och då dessa grupper läggs till i en komponent med :meth:`Gtk.Widget.insert_action_group()` kommer de få ett prefix. Exempelvis ”win” då de läggs till ett :class:`Gtk.ApplicationWindow`. Du kommer använda det fullständiga åtgärdsnamnet då du refererar till det, som ”app.about”, men då du skapar åtgärden kommer den bara vara ”about” tills den läggs till i programmet.

source: You can also very easily make keybindings for actions by setting the `accel` property in the :class:`Gio.Menu` file or by using :meth:`Gtk.Application.set_accels_for_action()`.
sv: Du kan också väldigt lätt göra tangentbindningar för åtgärder genom att ställa in egenskapen `accel` i :class:`Gio.Menu`-filen eller genom att använda :meth:`Gtk.Application.set_accels_for_action()`.

source: Menus
sv: Menyer

source: Your menus should be defined in XML using :class:`Gio.Menu` and would reference the previously mentioned actions you defined. :class:`Gtk.Application` allows you to set a menu either via :meth:`Gtk.Application.set_app_menu()` or :meth:`Gtk.Application.set_menubar()`. If you make use of :class:`Gio.Resource` this can automatically use the correct menu based on platform, otherwise you can set them manually. A detailed example is shown below.
pt_br: Seus menus devem ser definidos em XML usando :class:`Gio.Menu` e referenciam as ações mencionadas anteriormente que você definiu. :class:`Gtk.Application` permite que você defina um menu via :meth:`Gtk.Application.set_app_menu()` ou :meth:`Gtk.Application.set_menubar()`. Se você faz uso de :class:`Gio.Resource` isto pode usar automaticamente o menu correto baseado na plataforma, caso contrário você pode configurá-los manualmente. Um exemplo detalhado é mostrado abaixo.
sv: Dina menyer bör definieras i XML med :class:`Gio.Menu` och skulle hänvisa till de tidigare nämnda åtgärderna som du definierade. :class:`Gtk.Application` låter dig konfigurera en meny antingen via :meth:`Gtk.Application.set_app_menu()` eller :meth:`Gtk.Application.set_menubar()`. Om du använder :class:`Gio.Resource` så kan det automatiskt använda rätt meny baserat på plattform, annars kan du ställa in dem manuellt. Ett detaljerat exempel visas nedan.

source: Command Line
pt_br: Linha de Comando
sv: Kommandorad

source: When creating your application it takes a flag property of :class:`Gio.ApplicationFlags`. Using this you can let it handle everything itself or have more custom behavior.
pt_br: Ao criar seu aplicativo, ele recebe uma propriedade de flag de :class:`Gio.ApplicationFlags`. Usando isso, você pode permitir que ele manipule tudo sozinho ou tenha um comportamento mais personalizado.
sv: Då du skapar ditt program tar det en flaggegenskap från :class:`Gio.ApplicationFlags`. Med denna kan du låta det hantera allting själv eller ha mer anpassat beteende.

source: You can use `HANDLES_COMMAND_LINE` to allow custom behavior in :meth:`Gio.Application.do_command_line()`. In combination with :meth:`Gio.Application.add_main_option()` to add custom options.
pt_br: Você pode usar o `HANDLES_COMMAND_LINE` para permitir um comportamento customizado em :meth:`Gio.Application.do_command_line()`. Em combinação com :meth:`Gio.Application.add_main_option()` para adicionar opções personalizadas.
sv: Du kan använda `HANDLES_COMMAND_LINE` för att tillåta anpassat beteende i :meth:`Gio.Application.do_command_line()`. Kombinera med :meth:`Gio.Application.add_main_option()` för att lägga till anpassade alternativ.

source: Using `HANDLES_OPEN` will do the work of simply taking file arguments for you and let you handle it in :meth:`Gio.Application.do_open()`.
pt_br: Usar `HANDLES_OPEN` fará o trabalho de simplesmente pegar argumentos de arquivo para você e permitir que você os manipule em :meth:`Gio.Application.do_open()`.
sv: Att använda `HANDLES_OPEN` kommer göra jobbet med att helt enkelt ta filargument åt dig och låta dig hantera det i :meth:`Gio.Application.do_open()`.

source: If your application is already open these will all be sent to the existing instance unless you use `NON_UNIQUE` to allow multiple instances.
pt_br: Se o seu aplicativo já estiver aberto, todos serão enviados para a instância existente, a menos que você use `NON_UNIQUE` para permitir várias instâncias.
sv: Om ditt program redan är öppet kommer alla dessa sändas till den befintliga instansen om du inte använder `NON_UNIQUE` för att tillåta flera instanser.

source: Example
sv: Exempel

source: See Also
sv: Se även

source: Basics
pt_br: Noções básicas
sv: Grunder

source: This section will introduce some of the most important aspects of GTK+.
pt_br: Esta seção apresentará alguns dos aspectos mais importantes do GTK+.
sv: Detta avsnitt kommer introducera några av de viktigaste aspekterna i GTK+.

source: Main loop and Signals
pt_br: Loop principal e sinais
sv: Huvudslinga och signaler

source: Like most GUI toolkits, GTK+ uses an event-driven programming model. When the user is doing nothing, GTK+ sits in the main loop and waits for input. If the user performs some action - say, a mouse click - then the main loop "wakes up" and delivers an event to GTK+.
pt_br: Como a maioria dos toolkits GUI, o GTK+ usa um modelo de programação orientada a eventos. Quando o usuário não está fazendo nada, o GTK+ fica no loop principal e aguarda a entrada. Se o usuário executar alguma ação - digamos, um clique do mouse - o loop principal "acorda" e entrega um evento para o GTK+.
sv: Som de flesta verktygslådor för grafiska användargränssnitt använder GTK+ en händelsedriven programmeringsmodell. Då användaren gör något sitter GTK+ i huvudslingan och väntar på inmatning. Om användaren utför någon åtgärd - exempelvis ett musklick - så ”vaknar” huvudslingan och levererar en händelse till GTK+.

source: When widgets receive an event, they frequently emit one or more signals. Signals notify your program that "something interesting happened" by invoking functions you've connected to the signal. Such functions are commonly known as *callbacks*. When your callbacks are invoked, you would typically take some action - for example, when an Open button is clicked you might display a file chooser dialog. After a callback finishes, GTK+ will return to the main loop and await more user input.
pt_br: Quando widgets recebem um evento, eles frequentemente emitem um ou mais sinais. Sinais notificam seu programa que "algo interessante aconteceu" invocando funções que você conectou ao sinal. Tais funções são comumente conhecidas como *callbacks*. Quando seus retornos de chamada são invocados, você normalmente toma algumas ações - por exemplo, quando um botão Abrir é clicado, você pode exibir uma caixa de diálogo de seleção de arquivos. Depois que um retorno de chamada terminar, o GTK+ retornará ao loop principal e aguardará mais entrada do usuário.
sv: När komponenter tar emot en händelse så sänder de ofta ut en eller flera signaler. Signaler meddelar ditt program att ”något intressant inträffade” genom att anropa funktioner som du anslutit till signalen. Sådana funktioner kallas vanligen *återanrop*. Då dina återanrop anropas skulle du vanligen utföra någon åtgärd - då exempelvis en Öppna-knapp klickas på kanske du visar en filväljardialog. Efter att ett återanrop slutförs kommer GTK+ återgå till huvudslingan och vänta på mer användarinmatning.

source: A generic example is:
pt_br: Um exemplo genérico é:
sv: Ett generiskt exempel är:

source: Firstly, *widget* is an instance of a widget we created earlier. Next, the event we are interested in. Each widget has its own particular events which can occur. For instance, if you have a button you usually want to connect to the "clicked" event. This means that when the button is clicked, the signal is issued. Thirdly, the *callback* argument is the name of the callback function. It contains the code which runs when signals of the specified type are issued. Finally, the *data* argument includes any data which should be passed when the signal is issued. However, this argument is completely optional and can be left out if not required.
pt_br: Em primeiro lugar, *widget* é uma instância de um widget que criamos anteriormente. Em seguida, o evento em que estamos interessados. Cada widget tem seus próprios eventos específicos que podem ocorrer. Por exemplo, se você tem um botão, geralmente deseja se conectar ao evento "clicado". Isso significa que quando o botão é clicado, o sinal é emitido. Em terceiro lugar, o argumento *callback* é o nome da função de retorno de chamada. Ele contém o código que é executado quando os sinais do tipo especificado são emitidos. Finalmente, o argumento *data* inclui todos os dados que devem ser passados quando o sinal é emitido. No entanto, esse argumento é completamente opcional e pode ser deixado de fora se não for necessário.
sv: Först så är *widget* en instans av en komponent vi skapade tidigare. Härnäst är händelsen ”event” som vi är intresserade av. Varje komponent har sina egna specifika händelser som kan inträffa. Om du exempelvis har en knapp så skulle du vanligen vilja ansluta den till händelsen ”clicked”. Det här betyder att när knappen klickas på så utfärdas signalen. Som trea kommer argumentet *callback* som är namnet på återanropsfunktionen. Den innehåller koden som körs när signaler av den angivna typen utfärdas. Slutligen inkluderar argumentet *data* de data som ska skickas när signalen utfärdas. Detta argument är dock fullständigt valfritt och kan utelämnas om det inte behövs.

source: The function returns a number that identifies this particular signal-callback pair. It is required to disconnect from a signal such that the callback function will not be called during any future or currently ongoing emissions of the signal it has been connected to.
pt_br: A função retorna um número que identifica esse par de retorno de chamada específico. É necessário desconectar de um sinal de modo que a função de retorno de chamada não seja chamada durante qualquer emissão futura ou atual do sinal ao qual está conectada.
sv: Funktionen returnerar ett tal som identifierar detta specifika signal-återanropspar. Det krävs för att koppla bort från en signal så att återanropsfunktionen inte kommer anropas under framtida eller aktuellt pågående utsändningar av signalen den har anslutits till.

source: If you have lost the "handler_id" for some reason (for example the handlers were installed using :func:`Gtk.Builder.connect_signals`), you can still disconnect a specific callback using the function :func:`disconnect_by_func`:
pt_br: Se você perdeu o "handler_id" por algum motivo (por exemplo, os manipuladores foram instalados usando :func:`Gtk.Builder.connect_signals`), você ainda pode desconectar um callback específico usando a função :func:`disconnect_by_func`:
sv: Om du förlorat ”handler_id” av någon anledning (till exempel för att hanterarna installerades med :func:`Gtk.Builder.connect_signals`), så kan du fortfarande koppla från ett specifikt återanrop med funktionen :func:`disconnect_by_func`:

source: Applications should connect to the "destroy" signal of the top-level window. It is emitted when an object is destroyed, so when a user requests that a toplevel window is closed, the default handler for this signal destroys the window, but does not terminate the application. Connecting the "destroy" signal of the top-level window to the function :func:`Gtk.main_quit` will result in the desired behaviour.
sv: Program bör ansluta till toppnivåfönstrets ”destroy”-signal. Den sänds ut när ett objekt förstörs, så när en användare begär att ett toppnivåfönster stängs så förstör standardhanteraren för denna signal fönstret, men avslutar inte programmet. Att ansluta ”destroy”-signalen för toppnivåfönstret till funktionen :func:`Gtk.main_quit` kommer att resultera i det önskade beteendet.

source: Calling :func:`Gtk.main_quit` makes the main loop inside of :func:`Gtk.main` return.
pt_br: Chamar :func:`Gtk.main_quit` faz o loop principal dentro do retorno de :func:`Gtk.main`.
sv: Att anropa :func:`Gtk.main_quit` får huvudslingan i :func:`Gtk.main` att returnera.

source: Properties
sv: Egenskaper

source: Properties describe the configuration and state of widgets. As for signals, each widget has its own particular set of properties. For example, a button has the property "label" which contains the text of the label widget inside the button. You can specify the name and value of any number of properties as keyword arguments when creating an instance of a widget. To create a label aligned to the right with the text "Hello World" and an angle of 25 degrees, use:
pt_br: Propriedades descrevem a configuração e o estado dos widgets. Quanto aos sinais, cada widget tem seu próprio conjunto particular de propriedades. Por exemplo, um botão tem a propriedade "label", que contém o texto do widget de etiqueta dentro do botão. Você pode especificar o nome e o valor de qualquer número de propriedades como argumentos de palavras-chave ao criar uma instância de um widget. Para criar um rótulo alinhado à direita com o texto "Hello World" e um ângulo de 25 graus, use:
sv: Egenskaper beskriver konfigurationen och tillståndet för komponenter. Som för signaler så har varje komponent sin specifika uppsättning egenskaper. Exempelvis har en knapp egenskapen ”label” som innehåller texten för label-komponenten i knappen. Du kan ange namnet och värdet på valfritt antal egenskaper som nyckelordsargument då du skapar en instans av en komponent. För att skapa en högerjusterad etikett med texten ”Hello World” och en vinkel på 25 grader, använd:

source: which is equivalent to
pt_br: que é equivalente a
sv: vilket är ekvivalent med

source: Instead of using getters and setters you can also get and set the gobject properties through the "props" property such as ``widget.props.prop_name = value``. This is equivalent to the more verbose ``widget.get_property("prop-name")`` and ``widget.set_property("prop-name", value)``.
pt_br: Em vez de usar getters e setters, você também pode obter e definir as propriedades do gobject através da propriedade "props", como ``widget.props.prop_name = value``. Isto é equivalente ao mais detalhado ``widget.get_property("prop-name")`` e ``widget.set_property("prop-name", value)``.
sv: Istället för att använda get- och set-metoder kan du också erhålla och ställa in gobjekt-egenskaperna genom egenskapen ”props” som ``widget.props.egenskapsnamn = värde``. Detta är ekvivalent med det mer utförliga ``widget.get_property("egenskapsnamn")`` och ``widget.set_property("egenskapsnamn", värde)``.

source: To see which properties are available for a widget in the running version of GTK you can "dir" the "props" property:
pt_br: Para ver quais propriedades estão disponíveis para um widget na versão em execução do GTK, você pode usar "dir" com a propriedade "props":
sv: För att se vilka egenskaper som är tillgängliga för en komponent i versionen som körs av GTK kan du köra ”dir” på egenskapen ”props”:

source: This will print in the console the list of properties a Gtk.Box has.
pt_br: Isto irá imprimir no console a lista de propriedades que um Gtk.Box possui.
sv: Detta kommer i konsolen skriva listan av egenskaper som en Gtk.Box har.

source: Glade and Gtk.Builder
pt_br: Glade e Gtk.Builder
sv: Glade och Gtk.Builder

source: The :class:`Gtk.Builder` class offers you the opportunity to design user interfaces without writing a single line of code. This is possible through describing the interface by an XML file and then loading the XML description at runtime and create the objects automatically, which the Builder class does for you. For the purpose of not needing to write the XML manually the `Glade <https://glade.gnome.org/>`_ application lets you create the user interface in a WYSIWYG (what you see is what you get) manner
sv: Klassen :class:`Gtk.Builder` ger dig möjligheten att designa användargränssnitt utan att skriva en enda rad kod. Detta är möjligt genom att beskriva gränssnittet med en XML-fil och sedan läsa in XML-beskrivningen under körtid och skapa objekten automatiskt, vilket Builder-klassen gör åt dig. För att inte behöva skriva denna XML manuellt låter programmet `Glade <https://glade.gnome.org/>`_ dig skapa användargränssnittet på ett WYSIWYG-sätt (What You See Is What You Get, vad du ser är vad du får)

source: This method has several advantages:
pt_br: Esse método possui várias vantagens:
sv: Denna metod har flera fördelar:

source: Less code needs to be written.
pt_br: Menos código precisa ser escrito.
sv: Mindre kod behöver skrivas.

source: UI changes can be seen more quickly, so UIs are able to improve.
pt_br: As mudanças da interface do usuário podem ser vistas mais rapidamente, para que as interfaces de usuário possam melhorar.
sv: Ändringar i användargränssnitten kan ses snabbare, så de kan förbättras.

source: Designers without programming skills can create and edit UIs.
pt_br: Designers sem habilidades de programação podem criar e editar interfaces de usuário.
sv: Designers utan programmeringskunskap kan skapa och redigera användargränssnitt.

source: The description of the user interface is independent from the programming language being used.
pt_br: A descrição da interface do usuário é independente da linguagem de programação utilizada.
sv: Beskrivningen av användargränssnittet är oberoende av programmeringsspråket som används.

source: There is still code required for handling interface changes triggered by the user, but :class:`Gtk.Builder` allows you to focus on implementing that functionality.
pt_br: Ainda existe código necessário para lidar com mudanças de interface acionadas pelo usuário, mas :class:`Gtk.Builder` permite que você se concentre em implementar essa funcionalidade.
sv: Det finns fortfarande kod som krävs för att hantera gränssnittsändringar som utlöses av användaren, men :class:`Gtk.Builder` låter dig fokusera på att implementera den funktionaliteten.

source: Creating and loading the .glade file
pt_br: Criando e carregando o arquivo .glade
sv: Skapa och läsa in .glade-filen

source: First of all you have to download and install Glade. There are `several tutorials <https://wiki.gnome.org/action/show/Apps/Glade/Tutorials>`_ about Glade, so this is not explained here in detail. Let's start by creating a window with a button in it and saving it to a file named *example.glade*. The resulting XML file should look like this.
pt_br: Primeiro de tudo você tem que baixar e instalar o Glade. Existem `vários tutoriais <https://wiki.gnome.org/action/show/Apps/Glade/Tutorials>`_ sobre o Glade, então isso não é explicado aqui em detalhes. Vamos começar criando uma janela com um botão e salvando-a em um arquivo chamado *example.glade*. O arquivo XML resultante deve se parecer com isso.
sv: Först måste du hämta och installera Glade. Det finns `flera handledningar <https://wiki.gnome.org/action/show/Apps/Glade/Tutorials>`_ om Glade, så det förklaras här inte i detalj. Låt oss starta med att skapa ett fönster med en knapp i, och spara till en fil med namnet *example.glade*. Den resulterande XML-filen bör se ut så här.

source: To load this file in Python we need a :class:`Gtk.Builder` object.
pt_br: Para carregar este arquivo em Python, precisamos de um objeto :class:`Gtk.Builder`.
sv: För att läsa in denna fil i Python behöver vi ett :class:`Gtk.Builder`-objekt.

source: The second line loads all objects defined in *example.glade* into the Builder object.
pt_br: A segunda linha carrega todos os objetos definidos em *example.glade* no objeto Builder.
sv: Den andra raden läser in alla objekt som definieras i *example.glade* till Builder-objektet.
