Repository: sebp/PyGObject-Tutorial
Catalog: translations/po/*.po
Languages: pt_br, sv

source: A :class:`Gtk.IconView` is a widget that displays a collection of icons in a grid view. It supports features such as drag and drop, multiple selections and item reordering.
pt_br: A :class:`Gtk.IconView` é um widget que exibe uma coleção de ícones em uma visualização de grade. Ele suporta recursos como arrastar e soltar, seleções múltiplas e reordenação de itens.
sv: En :class:`Gtk.IconView` är en komponent som visar en samling ikoner i en rutnätsvy. Den stöder funktioner så som dra-och-släpp, flerval och att ändra ordning på objekt.

source: Similarly to :class:`Gtk.TreeView`, :class:`Gtk.IconView` uses a :class:`Gtk.ListStore` for its model. Instead of using :ref:`cell renderers <cellrenderers>`, :class:`Gtk.IconView` requires that one of the columns in its :class:`Gtk.ListStore` contains :class:`GdkPixbuf.Pixbuf` objects.
pt_br: Similarmente a :class:`Gtk.TreeView`, :class:`Gtk.IconView` usa um :class:`Gtk.ListStore` para seu modelo. Em vez de usar :ref:`renderizadores de célula <cellrenderers>`, :class:`Gtk.IconView` requer que uma das colunas em seu :class:`Gtk.ListStore` contenha objetos :class:`GdkPixbuf.Pixbuf`.
sv: Liknande :class:`Gtk.TreeView` använder :class:`Gtk.IconView` en :class:`Gtk.ListStore` för sin modell. Istället för att använda :ref:`cellrenderare <cellrenderers>`, kräver :class:`Gtk.IconView` att en av kolumnerna i dess :class:`Gtk.ListStore` innehåller :class:`GdkPixbuf.Pixbuf`-objekt.

source: :class:`Gtk.IconView` supports numerous selection modes to allow for either selecting multiple icons at a time, restricting selections to just one item or disallowing selecting items completely. To specify a selection mode, the :meth:`Gtk.IconView.set_selection_mode` method is used with one of the :class:`Gtk.SelectionMode` selection modes.
pt_br: :class:`Gtk.IconView` suporta vários modos de seleção para permitir a seleção de vários ícones por vez, restringindo seleções para apenas um item ou desaprovando a seleção de itens completamente. Para especificar um modo de seleção, o método :meth:`Gtk.IconView.set_selection_mode` é usado com um dos modos de seleção :class:`Gtk.SelectionMode`.
sv: :class:`Gtk.IconView` stöder flera markeringslägen för att tillåta antingen markering av flera ikoner samtidigt, begränsa markeringar till bara ett objekt eller helt förbjuda markering av objekt. För att ange ett markeringsläge används metoden :meth:`Gtk.IconView.set_selection_mode` med ett av markeringslägena i :class:`Gtk.SelectionMode`.

source: Deprecated
pt_br: Descontinuada
sv: Föråldrat

source: The Python GTK+ 3 Tutorial
pt_br: O tutorial do Python GTK+ 3
sv: Python-handledningen för GTK+ 3

source: Release
sv: Utgåva

source: Date
sv: Datum

source: GNU Free Documentation License 1.3 with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts
pt_br: GNU Free Documentation License 1.3 sem Seções Invariantes, Textos de Capa Frontal e Textos de Contra-capa
sv: GNU Free Documentation License 1.3 utan standardavsnitt och omslagstexter

source: This tutorial gives an introduction to writing GTK+ 3 applications in Python.
pt_br: Este tutorial fornece uma introdução à criação de aplicativos GTK + 3 no Python.
sv: Denna handledning ger en introduktion till att skriva GTK+ 3-program i Python.

source: Prior to working through this tutorial, it is recommended that you have a reasonable grasp of the Python programming language. GUI programming introduces new problems compared to interacting with the standard output (console / terminal). It is necessary for you to know how to create and run Python files, understand basic interpreter errors, and work with strings, integers, floats and Boolean values. For the more advanced widgets in this tutorial, good knowledge of lists and tuples will be needed.
pt_br: Antes de trabalhar com este tutorial, é recomendável que você tenha uma compreensão razoável da linguagem de programação Python. A programação GUI introduz novos problemas em comparação com a interação com a saída padrão (console / terminal). É necessário que você saiba como criar e executar arquivos Python, entender os erros básicos do interpretador e trabalhar com strings, inteiros, floats e valores booleanos. Para os widgets mais avançados neste tutorial, serão necessários bons conhecimentos de listas e tuplas.
sv: Innan du arbetar dig genom denna handledning så är det rekommenderat att du har rimlig förståelse av programmeringsspråket Python. Programmering av grafiska användargränssnitt introducerar nya problem jämfört med att interagera med standardutmatning (konsol / terminal). Det är nödvändigt för dig att veta hur du skapar och kör Python-filer, förstår enkla tolkfel, hur du arbetar med strängar, heltal, flyttal och booleska värden. För de mer avancerade komponenterna i denna handledning kommer god kunskap om listor och tupler vara nödvändig.

source: Although this tutorial describes the most important classes and methods within GTK+ 3, it is not supposed to serve as an API reference. Please refer to the `GTK+ 3 Reference Manual <https://developer.gnome.org/gtk3/stable/>`_ for a detailed description of the API. Also there's a `Python-specific reference <https://lazka.github.io/pgi-docs/>`_ available.
pt_br: Embora este tutorial descreva as classes e métodos mais importantes dentro do GTK + 3, ele não deve servir como uma referência da API. Por favor, consulte o `Manual de Referência do GTK+ 3 <https://developer.gnome.org/gtk3/stable/>`_ para uma descrição detalhada da API. Também há uma referência específica ao Python <https://lazka.github.io/pgi-docs/>`_ disponível.
sv: Även om denna handledning beskriver de viktigaste klasserna och metoderna i GTK+ 3 så är den inte tänkt att tjäna som en API-referens. Se `Referenshandboken för GTK+ 3 <https://developer.gnome.org/gtk3/stable/>`_ för en detaljerad beskrivning av API:t. Det finns även en `Python-specifik referens <https://lazka.github.io/pgi-docs/>`_ tillgänglig.

source: Contents:
pt_br: Conteúdo:
sv: Innehåll:

source: Indices and tables
pt_br: Índices e tabelas
sv: Index och tabeller

source: The first step before we start with actual coding consists of setting up `PyGObject`_ and its dependencies. PyGObject is a Python module that enables developers to access GObject-based libraries such as GTK+ within Python. It exclusively supports GTK+ version 3 or later.
sv: Det första steget innan vi börjar med faktisk kodning består i att konfigurera `PyGObject`_ och dess beroenden. PyGObject är en Python-modul som låter utvecklare komma åt GObject-baserade bibliotek så som GTK+ i Python. Dess stöd är begränsat till GTK+ version 3 eller senare.

source: Dependencies
pt_br: Dependências
sv: Beroenden

source: Python 2 (2.6 or later) or Python 3 (3.1 or later)
pt_br: Python 2 (2.6 ou posterior) ou Python 3 (3.1 ou posterior)
sv: Python 2 (2.6 eller senare) eller Python 3 (3.1 eller senare)

source: Prebuilt Packages
pt_br: Pacotes pré-construídos
sv: Förbyggda paket

source: Recent versions of PyGObject and its dependencies are packaged by nearly all major Linux distributions. So, if you use Linux, you can probably get started by installing the package from the official repository for your distribution.
pt_br: Versões recentes do PyGObject e suas dependências são empacotadas por quase todas as principais distribuições do Linux. Então, se você usa o Linux, você provavelmente pode começar instalando o pacote a partir do repositório oficial da sua distribuição.
sv: De senaste versionerna av PyGObject och dess beroenden paketeras av nästan alla stora Linux-distributioner. Så om du använder Linux kan du troligen komma igång genom att installera paketet från det officiella förrådet för din distribution.

source: Installing From Source
pt_br: Instalando a partir da origem
sv: Installera från källkod

source: The easiest way to install PyGObject from source is using `JHBuild`_. It is designed to easily build source packages and discover what dependencies need to be build and in what order. To setup JHBuild, please follow the `JHBuild manual`_.
pt_br: A maneira mais fácil de instalar o PyGObject a partir do código-fonte é usando o `JHBuild`_. Ele é projetado para criar facilmente pacotes de código-fonte e descobrir quais dependências precisam ser construídas e em que ordem. Para configurar o JHBuild, por favor, siga o `manual do JHBuild`_.
sv: Det lättaste sättet att installera PyGObject från källkod är genom att använda `JHBuild`_. Det är designat för att lätt bygga källpaket och upptäcka vilka beroenden som måste byggas och i vilken ordning. För att konfigurera JHBuild, följ `JHBuild-handboken`_.

source: Once you have installed JHBuild successfully, download the latest configuration from [#]_. Copy files with the suffix `.modules` to JHBuild's module directory and the file `sample-tarball.jhbuildrc` to `~/.jhbuildrc`.
pt_br: Depois de ter instalado o JHBuild com sucesso, baixe a configuração mais recente de [#]_. Copie os arquivos com o sufixo `.modules` para o diretório de módulos do JHBuild e o arquivo `sample-tarball.jhbuildrc` para `~/.jhbuildrc`.
sv: När du har installerat JHBuild, hämta den senaste konfigurationen från [#]_. Kopiera filer med filändelsen `.modules` to JHBuilds modulkatalog och filen `sample-tarball.jhbuildrc` till `~/.jhbuildrc`.

source: If you have not done it before, verify that your build environment is setup correctly by running::
pt_br: Se você não tiver feito isso antes, verifique se o seu ambiente de compilação está configurado corretamente executando:
sv: Om du inte har gjort det tidigare kan du bekräfta att din byggmiljö är konfigurerad riktigt genom att köra::

source: It will print any applications and libraries that are currently missing on your system but required for building. You should install those using your distribution's package repository. A list of `package names <https://wiki.gnome.org/action/show/Projects/Jhbuild/Dependencies>`_ for different distributions is maintained on the GNOME wiki. Run the command above again to ensure the required tools are present.
pt_br: Ele imprimirá todos os aplicativos e bibliotecas que estiverem ausentes no seu sistema, mas necessários para construção. Você deve instalá-los usando o repositório de pacotes da sua distribuição. Uma lista de `nomes de pacotes <https://wiki.gnome.org/action/show/Projects/Jhbuild/Dependencies>` _ para diferentes distribuições é mantida no wiki GNOME. Execute o comando acima novamente para garantir que as ferramentas necessárias estejam presentes.
sv: Det kommer skriva ut alla program och bibliotek som för närvarande saknas på ditt system men behövs för att bygga. Du bör installera dessa genom din distributions paketförråd. En lista över `paketnamn <https://wiki.gnome.org/action/show/Projects/Jhbuild/Dependencies>`_ för olika distributioner finns på GNOME-wikin. Kör kommandot ovan igen för att säkerställa att de nödvändiga verktygen är tillgängliga.

source: Executing the following command will build PyGObject and all its dependencies::
pt_br: Executando o seguinte comando irá construir o PyGObject e todas as suas dependências::
sv: Att köra följande kommando kommer bygga PyGObject och alla dess beroenden::

source: Finally, you might want to install GTK+ from source as well::
pt_br: Finalmente, você pode querer instalar o GTK+ a partir do código fonte::
sv: Slutligen kan du även vilja installera GTK+ från källkod::

source: To start a shell with the same environment as used by JHBuild, run::
pt_br: Para iniciar um shell com o mesmo ambiente usado pelo JHBuild, execute::
sv: För att starta ett skal med samma miljö som används av JHBuild, kör::

source: Getting Started
pt_br: Começando
sv: Komma igång

source: Simple Example
pt_br: Exemplo Simples
sv: Enkelt exempel

source: To start with our tutorial we create the simplest program possible. This program will create an empty 200 x 200 pixel window.
pt_br: Para começar com o nosso tutorial, criamos o programa mais simples possível. Este programa irá criar uma janela vazia de 200 x 200 pixels.
sv: För att starta med vår handledning skapar vi det enklast tänkbara programmet. Detta program kommer skapa ett tomt fönster som är 200 x 200 bildpunkter stort.

source: We will now explain each line of the example.
pt_br: Vamos agora explicar cada linha do exemplo.
sv: Vi kommer nu förklara varje rad i exemplet.

source: In the beginning, we have to import the Gtk module to be able to access GTK+'s classes and functions. Since a user's system can have multiple versions of GTK+ installed at the same, we want to make sure that when we import Gtk that it refers to GTK+ 3 and not any other version of the library, which is the purpose of the statement ``gi.require_version('Gtk', '3.0')``.
pt_br: No começo, temos que importar o módulo Gtk para poder acessar as classes e funções do GTK+. Como o sistema de um usuário pode ter várias versões do GTK+ instaladas ao mesmo tempo, queremos ter certeza de que, quando importamos o Gtk, ele se refere ao GTK+ 3 e não a qualquer outra versão da biblioteca, que é o propósito da declaração ``gi.require_version('Gtk', '3.0')``.
sv: I början måste vi importera Gtk-modulen för att kunna komma åt GTK+:s klasser och funktioner. Då en användares system kan ha flera versioner av GTK+ installerade samtidigt så vill vi säkerställa att då vi importerar Gtk så refererar det till GTK+ 3 och inte någon annan version av biblioteket, vilket är syftet med satsen ``gi.require_version('Gtk', '3.0')``.

source: The next line creates an empty window.
pt_br: A próxima linha cria uma janela vazia.
sv: Nästa rad skapar ett tomt fönster.

source: Followed by connecting to the window's delete event to ensure that the application is terminated if we click on the *x* to close the window.
pt_br: Seguido conectando-se ao evento de exclusão da janela para garantir que o aplicativo seja encerrado se clicarmos no *x* para fechar a janela.
sv: Följt av att ansluta till fönstrets borttagningshändelse för att säkerställa att programmet stängs om vi klickar på *x* för att stänga fönstret.

source: In the next step we display the window.
pt_br: Na próxima etapa, exibimos a janela.
sv: I nästa steg visar vi fönstret.

source: Finally, we start the GTK+ processing loop which we quit when the window is closed (see line 6).
sv: Slutligen startar vi GTK+-bearbetningsslingan som vi avslutar när fönstret stängs (se rad 6).

source: To run the program, open a terminal, change to the directory of the file, and enter::
pt_br: Para executar o programa, abra um terminal, mude para o diretório do arquivo e digite::
sv: För att köra programmet, öppna en terminal, ändra till filens katalog, och mata in::

source: Extended Example
pt_br: Exemplo Estendido
sv: Utökat exempel

source: For something a little more useful, here's the PyGObject version of the classic "Hello World" program.
pt_br: Para algo um pouco mais útil, aqui está a versão PyGObject do programa clássico "Hello World".
sv: För något som är lite mer användbart kommer här PyGObject-versionen av det klassiska ”Hej världen”-programmet.

source: This example differs from the simple example as we sub-class :class:`Gtk.Window` to define our own :class:`MyWindow` class.
pt_br: Este exemplo difere do exemplo simples, pois subclassificamos :class:`Gtk.Window` para definir nossa própria classe :class:`MyWindow`.
sv: Detta exempel skiljer sig från det enkla exemplet då vi gör en underklass till :class:`Gtk.Window` för att skapa vår egen klass :class:`MyWindow`.

source: In the class's constructor we have to call the constructor of the super class. In addition, we tell it to set the value of the property `title` to `Hello World`.
pt_br: No construtor da classe, temos que chamar o construtor da superclasse. Além disso, dizemos para definir o valor da propriedade `title` como `Hello World`.
sv: I klassens konstruktor måste vi anropa superklassens konstruktor. Dessutom säger vi till den att ställa in värdet på egenskapen `title` till `Hello World`.

source: The next three lines are used to create a button widget, connect to its `clicked` signal and add it as child to the top-level window.
pt_br: As próximas três linhas são usadas para criar um widget de botão, conectar ao seu sinal de 'clicado' e adicioná-lo como filho à janela de nível superior.
sv: De nästa tre raderna används för att skapa en knappkomponent, ansluta till dess `clicked`-signal och lägga till den som barn till toppnivåfönstret.

source: Accordingly, the method :meth:`on_button_clicked` will be called if you click on the button.
pt_br: Assim, o método :meth:`on_button_clicked` será chamado se você clicar no botão.
sv: På det viset kommer metoden :meth:`on_button_clicked` att anropas om du klickar på knappen.

source: The last block, outside of the class, is very similar to the simple example above, but instead of creating an instance of the generic :class:`Gtk.Window` class, we create an instance of :class:`MyWindow`.
pt_br: O último bloco, fora da classe, é muito semelhante ao exemplo acima, mas ao invés de criar uma instância da classe genérica :class:`Gtk.Window`, criamos uma instância de :class:`MyWindow`.
sv: Det sista blocket, utanför klassen, är väldigt likt det enkla exemplet ovan, men istället för att skapa en instans av den generiska klassen :class:`Gtk.Window`, så skapar vi en instans av :class:`MyWindow`.

source: Labels are the main method of placing non-editable text in windows, for instance to place a title next to a :class:`Gtk.Entry` widget. You can specify the text in the constructor, or later with the :meth:`Gtk.Label.set_text` or :meth:`Gtk.Label.set_markup` methods.
pt_br: Os rótulos são o principal método de colocar texto não editável nas janelas, por exemplo, para colocar um título ao lado de um widget :class:`Gtk.Entry`. Você pode especificar o texto no construtor, ou mais tarde com os métodos :meth:`Gtk.Label.set_text` ou :meth:`Gtk.Label.set_markup`.
sv: Etiketter är huvudmetoden för att placera ej redigerbar text i fönster, exempelvis för att placera en titel intill en :class:`Gtk.Entry`-komponent. Du kan ange texten i konstruktorn, eller senare med metoderna :meth:`Gtk.Label.set_text` eller :meth:`Gtk.Label.set_markup`.

source: The width of the label will be adjusted automatically. You can produce multi-line labels by putting line breaks ("\\n") in the label string.
pt_br: A largura da etiqueta será ajustada automaticamente. Você pode produzir rótulos de várias linhas colocando as quebras de linha ("\\n") na sequência de rótulos.
sv: Bredden på etiketten kommer justeras automatiskt. Du kan skapa etiketter med flera rader genom att stoppa nyrader (”\\n”) i etikettsträngen.

source: Labels can be made selectable with :meth:`Gtk.Label.set_selectable`. Selectable labels allow the user to copy the label contents to the clipboard. Only labels that contain useful-to-copy information — such as error messages — should be made selectable.
pt_br: Os rótulos podem ser feitos selecionáveis com :meth:`Gtk.Label.set_selectable`. Rótulos selecionáveis permitem que o usuário copie o conteúdo do rótulo para a área de transferência. Somente os rótulos que contêm informações úteis para copiar, como mensagens de erro, devem ser selecionáveis.
sv: Etiketter kan göras markerbara med :meth:`Gtk.Label.set_selectable`. Markerbara etiketter låter användaren kopiera etikettinnehållet till urklipp. Endast etiketter som innehåller information som är användbar att kopiera — så som felmeddelanden — bör göras markerbara.

source: The label text can be justified using the :meth:`Gtk.Label.set_justify` method. The widget is also capable of word-wrapping, which can be activated with :meth:`Gtk.Label.set_line_wrap`.
pt_br: O texto do rótulo pode ser justificado usando o método :meth:`Gtk.Label.set_justify`. O widget também é capaz de quebra automática de palavras, que pode ser ativado com :meth:`Gtk.Label.set_line_wrap`.
sv: Etikettexten kan justeras med metoden :meth:`Gtk.Label.set_justify`. Komponenten kan också radbryta, vilket kan aktiveras med :meth:`Gtk.Label.set_line_wrap`.

source: :class:`Gtk.Label` support some simple formatting, for instance allowing you to make some text bold, colored, or larger. You can do this by providing a string to :meth:`Gtk.Label.set_markup`, using the Pango Markup syntax [#pango]_. For instance, ``<b>bold text</b> and <s>strikethrough text</s>``. In addition, :class:`Gtk.Label` supports clickable hyperlinks. The markup for links is borrowed from HTML, using the a with href and title attributes. GTK+ renders links similar to the way they appear in web browsers, with colored, underlined text. The title attribute is displayed as a tooltip on the link.
pt_br: :class:`Gtk.Label` suporta algumas formatações simples, por exemplo, permitindo que você crie algum texto em negrito, colorido ou maior. Você pode fazer isso fornecendo uma string para :meth:`Gtk.Label.set_markup`, usando a sintaxe de marcação do Pango [#pango]_. Por exemplo, ``<b>texto em negrito</b> e <s>texto tachado</s>``. Além disso, :class:`Gtk.Label` suporta hiperlinks clicáveis. A marcação para links é emprestada do HTML, usando os atributos a com href e title. O GTK+ renderiza links semelhantes ao modo como aparecem nos navegadores da web, com texto colorido e sublinhado. O atributo de título é exibido como uma dica de ferramenta no link.
sv: :class:`Gtk.Label` stöder viss enkel formatering, exempelvis låter den dig göra text fet, färgad eller större. Du kan göra detta genom att tillhandahålla en sträng till :meth:`Gtk.Label.set_markup`, med Pango Markup-syntaxen [#pango]_. Exempelvis ``<b>fet text</b> och <s>genomstruken text</s>``. Dessutom stöder :class:`Gtk.Label` klickbara hyperlänkar. Markup för länkar har lånats från HTML, och använder ”a” med attributen href och title. GTK+ renderar länkar liknande hur de visas i webbläsare, med färgad, understruken text. Attributet title visas som en inforuta över länken.

source: Labels may contain *mnemonics*. Mnemonics are underlined characters in the label, used for keyboard navigation. Mnemonics are created by providing a string with an underscore before the mnemonic character, such as "_File", to the functions :meth:`Gtk.Label.new_with_mnemonic` or :meth:`Gtk.Label.set_text_with_mnemonic`. Mnemonics automatically activate any activatable widget the label is inside, such as a :class:`Gtk.Button`; if the label is not inside the mnemonic's target widget, you have to tell the label about the target using :meth:`Gtk.Label.set_mnemonic_widget`.
pt_br: Os rótulos podem conter *mnemônicos*. Os mnemônicos são caracteres sublinhados no rótulo, usados para navegação pelo teclado. Os mnemônicos são criados fornecendo uma string com um sublinhado antes do caractere mnemônico, como "_File", para as funções :meth:`Gtk.Label.new_with_mnemonic` ou :meth:`Gtk.Label.set_text_with_mnemonic`. Os mnemônicos ativam automaticamente qualquer widget ativável em que o rótulo esteja dentro, como um :class:`Gtk.Button`; se o rótulo não estiver dentro do widget de destino do mnemônico, você deve informar o rótulo sobre o destino usando :meth:`Gtk.Label.set_mnemonic_widget`.
sv: Etiketter kan innehålla *snabbtangenter*. Snabbtangenter är understrukna tecken i etiketten, använda för tangentbordsnavigering. Snabbtangenter skapas genom att tillhandahålla en sträng med ett understreck innan tecknet för snabbtangenten, så som ”_Arkiv”, till funktionerna :meth:`Gtk.Label.new_with_mnemonic` eller :meth:`Gtk.Label.set_text_with_mnemonic`. Snabbtangenter aktiverar automatiskt alla aktiverbara komponenter som etiketten är i, så som en :class:`Gtk.Button`; om etiketten inte är inuti snabbtangentens målkomponent, så kommer du behöva säga till etiketten om målet med :meth:`Gtk.Label.set_mnemonic_widget`.

source: Layout Containers
pt_br: Containers de Layout
sv: Layoutbehållare
