Repository: sebp/PyGObject-Tutorial
Catalog: translations/po/*.po
Languages: pt_br, sv

source: A :class:`Gtk.TreeView` and its associated widgets are an extremely powerful way of displaying data. They are used in conjunction with a :class:`Gtk.ListStore` or :class:`Gtk.TreeStore` and provide a way of displaying and manipulating data in many ways, including:
pt_br: A :class:`Gtk.TreeView` e seus widgets associados são uma maneira extremamente poderosa de exibir dados. Eles são usados em conjunto com um :class:`Gtk.ListStore` ou :class:`Gtk.TreeStore` e fornecem uma maneira de exibir e manipular dados de várias maneiras, incluindo:
sv: En :class:`Gtk.TreeView` och dess associerade komponenter är ett extremt kraftfullt sätt att visa data. De används tillsammans med en :class:`Gtk.ListStore` eller :class:`Gtk.TreeStore` och tillhandahåller ett sätt att visa och manipulera data på många sätt, inklusive:

source: Automatic updates when data is added, removed or edited
sv: Automatiska uppdateringar då data läggs till, tas bort eller redigeras

source: Drag and drop support
pt_br: Suporte a Arrastar e Soltar
sv: Stöd för dra-och-släpp

source: Sorting data
sv: Sortering av data

source: Embedding widgets such as check boxes, progress bars, etc.
sv: Inbäddning av komponenter så som kryssrutor, förloppsindikatorer o.s.v.

source: Reorderable and resizable columns
pt_br: Colunas reordenáveis e redimensionáveis
sv: Kolumner som går att ordna om och ändra storlek på

source: Filtering data
sv: Filtrering av data

source: With the power and flexibility of a :class:`Gtk.TreeView` comes complexity. It is often difficult for beginner developers to be able to utilize it correctly due to the number of methods which are required.
pt_br: Com o poder e a flexibilidade de um :class:`Gtk.TreeView` vem a complexidade. Geralmente, é difícil para os desenvolvedores iniciantes serem capazes de utilizá-lo corretamente devido ao número de métodos necessários.
sv: Med kraften och flexibiliteten hos en :class:`Gtk.TreeView` kommer komplexitet. Det är ofta svårt för nybörjarutvecklare att kunna använda den korrekt på grund av de antal metoder som krävs.

source: Each :class:`Gtk.TreeView` has an associated :class:`Gtk.TreeModel`, which contains the data displayed by the TreeView. Each :class:`Gtk.TreeModel` can be used by more than one :class:`Gtk.TreeView`. For instance, this allows the same underlying data to be displayed and edited in 2 different ways at the same time. Or the 2 Views might display different columns from the same Model data, in the same way that 2 SQL queries (or "views") might show different fields from the same database table.
pt_br: Cada :class:`Gtk.TreeView` possui um :class:`Gtk.TreeModel`, que contém os dados exibidos pelo TreeView. Cada :class:`Gtk.TreeModel` pode ser usado por mais de um :class:`Gtk.TreeView`. Por exemplo, isso permite que os mesmos dados subjacentes sejam exibidos e editados de duas maneiras diferentes ao mesmo tempo. Ou os 2 modos de exibição podem exibir colunas diferentes dos mesmos dados do modelo, da mesma forma que duas consultas SQL (ou "visualizações") podem mostrar campos diferentes da mesma tabela de banco de dados.
sv: Varje :class:`Gtk.TreeView` har en associerad :class:`Gtk.TreeModel` som innehåller de data som visas av denna TreeView. Varje :class:`Gtk.TreeModel` kan användas av mer än en :class:`Gtk.TreeView`. Exempelvis låter detta samma underliggande data visas och redigeras på två olika sätt på samma gång. Eller så kan de två vyerna visa olika kolumner från samma Model-data, på samma sätt som två SQL-frågor (eller ”vyer”) kan visa olika fält från samma databastabell.

source: Although you can theoretically implement your own Model, you will normally use either the :class:`Gtk.ListStore` or :class:`Gtk.TreeStore` model classes. :class:`Gtk.ListStore` contains simple rows of data, and each row has no children, whereas :class:`Gtk.TreeStore` contains rows of data, and each row may have child rows.
pt_br: Embora você possa teoricamente implementar seu próprio Modelo, você normalmente usará as classes de modelo :class:`Gtk.ListStore` ou :class:`Gtk.TreeStore`. :class:`Gtk.ListStore` contém linhas simples de dados, e cada linha não tem filhos, enquanto :class:`Gtk.TreeStore` contém linhas de dados, e cada linha pode ter linhas filhas.
sv: Även om du teoretiskt kan implementera din egen Model, så kommer du vanligen använda antingen modellklasserna :class:`Gtk.ListStore` eller :class:`Gtk.TreeStore`. :class:`Gtk.ListStore` innehåller enkla rader med data, och varje rad har inget barn, medan :class:`Gtk.TreeStore` innehåller rader av data, och varje rad kan ha barnrader.

source: When constructing a model you have to specify the data types for each column the model holds.
pt_br: Ao construir um modelo, você deve especificar os tipos de dados para cada coluna que o modelo contém.
sv: Då du konstruerar en modell måste du ange datatyperna för varje kolumn som modellen innehåller.

source: This creates a list store with three columns, two string columns, and a float column.
pt_br: Isso cria um armazenamento de lista com três colunas, duas colunas de string e uma coluna flutuante.
sv: Detta skapar en listlagring med tre kolumner, två strängkolumner och en flyttalskolumn.

source: Adding data to the model is done using :meth:`Gtk.ListStore.append` or :meth:`Gtk.TreeStore.append`, depending upon which sort of model was created.
pt_br: A adição de dados ao modelo é feita usando :meth:`Gtk.ListStore.append` ou :meth:`Gtk.TreeStore.append`, dependendo de qual tipo de modelo foi criado.
sv: Att lägga till data till modellen görs med :meth:`Gtk.ListStore.append` eller :meth:`Gtk.TreeStore.append`, beroende på vilken sorts modell som skapades.

source: For a :class:`Gtk.ListStore`:
sv: För en :class:`Gtk.ListStore`:

source: For a :class:`Gtk.TreeStore` you must specify an existing row to append the new row to, using a :class:`Gtk.TreeIter`, or None for the top level of the tree:
sv: För en :class:`Gtk.TreeStore` måste du ange en befintlig rad att lägga till den nya raden till, med en :class:`Gtk.TreeIter`, eller None för toppnivån på trädet:

source: Both methods return a :class:`Gtk.TreeIter` instance, which points to the location of the newly inserted row. You can retrieve a :class:`Gtk.TreeIter` by calling :meth:`Gtk.TreeModel.get_iter`.
pt_br: Ambos os métodos retornam uma instância :class:`Gtk.TreeIter`, que aponta para a localização da linha recém-inserida. Você pode recuperar um :class:`Gtk.TreeIter` chamando :meth:`Gtk.TreeModel.get_iter`.
sv: Båda metoderna returnerar en :class:`Gtk.TreeIter`-instans, vilken pekar på platsen för den nyligen infogade raden. Du kan erhålla en :class:`Gtk.TreeIter` genom att anropa :meth:`Gtk.TreeModel.get_iter`.

source: Once data has been inserted, you can retrieve or modify data using the tree iter and column index.
pt_br: Depois que os dados foram inseridos, você pode recuperar ou modificar dados usando o iterador de árvore e o índice de coluna.
sv: När data har infogats kan du erhålla eller ändra data med träditeratorn och kolumnindexet.

source: As with Python's built-in :class:`list` object you can use :func:`len` to get the number of rows and use slices to retrieve or set values.
pt_br: Assim como no objeto built-in :class:`list` do Python, você pode usar :func:`len` para obter o número de linhas e usar fatias para recuperar ou definir valores.
sv: Som med Pythons inbyggda :class:`list`-objekt kan du använda :func:`len` för att få antalet rader och använda slicing för att få eller ställa in värden.

source: Iterating over all rows of a tree model is very simple as well.
pt_br: Iterar sobre todas as linhas de um modelo de árvore é muito simples também.
sv: Att iterera över alla rader i en trädmodell är också väldigt enkelt.

source: Keep in mind, that if you use :class:`Gtk.TreeStore`, the above code will only iterate over the rows of the top level, but not the children of the nodes. To iterate over all rows, use :meth:`Gtk.TreeModel.foreach`.
sv: Tänk på att om du använder :class:`Gtk.TreeStore` kommer koden ovan endast iterera över raderna på toppnivån, inte nodernas barn. För att iterera över alla rader, använd :meth:`Gtk.TreeModel.foreach`.

source: Apart from accessing values stored in a :class:`Gtk.TreeModel` with the list-like method mentioned above, it is also possible to either use :class:`Gtk.TreeIter` or :class:`Gtk.TreePath` instances. Both reference a particular row in a tree model. One can convert a path to an iterator by calling :meth:`Gtk.TreeModel.get_iter`. As :class:`Gtk.ListStore` contains only one level, i.e. nodes do not have any child nodes, a path is essentially the index of the row you want to access.
pt_br: Além de acessar valores armazenados em um :class:`Gtk.TreeModel` com o método list-like mencionado acima, também é possível usar as instâncias :class:`Gtk.TreeIter` ou :class:`Gtk.TreePath`. Ambos fazem referência a uma linha específica em um modelo de árvore. Pode-se converter um caminho para um iterador chamando :meth:`Gtk.TreeModel.get_iter`. Como :class:`Gtk.ListStore` contém apenas um nível, ou seja, nós não têm nenhum nó filho, um caminho é essencialmente o índice da linha que você deseja acessar.
sv: Förutom att komma åt värden lagrade i en :class:`Gtk.TreeModel` med den listliknande metoden nämnd ovan, så är det också möjligt att använda instanser av antingen :class:`Gtk.TreeIter` eller :class:`Gtk.TreePath`. Båda hänvisar till en specifik rad i en trädmodell. Man kan konvertera en stig till en iterator genom att anropa :meth:`Gtk.TreeModel.get_iter`. Då :class:`Gtk.ListStore` innehåller endast en nivå, d.v.s. att noder inte har några barnnoder, så är en stig helt enkelt indexet för raden som du vill komma åt.

source: In the case of :class:`Gtk.TreeStore`, a path is a list of indexes or a string. The string form is a list of numbers separated by a colon. Each number refers to the offset at that level. Thus, the path "0" refers to the root node and the path "2:4" refers to the fifth child of the third node.
pt_br: No caso de :class:`Gtk.TreeStore`, um caminho é uma lista de índices ou uma string. O formulário de string é uma lista de números separados por dois pontos. Cada número refere-se ao deslocamento nesse nível. Assim, o caminho "0" refere-se ao nó raiz e o caminho "2: 4" refere-se ao quinto filho do terceiro nó.
sv: I fallet för :class:`Gtk.TreeStore` är en stig en lista över index eller en sträng. Strängformen är en lista över tal som skiljs åt av ett kolon. Varje tal hänvisar till positionen på den nivån. Därmed hänvisar stigen ”0” till rotnoden och stigen ”2:4” till det femte barnet till den tredje noden.

source: Instances of :class:`Gtk.TreePath` can be accessed like lists, i.e. ``len(treepath)`` returns the depth of the item ``treepath`` is pointing to, and ``treepath[i]`` returns the child's index on the *i*-th level.
pt_br: Instâncias de :class:`Gtk.TreePath` podem ser acessadas como listas, ``len(treepath)`` retorna a profundidade do item ``treepath`` está apontando para, e ``treepath[i]`` retorna o índice do filho no nível *i*.
sv: Instanser av :class:`Gtk.TreePath` kan kommas åt som listor, d.v.s. ``len(treepath)`` returnerar djupet på objektet som ``treepath`` pekar på, och ``treepath[i]`` returnerar barnets index på nivå *i*.

source: While there are several different models to choose from, there is only one view widget to deal with. It works with either the list or the tree store. Setting up a :class:`Gtk.TreeView` is not a difficult matter. It needs a :class:`Gtk.TreeModel` to know where to retrieve its data from, either by passing it to the :class:`Gtk.TreeView` constructor, or by calling :meth:`Gtk.TreeView.set_model`.
pt_br: Embora existam vários modelos diferentes para escolher, há apenas um widget de visualização para lidar. Funciona com a lista ou com o armazenamento em árvore. Configurar um :class:`Gtk.TreeView` não é uma tarefa difícil. Ele precisa de um :class:`Gtk.TreeModel` para saber de onde recuperar seus dados, seja passando-o para o construtor :class:`Gtk.TreeView`, ou chamando :meth:`Gtk.TreeView.set_model`.
sv: Medan det finns flera olika modeller att välja på, så finns det endast en vykomponent att hantera, Den fungerar med antingen listan eller trädlagringen. Att konfigurera en :class:`Gtk.TreeView` är inte svårt. Den behöver en :class:`Gtk.TreeModel` för att veta var den ska erhålla sina data från, antingen genom att skicka det till :class:`Gtk.TreeView`-konstruktorn, eller genom att anropa :meth:`Gtk.TreeView.set_model`.

source: Once the :class:`Gtk.TreeView` widget has a model, it will need to know how to display the model. It does this with columns and cell renderers.
pt_br: Uma vez que o widget :class:`Gtk.TreeView` possua um modelo, ele precisará saber como exibir o modelo. Ele faz isso com colunas e renderizadores de célula.
sv: Då komponenten :class:`Gtk.TreeView` har en modell kommer den behöva veta hur den ska visa modellen. Den gör detta med kolumner och cellrenderare.

source: Cell renderers are used to draw the data in the tree model in a way. There are a number of cell renderers that come with GTK+, for instance :class:`Gtk.CellRendererText`, :class:`Gtk.CellRendererPixbuf` and :class:`Gtk.CellRendererToggle`. In addition, it is relatively easy to write a custom renderer yourself.
pt_br: Os renderizadores de célula são usados para desenhar os dados no modelo de árvore de uma maneira. Existem vários renderizadores de célula que vêm com o GTK+, por exemplo :class:`Gtk.CellRendererText`, :class:`Gtk.CellRendererPixbuf` e :class:`Gtk.CellRendererToggle`. Além disso, é relativamente fácil escrever um renderizador personalizado por conta própria.
sv: Cellrenderare används för att rita data i trädmodellen på ett sätt. Det finns ett antal cellrenderare som kommer med GTK+, exempelvis :class:`Gtk.CellRendererText`, :class:`Gtk.CellRendererPixbuf` och :class:`Gtk.CellRendererToggle`. Vidare är det relativt enkelt att själv skriva en anpassad renderare.

source: A :class:`Gtk.TreeViewColumn` is the object that :class:`Gtk.TreeView` uses to organize the vertical columns in the tree view. It needs to know the name of the column to label for the user, what type of cell renderer to use, and which piece of data to retrieve from the model for a given row.
pt_br: A :class:`Gtk.TreeViewColumn` é o objeto que :class:`Gtk.TreeView` usa para organizar as colunas verticais na visualização em árvore. Ele precisa saber o nome da coluna para rotular o usuário, que tipo de renderizador de célula deve ser usado e qual parte dos dados deve ser recuperada do modelo para uma determinada linha.
sv: En :class:`Gtk.TreeViewColumn` är objektet som :class:`Gtk.TreeView` använder för att organisera de vertikala kolumnerna i trädvyn. Det behöver veta namnet på kolumnen att etikettera för användaren, vilken typ av cellrenderare som ska användas, och vilken bit data som ska erhållas från modellen för en given rad.

source: To render more than one model column in a view column, you need to create a :class:`Gtk.TreeViewColumn` instance and use :meth:`Gtk.TreeViewColumn.pack_start` to add the model columns to it.
pt_br: Para renderizar mais de uma coluna de modelo em uma coluna de visão, você precisa criar uma instância :class:`Gtk.TreeViewColumn` e usar :meth:`Gtk.TreeViewColumn.pack_start` para adicionar as colunas de modelo a ela.
sv: För att rendera mer än en modellkolumn i en vykolumn behöver du skapa en :class:`Gtk.TreeViewColumn`-instans och använda :meth:`Gtk.TreeViewColumn.pack_start` för att lägga till modellkolumnerna till den.

source: The Selection
pt_br: A Seleção
sv: Valet

source: Most applications will need to not only deal with displaying data, but also receiving input events from users. To do this, simply get a reference to a selection object and connect to the "changed" signal.
pt_br: A maioria dos aplicativos precisará não apenas lidar com a exibição de dados, mas também receber eventos de entrada dos usuários. Para fazer isso, basta obter uma referência a um objeto de seleção e conectar-se ao sinal "changed".
sv: De flesta program kommer behöva inte bara arbeta med att visa data, utan också ta emot inmatningshändelser från användare. För att göra detta, ta helt enkelt en referens till ett valobjekt och anslut till ”changed”-signalen.

source: Then to retrieve data for the row selected:
pt_br: Em seguida, para recuperar dados para a linha selecionada:
sv: För att sedan erhålla data för den valda raden:

source: You can control what selections are allowed by calling :meth:`Gtk.TreeSelection.set_mode`. :meth:`Gtk.TreeSelection.get_selected` does not work if the selection mode is set to :attr:`Gtk.SelectionMode.MULTIPLE`, use :meth:`Gtk.TreeSelection.get_selected_rows` instead.
pt_br: Você pode controlar quais seleções são permitidas chamando :meth:`Gtk.TreeSelection.set_mode`. :meth:`Gtk.TreeSelection.get_selected` não funciona se o modo de seleção estiver definido como :attr:`Gtk.SelectionMode.MULTIPLE`, use :meth:`Gtk.TreeSelection.get_selected_rows`.
sv: Du kan styra vilka val som tillåts genom att anropa :meth:`Gtk.TreeSelection.set_mode`. :meth:`Gtk.TreeSelection.get_selected` fungerar inte om valläget är inställt till :attr:`Gtk.SelectionMode.MULTIPLE`, använd :meth:`Gtk.TreeSelection.get_selected_rows` istället.

source: Sorting
pt_br: Classificação
sv: Sortering

source: Sorting is an important feature for tree views and is supported by the standard tree models (:class:`Gtk.TreeStore` and :class:`Gtk.ListStore`), which implement the :class:`Gtk.TreeSortable` interface.
pt_br: A classificação é um recurso importante para as visualizações em árvore e é suportada pelos modelos de árvore padrão (:class:`Gtk.TreeStore` e :class:`Gtk.ListStore`), que implementam a interface :class:`Gtk.TreeSortable`.
sv: Sortering är en viktig funktion för trädvyer och stöds av standardträdmodellerna (:class:`Gtk.TreeStore` och :class:`Gtk.ListStore`), vilka implementerar gränssnittet :class:`Gtk.TreeSortable`.

source: Sorting by clicking on columns
pt_br: Classificando clicando em colunas
sv: Sortering genom att klicka på kolumner

source: A column of a :class:`Gtk.TreeView` can easily made sortable with a call to :meth:`Gtk.TreeViewColumn.set_sort_column_id`. Afterwards the column can be sorted by clicking on its header.
pt_br: Uma coluna de um :class:`Gtk.TreeView` pode ser facilmente ordenada com uma chamada para :meth:`Gtk.TreeViewColumn.set_sort_column_id`. Depois, a coluna pode ser ordenada clicando no cabeçalho.
sv: En kolumn för en :class:`Gtk.TreeView` kan lätt göras sorterbar med ett anrop till :meth:`Gtk.TreeViewColumn.set_sort_column_id`. Efter det kan kolumnen sorteras genom att klicka på dess rubrik.

source: First we need a simple :class:`Gtk.TreeView` and a :class:`Gtk.ListStore` as a model.
pt_br: Primeiro precisamos de um simples :class:`Gtk.TreeView` e um :class:`Gtk.ListStore` como modelo.
sv: Först behöver vi en enkel :class:`Gtk.TreeView` och en :class:`Gtk.ListStore` som en modell.

source: The next step is to enable sorting. Note that the *column_id* (``0`` in the example) refers to the column of the model and **not** to the TreeView's column.
pt_br: O próximo passo é ativar a classificação. Note que o *column_id* (``0`` no exemplo) refere-se à coluna do modelo e **não** à coluna do TreeView.
sv: Nästa steg är att aktivera sortering. Observera att *column_id* (``0`` i exemplet) hänvisar till modellens kolumn och **inte** till kolumnen för vår TreeView.

source: Setting a custom sort function
pt_br: Definindo uma função de classificação personalizada
sv: Ställa in en anpassad sorteringsfunktion

source: It is also possible to set a custom comparison function in order to change the sorting behaviour. As an example we will create a comparison function that sorts case-sensitive. In the example above the sorted list looked like::
pt_br: Também é possível definir uma função de comparação personalizada para alterar o comportamento de classificação. Como exemplo, criaremos uma função de comparação que classifica maiúsculas e minúsculas. No exemplo acima, a lista classificada parecia com::
sv: Det är också möjligt att ställa in en anpassad jämförelsefunktion för att ändra sorteringsbeteendet. Som ett exempel kommer vi skapa en jämförelsefunktion som sorterar skiftlägeskänsligt. I exemplet ovan såg listan ut som::

source: The case-sensitive sorted list will look like::
pt_br: A lista classificada com distinção entre maiúsculas e minúsculas será semelhante a::
sv: Den skiftlägeskänsliga sorterade listan kommer se ut som::

source: First of all a comparison function is needed. This function gets two rows and has to return a negative integer if the first one should come before the second one, zero if they are equal and a positive integer if the second one should come before the second one.
pt_br: Em primeiro lugar, é necessária uma função de comparação. Esta função obtém duas linhas e tem que retornar um inteiro negativo se o primeiro deve vir antes do segundo, zero se eles forem iguais e um inteiro positivo se o segundo vier antes do primeiro.
sv: Först av allt behövs en jämförelsefunktion. Denna funktion får två rader och ska returnera ett negativt heltal om den första ska komma före den andra, noll om de är lika, och ett positivt heltal om den andra ska komma före den första.

source: Then the sort function has to be set by :meth:`Gtk.TreeSortable.set_sort_func`.
pt_br: Então a função sort deve ser definida por :meth:`Gtk.TreeSortable.set_sort_func`.
sv: Sedan måste sorteringsfunktionen ställas in med :meth:`Gtk.TreeSortable.set_sort_func`.

source: Filtering
pt_br: Filtrando
sv: Filtrering

source: Unlike sorting, filtering is not handled by the two models we previously saw, but by the :class:`Gtk.TreeModelFilter` class. This class, like :class:`Gtk.TreeStore` and :class:`Gtk.ListStore`, is a :class:`Gtk.TreeModel`. It acts as a layer between the "real" model (a :class:`Gtk.TreeStore` or a :class:`Gtk.ListStore`), hiding some elements to the view. In practice, it supplies the :class:`Gtk.TreeView` with a subset of the underlying model. Instances of :class:`Gtk.TreeModelFilter` can be stacked one onto another, to use multiple filters on the same model (in the same way you'd use "AND" clauses in a SQL request). They can also be chained with :class:`Gtk.TreeModelSort` instances.
pt_br: Ao contrário da classificação, a filtragem não é tratada pelos dois modelos que vimos anteriormente, mas pela classe :class:`Gtk.TreeModelFilter`. Esta classe, como :class:`Gtk.TreeStore` e :class:`Gtk.ListStore`, é uma :class:`Gtk.TreeModel`. Ele age como uma camada entre o modelo "real" (a :class:`Gtk.TreeStore` ou a :class:`Gtk.ListStore`), ocultando alguns elementos para a view. Na prática, ele fornece o :class:`Gtk.TreeView` com um subconjunto do modelo subjacente. Instâncias de :class:`Gtk.TreeModelFilter` podem ser empilhadas umas sobre as outras, para usar múltiplos filtros no mesmo modelo (da mesma forma que você usaria cláusulas "AND" em uma requisição SQL). Eles também podem ser encadeados com instâncias :class:`Gtk.TreeModelSort`.
sv: Till skillnad från sortering hanteras filtrering inte av de två modeller vi tidigare såg, utan av klassen :class:`Gtk.TreeModelFilter`. Denna klass är liksom :class:`Gtk.TreeStore` och :class:`Gtk.ListStore` en :class:`Gtk.TreeModel`. Den agerar som ett lager mellan den ”riktiga” modellen (en :class:`Gtk.TreeStore` eller en :class:`Gtk.ListStore`) och döljer några element för vyn. I praktiken tillhandahåller den en delmängd av den underliggande modellen åt :class:`Gtk.TreeView`. Instanser av :class:`Gtk.TreeModelFilter` kan staplas på varandra, för att använda flera filter på samma modell (på samma sätt som du skulle använda ”AND”-klausuler i en SQL-förfrågan). De kan också sättas i en kedja med instanser av :class:`Gtk.TreeModelSort`.
