Repository: sebp/PyGObject-Tutorial
Catalog: translations/po/*.po
Languages: pt_br, sv

source: While many GUI toolkits require you to precisely place widgets in a window, using absolute positioning, GTK+ uses a different approach. Rather than specifying the position and size of each widget in the window, you can arrange your widgets in rows, columns, and/or tables. The size of your window can be determined automatically, based on the sizes of the widgets it contains. And the sizes of the widgets are, in turn, determined by the amount of text they contain, or the minimum and maximum sizes that you specify, and/or how you have requested that the available space should be shared between sets of widgets. You can perfect your layout by specifying padding distance and centering values for each of your widgets. GTK+ then uses all this information to resize and reposition everything sensibly and smoothly when the user manipulates the window.
pt_br: Enquanto muitos toolkits GUI exigem que você coloque precisamente widgets em uma janela, usando posicionamento absoluto, o GTK+ usa uma abordagem diferente. Em vez de especificar a posição e o tamanho de cada widget na janela, você pode organizar seus widgets em linhas, colunas e/ou tabelas. O tamanho da sua janela pode ser determinado automaticamente, com base nos tamanhos dos widgets que ela contém. E os tamanhos dos widgets, por sua vez, são determinados pela quantidade de texto que eles contêm, ou os tamanhos mínimo e máximo que você especifica, e/ou como você solicitou que o espaço disponível seja compartilhado entre conjuntos de widgets. Você pode aperfeiçoar seu layout especificando a distância de preenchimento e os valores de centralização para cada um de seus widgets. O GTK+ usa todas essas informações para redimensionar e reposicionar tudo de maneira sensata e suave quando o usuário manipula a janela.
sv: Medan många verktygslådor för grafiska användargränssnitt tvingar dig att precist placera komponenter i ett fönster med absolut positionering, så använder GTK+ ett annat tillvägagångssätt. Snarare än att ange positionen och storleken för varje komponent i fönstret så kan du arrangera dina komponenter i rader, kolumner och/eller tabeller. Storleken på ditt fönster kan avgöras automatiskt, baserat på storleken för de komponenter som det innehåller. Storlekarna för komponenterna avgörs i sin tur av mängden text som de innehåller, eller minimi- och maximistorlekarna som du anger, och/eller hur du har begärt att det tillgängliga utrymmet ska delas mellan uppsättningar av komponenter. Du kan göra din layout bättre genom att ange utfyllnadsavstånd och centreringsvärden för var och en av dina komponenter. GTK+ använder sedan all denna information för att ändra storlek och position för allt på ett förnuftigt och smidigt sätt när användaren manipulerar fönstret.

source: GTK+ arranges widgets hierarchically, using *containers*. They are invisible to the end user and are inserted into a window, or placed within each other to layout components. There are two flavours of containers: single-child containers, which are all descendants of :class:`Gtk.Bin`, and multiple-child containers, which are descendants of :class:`Gtk.Container`. The most commonly used are vertical or horizontal boxes (:class:`Gtk.Box`) and grids (:class:`Gtk.Grid`).
pt_br: O GTK+ organiza widgets hierarquicamente, usando *containers*. Eles são invisíveis para o usuário final e são inseridos em uma janela ou colocados entre si para os componentes do layout. Existem dois tipos de contêineres: contêineres filho único, todos descendentes de :class:`Gtk.Bin` e contêineres com vários filhos, que são descendentes de :class:`Gtk.Container`. Os mais usados são caixas verticais ou horizontais (:class:`Gtk.Box`) e grades (:class:`Gtk.Grid`).
sv: GTK+ arrangerar komponenter hierarkiskt, med *behållare*. De är osynliga för slutanvändaren och infogas i ett fönster, eller placeras i varandra för att skapa en layout för komponenter. Det finns två sorters behållare: behållare med ett barn, vilka alla är ättlingar till :class:`Gtk.Bin`, och behållare med flera barn, vilka är ättlingar till :class:`Gtk.Container`. De mest använda är vertikala eller horisontella rutor (:class:`Gtk.Box`) och rutnät (:class:`Gtk.Grid`).

source: Boxes
sv: Rutor

source: Boxes are invisible containers into which we can pack our widgets. When packing widgets into a horizontal box, the objects are inserted horizontally from left to right or right to left depending on whether :meth:`Gtk.Box.pack_start` or :meth:`Gtk.Box.pack_end` is used. In a vertical box, widgets are packed from top to bottom or vice versa. You may use any combination of boxes inside or beside other boxes to create the desired effect.
pt_br: Caixas são contêineres invisíveis nos quais podemos empacotar nossos widgets. Ao agrupar widgets em uma caixa horizontal, os objetos são inseridos horizontalmente da esquerda para a direita ou da direita para a esquerda, dependendo se :meth:`Gtk.Box.pack_start` ou :meth:`Gtk.Box.pack_end` for usado. Em uma caixa vertical, os widgets são empacotados de cima para baixo ou vice-versa. Você pode usar qualquer combinação de caixas dentro ou ao lado de outras caixas para criar o efeito desejado.
sv: Rutor är osynliga behållare som vi kan packa våra komponenter i. Då komponenter packas i en horisontell ruta infogas objekten horisontellt från vänster till höger eller höger till vänster beroende på huruvida :meth:`Gtk.Box.pack_start` eller :meth:`Gtk.Box.pack_end` används. I en vertikal ruta packas komponenter uppifrån och ner eller omvänt. Du kan använda alla tänkbara kombinationer av rutor i eller bredvid andra rutor för att skapa önskad effekt.

source: Let's take a look at a slightly modified version of the extended example with two buttons.
pt_br: Vamos dar uma olhada em uma versão ligeiramente modificada do exemplo estendido com dois botões.
sv: Låt oss ta en titt på en något ändrad version av det utökade exemplet med två knappar.

source: First, we create a horizontally orientated box container where 6 pixels are placed between children. This box becomes the child of the top-level window.
pt_br: Primeiro, criamos um contêiner de caixa orientado horizontalmente, onde 6 pixels são colocados entre os filhos. Esta caixa se torna o filho da janela de nível superior.
sv: Vi skapar först en horisontellt orienterad rutbehållare där 6 bildpunkter placeras mellan barn. Denna ruta blir barnet till toppnivåfönstret.

source: Subsequently, we add two different buttons to the box container.
pt_br: Posteriormente, adicionamos dois botões diferentes ao contêiner da caixa.
sv: Därefter lägger vi till två olika knappar till rutbehållaren.

source: While with :meth:`Gtk.Box.pack_start` widgets are positioned from left to right, :meth:`Gtk.Box.pack_end` positions them from right to left.
pt_br: Enquanto com os widgets :meth:`Gtk.Box.pack_start` estão posicionados da esquerda para a direita, :meth:`Gtk.Box.pack_end` os posiciona da direita para a esquerda.
sv: Medan komponenter positioneras från vänster till höger med :meth:`Gtk.Box.pack_start`, så positioneras de från höger till vänster med :meth:`Gtk.Box.pack_end`.

source: :class:`Gtk.Grid` is a container which arranges its child widgets in rows and columns, but you do not need to specify the dimensions in the constructor. Children are added using :meth:`Gtk.Grid.attach`. They can span multiple rows or columns. The :meth:`Gtk.Grid.attach` method takes five parameters:
pt_br: :class:`Gtk.Grid` é um contêiner que organiza seus widgets filhos em linhas e colunas, mas você não precisa especificar as dimensões no construtor. As crianças são adicionadas usando :meth:`Gtk.Grid.attach`. Eles podem abranger várias linhas ou colunas. O método :meth:`Gtk.Grid.attach` usa cinco parâmetros:
sv: :class:`Gtk.Grid` är en behållare som arrangerar sina barnkomponenter i rader och kolumner, men du behöver inte ange dimensionerna i konstruktorn. Barn läggs till med :meth:`Gtk.Grid.attach`. De kan spänna över flera rader eller kolumner. Metoden :meth:`Gtk.Grid.attach` tar fem parametrar:

source: The ``child`` parameter is the :class:`Gtk.Widget` to add.
pt_br: O parâmetro ``child`` é o :class:`Gtk.Widget` para adicionar.
sv: Parametern ``child`` är den :class:`Gtk.Widget` som ska läggas till.

source: ``left`` is the column number to attach the left side of ``child`` to.
pt_br: `` left`` é o número da coluna para anexar o lado esquerdo de ``child`` em.
sv: ``left`` är kolumnnumret att fästa vänster sida av ``child`` till.

source: ``top`` indicates the row number to attach the top side of ``child`` to.
pt_br: `` top`` indica o número da linha para anexar o lado superior do ``child``.
sv: ``top`` indikerar radnumret att fästa översidan av ``child`` till.

source: ``width`` and ``height`` indicate the number of columns that the ``child`` will span, and the number of rows that the ``child`` will span, respectively.
pt_br: `` width`` e ``height`` indicam o número de colunas que o ``child`` irá abranger, e o número de linhas que o ``child`` irá abranger, respectivamente.
sv: ``width`` och ``height`` indikerar antalet kolumner respektive rader som ``child`` kommer spänna över.

source: It is also possible to add a child next to an existing child, using :meth:`Gtk.Grid.attach_next_to`, which also takes five parameters:
pt_br: Também é possível adicionar um child ao lado de um child existente, usando :meth:`Gtk.Grid.attach_next_to`, que também usa cinco parâmetros:
sv: Det är också möjligt att lägga till ett barn intill ett befintligt barn, med :meth:`Gtk.Grid.attach_next_to`, vilket också tar fem parametrar:

source: ``child`` is the :class:`Gtk.Widget` to add, as above.
pt_br: ``child`` é o :class:`Gtk.Widget` para adicionar, como acima.
sv: ``child`` är den :class:`Gtk.Widget` som ska läggas till, som ovan.

source: ``sibling`` is an existing child widget of ``self`` (a :class:`Gtk.Grid` instance) or ``None``. The ``child`` widget will be placed next to ``sibling``, or if ``sibling`` is ``None``, at the beginning or end of the grid.
pt_br: ``sibling`` é um widget filho existente de ``self`` (uma instância :class:`Gtk.Grid`) ou ``None``. O widget ``child`` será colocado próximo ao ``sibling``, ou se ``sibling`` for ``None``, no início ou no final da grade.
sv: ``sibling`` är en befintlig barnkomponent till ``self`` (en :class:`Gtk.Grid`-instans) eller ``None``. ``child``-komponenten kommer placeras intill ``sibling``, eller om ``sibling`` är ``None``, i början eller slutet av rutnätet.

source: ``side`` is a :class:`Gtk.PositionType` indicating the side of ``sibling`` that ``child`` is positioned next to.
pt_br: ``side`` é um :class:`Gtk.PositionType` indicando o lado do ``sibling`` que ``child`` é posicionado ao lado de.
sv: ``side`` är en :class:`Gtk.PositionType` som indikerar vilken sida av ``sibling`` som ``child`` positioneras intill.

source: ``width`` and ``height`` indicate the number of columns and rows the ``child`` widget will span, respectively.
pt_br: ``width`` e ``height`` indicam o número de colunas e linhas que o widget ``child`` abrangerá, respectivamente.
sv: ``width`` och ``height`` indikerar antalet kolumner respektive rader som komponenten ``child`` kommer spänna över.

source: Finally, :class:`Gtk.Grid` can be used like a :class:`Gtk.Box` by just using :meth:`Gtk.Grid.add`, which will place children next to each other in the direction determined by the "orientation" property (defaults to :attr:`Gtk.Orientation.HORIZONTAL`).
pt_br: Finalmente, :class:`Gtk.Grid` pode ser usado como :class:`Gtk.Box` usando apenas :meth:`Gtk.Grid.add`, que colocará as crianças uma ao lado da outra na direção determinada por a propriedade "orientação" (o padrão é :attr:`Gtk.Orientation.HORIZONTAL`).
sv: Slutligen kan :class:`Gtk.Grid` användas som en :class:`Gtk.Box` genom att helt enkelt använda :meth:`Gtk.Grid.add`, vilken kommer placera barn intill varandra i den riktning som avgörs av egenskapen ”orientation” (har standardvärdet :attr:`Gtk.Orientation.HORIZONTAL`).

source: A :class:`Gtk.ListBox` is a vertical container that contains :class:`Gtk.ListBoxRow` children. These rows can be dynamically sorted and filtered, and headers can be added dynamically depending on the row content. It also allows keyboard and mouse navigation and selection like a typical list.
pt_br: A :class:`Gtk.ListBox` é um contêiner vertical que contém :class:`Gtk.ListBoxRow` filhos. Essas linhas podem ser classificadas e filtradas dinamicamente e os cabeçalhos podem ser adicionados dinamicamente, dependendo do conteúdo da linha. Também permite navegação e seleção de teclado e mouse como uma lista típica.
sv: En :class:`Gtk.ListBox` är en vertikal behållare som innehåller :class:`Gtk.ListBoxRow`-barn. Dessa rader kan sorteras och filtreras dynamiskt, och rubriker kan läggas till dynamiskt beroende på radinnehållet. Den tillåter också tangentbords- och musnavigering samt markering som en typisk lista.

source: Using :class:`Gtk.ListBox` is often an alternative to :class:`Gtk.TreeView`, especially when the list content has a more complicated layout than what is allowed by a :class:`Gtk.CellRenderer`, or when the content is interactive (i.e. has a button in it).
pt_br: Usar :class:`Gtk.ListBox` é muitas vezes uma alternativa para :class:`Gtk.TreeView`, especialmente quando o conteúdo da lista tem um layout mais complicado do que o permitido por um :class:`Gtk.CellRenderer`, ou quando o conteúdo é interativo (ou seja, tem um botão).
sv: Att använda :class:`Gtk.ListBox` är ofta ett alternativ till :class:`Gtk.TreeView`, särskilt när listinnehållet har en mer komplicerad layout än vad som tillåts av en :class:`Gtk.CellRenderer`, eller när innehållet är interaktivt (t.ex. har en knapp i sig).

source: Although a :class:`Gtk.ListBox` must have only :class:`Gtk.ListBoxRow` children, you can add any kind of widget to it via :meth:`Gtk.Container.add` and a :class:`Gtk.ListBoxRow` widget will automatically be inserted between the list and the widget.
pt_br: Embora um :class:`Gtk.ListBox` deva ter apenas :class:`Gtk.ListBoxRow` filhos, você pode adicionar qualquer tipo de widget a ele via :meth:`Gtk.Container.add` e um :class:`Gtk.ListBoxRow` widget será automaticamente inserido entre a lista e o widget.
sv: Även om en :class:`Gtk.ListBox` endast får ha barn som är :class:`Gtk.ListBoxRow`, så kan du lägga till valfri komponent till den med :meth:`Gtk.Container.add`, så kommer automatiskt en :class:`Gtk.ListBoxRow`-komponent infogas mellan listan och komponenten.

source: Stack and StackSwitcher
sv: Stack och StackSwitcher

source: A :class:`Gtk.Stack` is a container which only shows one of its children at a time. In contrast to :class:`Gtk.Notebook`, :class:`Gtk.Stack` does not provide a means for users to change the visible child. Instead, the :class:`Gtk.StackSwitcher` widget can be used with :class:`Gtk.Stack` to provide this functionality.
pt_br: A :class:`Gtk.Stack` é um contêiner que mostra apenas um de seus filhos por vez. Em contraste com :class:`Gtk.Notebook`, :class:`Gtk.Stack` não fornece um meio para os usuários alterarem o filho visível. Em vez disso, o widget :class:`Gtk.StackSwitcher` pode ser usado com :class:`Gtk.Stack` para fornecer essa funcionalidade.
sv: En :class:`Gtk.Stack` är en behållare som bara visar ett av sina barn åt gången. Till skillnad från :class:`Gtk.Notebook` så tillhandahåller :class:`Gtk.Stack` inte något sätt för användare att ändra det synliga barnet. Istället kan komponenten :class:`Gtk.StackSwitcher` användas med :class:`Gtk.Stack` för att tillhandahålla denna funktionalitet.

source: Transitions between pages can be animated as slides or fades. This can be controlled with :meth:`Gtk.Stack.set_transition_type`. These animations respect the "gtk-enable-animations" setting.
pt_br: Transições entre páginas podem ser animadas como slides ou fades. Isso pode ser controlado com :meth:`Gtk.Stack.set_transition_type`. Essas animações respeitam a configuração "gtk-enable-animations".
sv: Övergångar mellan sidor kan animeras som bildspel eller toningar. Detta kan styras med :meth:`Gtk.Stack.set_transition_type`. Dessa animeringar följer inställningen ”gtk-enable-animations”.

source: Transition speed can be adjusted with :meth:`Gtk.Stack.set_transition_duration`
pt_br: A velocidade de transição pode ser ajustada com :meth:`Gtk.Stack.set_transition_duration`
sv: Övergångshastighet kan justeras med :meth:`Gtk.Stack.set_transition_duration`

source: The :class:`Gtk.StackSwitcher` widget acts as a controller for a :class:`Gtk.Stack`; it shows a row of buttons to switch between the various pages of the associated stack widget.
pt_br: O widget :class:`Gtk.StackSwitcher` atua como um controlador para um :class:`Gtk.Stack`; Ele mostra uma linha de botões para alternar entre as várias páginas do widget de pilha associado.
sv: Komponenten :class:`Gtk.StackSwitcher` agerar som en styrenhet för en :class:`Gtk.Stack`; den visar en knapprad för att växla mellan de olika sidorna för den associerade stackkomponenten.

source: All the content for the buttons comes from the child properties of the :class:`Gtk.Stack`.
pt_br: Todo o conteúdo para os botões vem das propriedades filho do :class:`Gtk.Stack`.
sv: Allt innehåll för knapparna kommer från barnegenskaperna för :class:`Gtk.Stack`.

source: It is possible to associate multiple :class:`Gtk.StackSwitcher` widgets with the same :class:`Gtk.Stack` widget.
pt_br: É possível associar múltiplos widgets :class:`Gtk.StackSwitcher` com o mesmo widget :class:`Gtk.Stack`.
sv: Det är möjligt att associera flera :class:`Gtk.StackSwitcher`-komponenter med samma :class:`Gtk.Stack`-komponent.

source: A :class:`Gtk.HeaderBar` is similar to a horizontal :class:`Gtk.Box`, it allows to place children at the start or the end. In addition, it allows a title to be displayed. The title will be centered with respect to the width of the box, even if the children at either side take up different amounts of space.
pt_br: A :class:`Gtk.HeaderBar` é semelhante a uma horizontal :class:`Gtk.Box`, permite colocar filhos no início ou no final. Além disso, permite que um título seja exibido. O título será centrado em relação à largura da caixa, mesmo que os filhos de ambos os lados ocupem diferentes quantidades de espaço.
sv: En :class:`Gtk.HeaderBar` liknar en horisontell :class:`Gtk.Box`, den tillåter att barn placeras i början eller slutet. Dessutom tillåter den att en titel visas. Titeln kommer centreras med avseende på rutans bredd, även om barnen på endera sida tar upp olika mycket utrymme.

source: Since GTK+ now supports Client Side Decoration, a :class:`Gtk.HeaderBar` can be used in place of the title bar (which is rendered by the Window Manager).
pt_br: Como o GTK+ agora suporta o Client Side Decoration, um :class:`Gtk.HeaderBar` pode ser usado no lugar da barra de título (que é renderizada pelo Gerenciador de Janelas).
sv: Eftersom GTK+ nu stöder dekoration på klientsidan (CSD) så kan en :class:`Gtk.HeaderBar` användas istället för namnlisten (vilken renderas av fönsterhanteraren).

source: A :class:`Gtk.HeaderBar` is usually located across the top of a window and should contain commonly used controls which affect the content below. They also provide access to window controls, including the close window button and window menu.
pt_br: A :class:`Gtk.HeaderBar` geralmente está localizado na parte superior de uma janela e deve conter controles comumente usados que afetam o conteúdo abaixo. Eles também fornecem acesso a controles de janela, incluindo o botão de fechar janela e o menu de janela.
sv: En :class:`Gtk.HeaderBar` placeras vanligen högst upp i ett fönster och bör innehålla vanligen använda kontroller som påverkar innehållet nedan. De tillhandahåller också åtkomst till fönsterstyrkomponenter, vilket inkluderar knappen för att stänga fönstret och fönstermenyn.

source: This example requires at least GTK+ 3.12.
sv: Detta exempel kräver åtminstone GTK+ 3.12.

source: A :class:`Gtk.FlowBox` is a container that positions child widgets in sequence according to its orientation.
pt_br: A :class:`Gtk.FlowBox` é um contêiner que posiciona widgets filhos em sequência de acordo com sua orientação.
sv: En :class:`Gtk.FlowBox` är en behållare som positionerar barnkomponenter i ordning enligt sin orientering.

source: For instance, with the horizontal orientation, the widgets will be arranged from left to right, starting a new row under the previous row when necessary. Reducing the width in this case will require more rows, so a larger height will be requested.
pt_br: Por exemplo, com a orientação horizontal, os widgets serão organizados da esquerda para a direita, iniciando uma nova linha na linha anterior, quando necessário. Reduzir a largura neste caso exigirá mais linhas, portanto, uma altura maior será solicitada.
sv: Exempelvis kommer komponenterna vid horisontell orientering att arrangeras från vänster till höger, och starta en ny rad under föregående rad då detta är nödvändigt. Att minska bredden kommer i detta fall kräva fler rader, så en större höjd kommer begäras.

source: Likewise, with the vertical orientation, the widgets will be arranged from top to bottom, starting a new column to the right when necessary. Reducing the height will require more columns, so a larger width will be requested.
pt_br: Da mesma forma, com a orientação vertical, os widgets serão organizados de cima para baixo, iniciando uma nova coluna à direita quando necessário. Reduzir a altura exigirá mais colunas, portanto será solicitada uma largura maior.
sv: På samma sätt kommer komponenterna vid vertikal orientering att arrangeras uppifrån och ner, och starta en ny kolumn till höger då detta är nödvändigt. Att minska höjden kommer kräva fler kolumner, så en större bredd kommer begäras.

source: The children of a :class:`Gtk.FlowBox` can be dynamically sorted and filtered.
pt_br: Os filhos de uma :class:`Gtk.FlowBox` podem ser classificados e filtrados dinamicamente.
sv: Barnen till en :class:`Gtk.FlowBox` kan sorteras och filtreras dynamiskt.

source: Although a :class:`Gtk.FlowBox` must have only :class:`Gtk.FlowBoxChild` children, you can add any kind of widget to it via :meth:`Gtk.Container.add`, and a :class:`Gtk.FlowBoxChild` widget will automatically be inserted between the box and the widget.
pt_br: Embora um :class:`Gtk.FlowBox` deva ter apenas :class:`Gtk.FlowBoxChild` filhos, você pode adicionar qualquer tipo de widget a ele via :meth:`Gtk.Container.add`, e a :class:`Gtk.FlowBoxChild`, o widget será automaticamente inserido entre a caixa e o widget.
sv: Även om en :class:`Gtk.FlowBox` endast får ha barn som är :class:`Gtk.FlowBoxChild`, så kan du lägga till valfri komponent till den med :meth:`Gtk.Container.add`, så kommer automatiskt en :class:`Gtk.FlowBoxChild`-komponent infogas mellan rutan och komponenten.

source: The :class:`Gtk.Notebook` widget is a :class:`Gtk.Container` whose children are pages that can be switched between using tab labels along one edge.
pt_br: O widget :class:`Gtk.Notebook` é um :class:`Gtk.Container` cujos filhos são páginas que podem ser alternadas usando rótulos de guias ao longo de uma borda.
sv: Komponenten :class:`Gtk.Notebook` är en :class:`Gtk.Container` vars barn är sidor som kan växlas mellan med fliketiketter längs en kant.
