Repository: sebp/PyGObject-Tutorial
Catalog: translations/po/*.po
Languages: pt_br, sv

source: You can create a new instance of a :class:`Gtk.TreeModelFilter` and give it a model to filter, but the easiest way is to spawn it directly from the filtered model, using the :meth:`Gtk.TreeModel.filter_new` method.
pt_br: Você pode criar uma nova instância de :class:`Gtk.TreeModelFilter` e dar a ela um modelo para filtrar, mas a maneira mais fácil é gerá-lo diretamente do modelo filtrado, usando o método :meth:`Gtk.TreeModel.filter_new` método.
sv: Du kan skapa en ny instans av ett :class:`Gtk.TreeModelFilter` och ge det en modell att filtrera, men det lättaste sättet är att starta det direkt från den filtrerade modellen, med metoden :meth:`Gtk.TreeModel.filter_new`.

source: In the same way the sorting function works, the :class:`Gtk.TreeModelFilter` uses a "visibility" function, which, given a row from the underlying model, will return a boolean indicating if this row should be filtered out or not. It's set by :meth:`Gtk.TreeModelFilter.set_visible_func`:
sv: På samma sätt som sorteringsfunktionen fungerar, så använder :class:`Gtk.TreeModelFilter` en ”synlighets”-funktion, som givet en rad från den underliggande modellen, kommer returnera ett booleskt värde som indikerar om denna rad ska filtreras ut eller inte. Den ställs in av :meth:`Gtk.TreeModelFilter.set_visible_func`:

source: The alternative to a "visibility" function is to use a boolean column in the model to specify which rows to filter. Choose which column with :meth:`Gtk.TreeModelFilter.set_visible_column`.
sv: Alternativet till en ”synlighets”-funktion är att använda en boolesk kolumn i modellen för att ange vilka rader som ska filtreras. Välj vilken kolumn med :meth:`Gtk.TreeModelFilter.set_visible_column`.

source: Let's look at a full example which uses the whole :class:`Gtk.ListStore` - :class:`Gtk.TreeModelFilter` - :class:`Gtk.TreeModelFilter` - :class:`Gtk.TreeView` stack.
pt_br: Vejamos um exemplo completo que usa a pilha inteira :class:`Gtk.ListStore` - :class:`Gtk.TreeModelFilter` - :class:`Gtk.TreeModelFilter` - :class:`Gtk.TreeView`.
sv: Låt oss se ett fullständigt exempel som använder hela stacken :class:`Gtk.ListStore` - :class:`Gtk.TreeModelFilter` - :class:`Gtk.TreeModelFilter` - :class:`Gtk.TreeView`.

source: How to Deal With Strings
pt_br: Como Lidar com Sequências de Caracteres
sv: Hur du hanterar strängar

source: This section explains how strings are represented in Python 2.x, Python 3.x and GTK+ and discusses common errors that arise when working with strings.
pt_br: Esta seção explica como as cadeias de caracteres são representadas no Python 2.x, no Python 3.x e no GTK+ e discute erros comuns que surgem ao trabalhar com strings.
sv: Detta avsnitt förklarar hur strängar representeras i Python 2.x, Python 3.x och GTK+ samt diskuterar vanliga fel som uppstår vid arbete med strängar.

source: Definitions
pt_br: Definições
sv: Definitioner

source: Conceptually, a string is a list of characters such as 'A', 'B', 'C' or 'É'. **Characters** are abstract representations and their meaning depends on the language and context they are used in. The Unicode standard describes how characters are represented by **code points**. For example the characters above are represented with the code points U+0041, U+0042, U+0043, and U+00C9, respectively. Basically, code points are numbers in the range from 0 to 0x10FFFF.
sv: Som ett koncept är en sträng en lista tecken så som ”A”, ”B”, ”C” or ”É”. **Tecken** är abstrakta representationer och deras betydelse beror på språket och sammanhanget de används i. Unicode-standarden beskriver hur tecken representeras med **kodpunkter**. Exempelvis representeras tecknen ovan med kodpunkterna U+0041, U+0042, U+0043 respektive U+00C9. Kodpunkter är helt enkelt tal i intervallet 0 till 0x10FFFF.

source: As mentioned earlier, the representation of a string as a list of code points is abstract. In order to convert this abstract representation into a sequence of bytes, the Unicode string must be **encoded**. The simplest form of encoding is ASCII and is performed as follows:
sv: Som nämndes tidigare är representationen av en sträng som en lista med kodpunkter abstrakt. För att konvertera denna abstrakta representation till en sekvens byte så behöver Unicode-strängen **kodas**. Den enklaste formen av kodning är ASCII och utförs som följer:

source: If the code point is < 128, each byte is the same as the value of the code point.
pt_br: Se o ponto de código for < 128, cada byte é o mesmo que o valor do ponto de código.
sv: Om kodpunkten är < 128 så är varje byte detsamma som värdet på kodpunkten.

source: If the code point is 128 or greater, the Unicode string can't be represented in this encoding. (Python raises a :exc:`UnicodeEncodeError` exception in this case.)
pt_br: Se o ponto de código for 128 ou maior, a string Unicode não poderá ser representada nessa codificação. (Python dispara uma exceção :exc:`UnicodeEncodeError` neste caso.)
sv: Om kodpunkten är 128 eller större, så kan Unicode-strängen inte representeras i denna kodning. (Python utfärdar ett :exc:`UnicodeEncodeError`-undantag i detta fall.)

source: Although ASCII encoding is simple to apply it can only encode for 128 different characters which is hardly enough. One of the most commonly used encodings that addresses this problem is UTF-8 (it can handle any Unicode code point). UTF stands for "Unicode Transformation Format", and the '8' means that 8-bit numbers are used in the encoding.
pt_br: Embora a codificação ASCII seja simples de aplicar, ela só pode codificar 128 caracteres diferentes, o que não é suficiente. Uma das codificações mais usadas para resolver esse problema é o UTF-8 (ele pode manipular qualquer ponto de código Unicode). UTF significa "Formato de Transformação Unicode" e "8" significa que números de 8 bits são usados na codificação.
sv: Även om ASCII-kodning är lätt att tillämpa så kan den bara koda 128 olika tecken vilket knappast är tillräckligt. En av de vanligast använda kodningarna som tar itu med detta problem är UTF-8 (den kan hantera alla Unicode-kodpunkter). UTF står för ”Unicode Transformation Format”, och ”8” står för att 8-bitars tal används i kodningen.

source: Python 2.x’s Unicode Support
pt_br: Suporte Unicode do Python 2.x
sv: Unicode-stöd i Python 2.x

source: Python 2 comes with two different kinds of objects that can be used to represent strings, :class:`str` and :class:`unicode`. Instances of the latter are used to express Unicode strings, whereas instances of the :class:`str` type are byte representations (the encoded string). Under the hood, Python represents Unicode strings as either 16- or 32-bit integers, depending on how the Python interpreter was compiled. Unicode strings can be converted to 8-bit strings with :meth:`unicode.encode`::
pt_br: O Python 2 vem com dois tipos diferentes de objetos que podem ser usados para representar strings :class:`str` e :class:`unicode`. Instâncias do último são usadas para expressar cadeias Unicode, enquanto instâncias do tipo :class:`str` são representações de byte (a string codificada). Sob o capô, Python representa strings Unicode como números inteiros de 16 ou 32 bits, dependendo de como o interpretador Python foi compilado. Strings Unicode podem ser convertidas em strings de 8 bits com :meth:`unicode.encode`::
sv: Python 2 kommer med två olika sorters objekt som kan användas för att representera strängar, :class:`str` och :class:`unicode`. Instanser av den senare används för att uttrycka Unicode-strängar, medan instanser av typen :class:`str` är byterepresentationer (den kodade strängen). Under huven representerar Python Unicode-strängar antingen som 16- eller 32-bitars heltal, beroende på hur Python-tolken kompilerades. Unicode-strängar kan konverteras till 8-bitars strängar med :meth:`unicode.encode`::

source: Python’s 8-bit strings have a :meth:`str.decode` method that interprets the string using the given encoding::
pt_br: As strings de 8 bits do Python têm um método :meth:`str.decode` que interpreta a string usando a codificação fornecida::
sv: Pythons 8-bitars strängar har en :meth:`str.decode`-metod som tolkar strängen med given kodning::

source: Unfortunately, Python 2.x allows you to mix :class:`unicode` and :class:`str` if the 8-bit string happened to contain only 7-bit (ASCII) bytes, but would get :exc:`UnicodeDecodeError` if it contained non-ASCII values::
pt_br: Infelizmente, o Python 2.x permite que você misture :class:`unicode` e :class:`str` se a string de 8 bits contivesse apenas bytes de 7 bits (ASCII), mas obteria :exc:`UnicodeDecodeError` se contivesse valores não-ASCII:
sv: Tyvärr låter Python 2.x dig mixa :class:`unicode` och :class:`str` om 8-bitarssträngen råkade innehålla endast 7-bitars byte (ASCII), men skulle få :exc:`UnicodeDecodeError` om den innehöll värden som inte var ASCII::

source: Unicode in GTK+
pt_br: Unicode no GTK+
sv: Unicode i GTK+

source: GTK+ uses UTF-8 encoded strings for all text. This means that if you call a method that returns a string you will always obtain an instance of the :class:`str` type. The same applies to methods that expect one or more strings as parameter, they must be UTF-8 encoded. However, for convenience PyGObject will automatically convert any :class:`unicode` instance to :class:`str` if supplied as argument::
pt_br: O GTK+ usa strings codificadas em UTF-8 para todo o texto. Isto significa que se você chamar um método que retorna uma string, você sempre obterá uma instância do tipo :class:`str`. O mesmo se aplica aos métodos que esperam um ou mais strings como parâmetro, eles devem ser codificados em UTF-8. No entanto, por conveniência, o PyGObject converterá automaticamente qualquer instância :class:`unicode` para :class:`str` se fornecido como argumento::
sv: GTK+ använder UTF-8-kodade strängar för all text. Detta betyder att om du anropar en metod som returnerar en sträng kommer du alltid erhålla en instans av typen :class:`str`. Detsamma gäller metoder som förväntar sig en eller flera strängar som parameter, de måste vara UTF-8-kodade. För bekvämlighet kommer dock PyGObject automatiskt konvertera alla :class:`unicode`-instanser till :class:`str` om de tillhandahålls som argument::

source: Note the warning at the end. Although we called :meth:`Gtk.Label.set_text` with a :class:`unicode` instance as argument, :meth:`Gtk.Label.get_text` will always return a :class:`str` instance. Accordingly, ``txt`` and ``unicode_string`` are *not* equal.
pt_br: Observe o aviso no final. Apesar de chamarmos :meth:`Gtk.Label.set_text` com uma instância de :class:`unicode` como argumento, :meth:`Gtk.Label.get_text` sempre retornará uma instância :class:`str`. Assim, ``txt`` e ``unicode_string`` *não* são iguais.
sv: Observera varningen i slutet. Även om vi anropade :meth:`Gtk.Label.set_text` med en :class:`unicode`-instans som argument, så kommer :meth:`Gtk.Label.get_text` alltid returnera en :class:`str`-instans. Därmed är ``txt`` och ``unicode_string`` *inte* lika.

source: This is especially important if you want to internationalize your program using `gettext <https://docs.python.org/3/library/gettext.html>`_. You have to make sure that gettext will return UTF-8 encoded 8-bit strings for all languages. In general it is recommended to not use :class:`unicode` objects in GTK+ applications at all and only use UTF-8 encoded :class:`str` objects since GTK+ does not fully integrate with :class:`unicode` objects. Otherwise, you would have to decode the return values to Unicode strings each time you call a GTK+ method::
sv: Detta är särskilt viktigt om du vill internationalisera ditt program med `gettext <https://docs.python.org/3/library/gettext.html>`_. Du måste säkerställa att gettext kommer returnera UTF-8-kodade 8-bitars strängar för alla språk. I allmänhet rekommenderas det att inte använda :class:`unicode`-objekt i GTK+-program överhuvudtaget och endast använda UTF-8-kodade :class:`str`-objekt då GTK+ inte är helt integrerat med :class:`unicode`-objekt. I annat fall kommer du behöva avkoda returvärdena till Unicode-strängar varje gång du anropar en GTK+-metod::

source: Python 3.x's Unicode support
pt_br: Suporte Unicode do Python 3.x
sv: Unicode-stöd i Python 3.x

source: Since Python 3.0, all strings are stored as Unicode in an instance of the :class:`str` type. *Encoded* strings on the other hand are represented as binary data in the form of instances of the :class:`bytes` type. Conceptually, :class:`str` refers to *text*, whereas :class:`bytes` refers to *data*. Use :meth:`str.encode` to go from :class:`str` to :class:`bytes`, and :meth:`bytes.decode` to go from :class:`bytes` to :class:`str`.
sv: Sedan Python 3.0 lagras alla strängar som Unicode i en instans av typen :class:`str`. *Kodade* strängar representeras å andra sidan som binärdata i form av instanser av typen :class:`bytes`. Konceptuellt refererar :class:`str` till *text*, medan :class:`bytes` refererar till *data*. Använd :meth:`str.encode` för att gå från :class:`str` till :class:`bytes`, och :meth:`bytes.decode` för att gå från :class:`bytes` till :class:`str`.

source: In addition, it is no longer possible to mix Unicode strings with encoded strings, because it will result in a :exc:`TypeError`::
pt_br: Além disso, não é mais possível misturar strings Unicode com strings codificadas, porque resultará em um :exc:`TypeError`::
sv: Vidare är det inte längre möjligt att mixa Unicode-strängar med kodade strängar, eftersom det kommer resultera i ett :exc:`TypeError`::

source: As a consequence, things are much cleaner and consistent with Python 3.x, because PyGObject will automatically encode/decode to/from UTF-8 if you pass a string to a method or a method returns a string. Strings, or *text*, will always be represented as instances of :class:`str` only::
pt_br: Como consequência, as coisas são muito mais limpas e consistentes com o Python 3.x, porque o PyGObject irá automaticamente codificar/decodificar para/de UTF-8 se você passar uma string para um método ou um método retornar uma string. Strings, ou *text*, sempre serão representados como instâncias de :class:`str` apenas::
sv: Som en följd av detta är saker mycket prydligare och mer konsekventa med Python 3.x, för PyGObject kommer automatiskt koda/avkoda till/från UTF-8 om du skickar med en sträng till en metod eller om en metod returnerar en sträng. Strängar, eller *text*, kommer alltid endast att representeras som instanser av :class:`str`::

source: References
pt_br: Referências
sv: Referenser

source: `What's new in Python 3.0 <https://docs.python.org/3/whatsnew/3.0.html#text-vs-data-instead-of-unicode-vs-8-bit>`_ describes the new concepts that clearly distinguish between text and data.
sv: `Vad är nytt i Python 3.0 <https://docs.python.org/3/whatsnew/3.0.html#text-vs-data-instead-of-unicode-vs-8-bit>`_ beskriver de nya koncept som tydligt skiljer mellan text och data.

source: The `Unicode HOWTO <https://docs.python.org/3/howto/unicode.html>`_ discusses Python 2.x’s support for Unicode, and explains various problems that people commonly encounter when trying to work with Unicode.
sv: `Unicode HOWTO <https://docs.python.org/dev/howto/unicode.html>`_ diskuterar Unicode-stödet i Python 2.x, och förklarar olika problem som folk vanligen stöter på då de försöker arbeta med Unicode.

source: The `Unicode HOWTO for Python 3.x <https://docs.python.org/dev/howto/unicode.html>`_ discusses Unicode support in Python 3.x.
pt_br: O `Unicode HOWTO for Python 3.x <https://docs.python.org/dev/howto/unicode.html>`_ discute o suporte a Unicode no Python 3.x.
sv: `Unicode HOWTO för Python 3.x <https://docs.python.org/dev/howto/unicode.html>`_ diskuterar Unicode-stöd i Python 3.x.

source: `UTF-8 encoding table and Unicode characters <https://www.utf8-chartable.de>`_ contains a list of Unicode code points and their respective UTF-8 encoding.
sv: `UTF-8 encoding table and Unicode characters <https://www.utf8-chartable.de>`_ innehåller en lista över Unicode-kodpunkter och deras respektive UTF-8-kodning.

source: Application
pt_br: Aplicação

source: You can also very easily make keybindings for actions by setting the `accel` property in the :class:`Gio.Menu` file or by using :meth:`Gtk.Application.add_accelerator()`.
pt_br: Você também pode facilmente criar keybindings para ações definindo a propriedade `accel` no arquivo :class:`Gio.Menu` ou usando :meth:`Gtk.Application.add_accelerator()`.

source: Applications should connect to the "destroy" signal of the top-level window. It is emitted an object is destroyed, so when a user requests that a toplevel window is closed, the default handler for this signal destroys the window, but does not terminate the application. Connecting the "destroy" signal of the top-level window to the function :func:`Gtk.main_quit` will result in the desired behaviour.
pt_br: Os aplicativos devem se conectar ao sinal "destroy" da janela de nível superior. É emitido um objeto é destruído, portanto, quando um usuário solicita que uma janela de nível superior é fechada, o manipulador padrão para este sinal destrói a janela, mas não finaliza o aplicativo. Conectar o sinal "destroy" da janela de nível superior à função :func:`Gtk.main_quit` resultará no comportamento desejado.

source: The :class:`Gtk.Builder` class offers you the opportunity to design user interfaces without writing a single line of code. This is possible through describing the interface by a XML file and then loading the XML description at runtime and create the objects automatically, which the Builder class does for you. For the purpose of not needing to write the XML manually the `Glade <https://glade.gnome.org/>`_ application lets you create the user interface in a WYSIWYG (what you see is what you get) manner
pt_br: A classe :class:`Gtk.Builder` oferece a você a oportunidade de projetar interfaces de usuário sem escrever uma única linha de código. Isso é possível descrevendo a interface por um arquivo XML e, em seguida, carregando a descrição XML em tempo de execução e criando os objetos automaticamente, o que a classe Builder faz por você. Para o propósito de não precisar escrever o XML manualmente, o aplicativo `Glade <https://glade.gnome.org/>`_ permite criar a interface do usuário de uma maneira WYSIWYG (o que você vê é o que obtém)

source: Button
pt_br: Botão

source: ToggleButton
pt_br: Botão de Alternância

source: CheckButton
pt_br: Botão de Seleção

source: RadioButton
pt_br: Botão de Radio

source: LinkButton
pt_br: Botão Link

source: SpinButton
pt_br: Botão Giratório

source: Switch
pt_br: Interruptor

source: Installation
pt_br: Instalação

source: The first step before we start with actual coding consists of setting up `PyGObject`_ and its dependencies. PyGObject is a Python module that enables developers to access GObject-based libraries such as GTK+ within Python. It exclusively supports GTK+ version 3 or later. If you want to use GTK+ 2 in your application, use `PyGTK`_, instead.
pt_br: O primeiro passo antes de começarmos com a codificação de fato consiste em configurar o `PyGObject`_ e suas dependências. PyGObject é um módulo Python que permite aos desenvolvedores acessar bibliotecas baseadas no GObject, como o GTK+, dentro do Python. Ele suporta exclusivamente o GTK+ versão 3 ou posterior. Se você quiser usar o GTK+ 2 em sua aplicação, use `PyGTK`_.

source: Finally, we start the GTK+ processing loop which we quit when the window is closed (see line 5).
pt_br: Finalmente, iniciamos o loop de processamento do GTK+, que encerramos quando a janela é fechada (veja a linha 5).

source: Table
pt_br: Tabela

source: :class:`Gtk.UIManager` provides an easy way of creating menus and toolbars using an `XML-like description <http://developer.gnome.org/gtk3/stable/GtkUIManager.html#XML-UI>`_.
pt_br: :class:`Gtk.UIManager` fornece uma maneira fácil de criar menus e barras de ferramentas usando uma descrição `XML-like <http://developer.gnome.org/gtk3/stable/GtkUIManager.html#XML-UI>`_.

source: ``(int,)`` indicates the signal arguments, here, the signal will only take one argument, whose type is int. This argument type list must end with a comma.
pt_br: ``(int,)`` indica os argumentos do sinal, aqui, o sinal só receberá um argumento, cujo tipo é int. Essa lista de tipos de argumentos deve terminar com uma vírgula.

source: :const:`GObject.SIGNAL_RUN_FIRST` can be replaced with :const:`GObject.SIGNAL_RUN_LAST` or :const:`GObject.SIGNAL_RUN_CLEANUP`. ``None`` is the return type of the signal. ``(int,)`` is the list of the parameters of the signal, it must end with a comma.
pt_br: :const:`GObject.SIGNAL_RUN_FIRST` pode ser substituído por :const:`GObject.SIGNAL_RUN_LAST` ou :const:`GObject.SIGNAL_RUN_CLEANUP`. ``None`` é o tipo de retorno do sinal. ``(int,)`` é a lista dos parâmetros do sinal, deve terminar com uma vírgula.

source: The :class:`Gtk.Popover` is a seperate window used for displaying additional information and are often used as a part of button menus and context menus. Their uses are similar to those of dialog windows with the advantage of being less disruptive and having a connection with the widget the popover is pointing to. Popovers have are visually connected to a related widget with a small triangle.
pt_br: O :class:`Gtk.Popover` é uma janela separada usada para exibir informações adicionais e é frequentemente usada como parte de menus de botão e menus de contexto. Seus usos são semelhantes aos das janelas de diálogo, com a vantagem de ser menos prejudicial e ter uma conexão com o widget para o qual o popover está apontando. Os popovers estão visualmente conectados a um widget relacionado com um pequeno triângulo.

source: ApPopover can be created with :class:`Gtk.Popover`; for opening the popover use :meth:`Gtk.Widget.show_all`.
pt_br: O ApPopover pode ser criado com :class:`Gtk.Popover`; para abrir o popover use :meth:`Gtk.Widget.show_all`.

source: A widget can be added to a popover using the :meth:`Gtk.Container.add`.
pt_br: Um widget pode ser adicionado a um popover usando o :meth:`Gtk.Container.add`.

source: ProgressBar
pt_br: Barra de Progresso

source: Automatically updates when data added, removed or edited
pt_br: Atualiza automaticamente quando os dados são adicionados, removidos ou editados

source: Sorting of data
pt_br: Classificação de dados

source: Support embedding widgets such as check boxes, progress bars, etc.
pt_br: Suporte a incorporação de widgets, como caixas de seleção, barras de progresso, etc.

source: Filtering of data
pt_br: Filtragem de dados

source: Keep in mind, that if you use :class:`Gtk.TreeStore`, the above code will only iterate over the rows of the top level, but not the children of the nodes. To iterate over all rows and its children, use the ``print_tree_store`` function.
pt_br: Tenha em mente que, se você usar :class:`Gtk.TreeStore`, o código acima irá apenas iterar sobre as linhas do nível superior, mas não os filhos dos nós. Para iterar sobre todas as linhas e seus filhos, use a função ``print_tree_store``.

source: In the same way the sorting function works, the :class:`Gtk.TreeModelFilter` needs a "visibility" function, which, given a row from the underlying model, will return a boolean indicating if this row should be filtered out or not. It's set by :meth:`Gtk.TreeModelFilter.set_visible_func`:
pt_br: Da mesma forma que funciona a função de classificação, o :class:`Gtk.TreeModelFilter` precisa de uma função de "visibilidade", que, dada uma linha do modelo subjacente, retornará um booleano indicando se essa linha deve ser filtrada ou não. É definido por :meth:`Gtk.TreeModelFilter.set_visible_func`:
